# _*_ coding: utf-8

from Letters import *

# Наборы регулярных выражений вида:
# [find, replace [, flags] ]
# компилируются перед запуском основной функции

# Буквы в словах: ѿ, ѡ, ѵ, ѣ, etc

VA = r'\g<0>' + Varia
OX = r'\g<0>' + Oxia
IS = r'\g<0>' + Iso
GKA = r'\g<0>' + Kamora
GAP = r'\g<0>' + Apostrof
ER = r'\1' + Erok
# GER = r'\g<0>' + Erok
# ZG = r'\g<0>'

# Ударения
r'''
    Набор правил для ударений.
    В основном используются regex методы look ahead/behind
    Ударение ставится после группы \g<0>
    [r'\bада(?=м)', OX, 'i'],
    в данном правиле это "ада". 
    OX - оксия, VA - вария, IS - исо и т.д.
    Остаьная часть слова (после ударения) остается неизменной
    флаг 'i' - регистронезависимость (исключение - для ^[Оᲂ]у)
'''
regs_acutes = (
    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ааа aaa

    [r'\bаарѡ(?=н)', OX, 'i'],
    [r'\bа(?=біе\b)', IS, 'i'],
    [r'\bа(?=вел)', IS, 'i'],
    # а҆́вва а҆́вво
    [r'\bа(?=вв)', IS, 'i'],
    [r'\bаермѡ(?=н)', OX, 'i'],
    [r'\bа(?=гн[еи]?[цч])', IS, 'i'],

    [r'\bа(?=д[аꙋѣеъ]\b)', IS, 'i'],
    [r'\bа(?=дов\B)', IS, 'i'],
    [r'\bа(?=дс\B)', IS, 'i'],

    [r'\bада(?=м)', OX, 'i'],
    [r'\bа(?=зъ\b)', IS, 'i'],
    [r'ака(?=ѳіст)', OX, 'i'],
    [r'\bа(?=ки\b)', IS, 'i'],
    [r'алеѯі', OX, 'i'],
    [r'алеѯа(?!ндрі)', OX, 'i'],
    [r'алеѯандрі', OX, 'i'],

    [r'аллилꙋ(?=і[ѧа])', OX, 'i'],
    [r'\bа(?=лчꙋ)', IS, 'i'],
    [r'амвѡ(?=н)', OX, 'i'],
    [r'ами(?=нь)', OX, 'i'],
    [r'\bа(?=може\b)', IS, 'i'],
    [r'\bа(?=нгел)', IS, 'i'],
    [r'анті(?=хр)', OX, 'i'],
    [r'анат[оѡ]', OX, 'i'],
    [r'апо(?=стол)', OX, 'i'],
    [r'арха(?=нгел)', OX, 'i'],
    [r'архистрати', OX, 'i'],
    [r'аѳана', OX, 'i'],
    [r'аѳѡ(?=н)', OX, 'i'],
    [r'\bа(?=ще\b)', IS, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ббб bbb

    [r'багрѧни(?=ц)', OX, 'i'],
    [r'багрѧ(?!ниц)', OX, 'i'],

    [r'бдѣ\b', VA, 'i'],
    [r'бдѣ(?!ва)\B', OX, 'i'],
    [r'бдѣва', OX, 'i'],

    # =========================
    # -бед-
    [r'\bбѣ(?=д([енс]\w|ъ)\b)', OX, 'i'],
    [r'\bбѣд([аеꙋ]\b|о(?=\w))', OX, 'i'],
    [r'\bбѣд[аꙋ]\b', VA, 'i'],

    # =========================
    # -бег-, -беж-
    # отбеже
    [r'''  
        (^[Оᲂ]у|\b(из|при|ѿ)?)
        бѣ
        [гж]
        [аеиꙋ]
        \b
        ''', VA, 'i'],

    # избѣглъ избѣгнꙋти
    [r'(^[Оᲂ]у|\b(из|при|ѿ|на)?)бѣ(?=г(л?ъ|н))', OX, 'i'],

    [r'\bбѣ(?=га)', OX, 'i'],
    [r'\Bбѣ[гж]а', OX, 'i'],
    [r'(^[Оᲂ]у|\b)бѣжа\B', OX, 'i'],
    # прибѣжище
    [r'(^[Оᲂ]у|\bпри)бѣ(?=жи)', OX, 'i'],

    # избѣга́ти избѣго́х
    [r'(^[Оᲂ]у|\b(из|при|ѿ))бѣг[оа](?=\w+)', OX, 'i'],
    # ---- -бег-, -беж- ---------------

    [r'безмѣ(?=(р|ст)н)', OX, 'i'],
    [r'безнача(?=л)', OX, 'i'],
    [r'безбо(?=ж)', OX, 'i'],
    [r'безгла(?=с)', OX, 'i'],
    [r'беззако(?=н)', OX, 'i'],
    [r'безмо(?=л)', OX, 'i'],
    [r'безпло(?=т)', OX, 'i'],
    [r'безꙋ(?=м)', OX, 'i'],
    [r'безчи(?=с)', OX, 'i'],
    # бѣлый
    [r'\bбѣ(?=л[аꙋы]\w)', OX, 'i'],
    [r'\bбѣ(?=ло(м[ꙋъ]|[ею]))', OX, 'i'],
    [r'\bбѣло\b', VA, 'i'],
    [r'\bбѣлоза', OX, 'i'],
    [r'\bбѣлока', OX, 'i'],
    [r'\bбѣлопе', OX, 'i'],
    [r'\bбѣлори', OX, 'i'],
    [r'\bбѣлостѣ', OX, 'i'],

    [r'''  # убеленный 
        (\b|^[Оᲂ]у)
        бѣл
        (?![аоꙋы]\w) # ! бѣлый
        [еиоѧ]\B
        ''', OX, 'i'],
    # ---- -бел- -----------------

    [r'\bбѣ(?=с[аиꙋыъ]\b)', OX, 'i'],
    [r'\bбѣ(?=сомъ\b)', OX, 'i'],
    [r'\bбѣсо(?=вск)', OX, 'i'],
    [r'\bбѣ\b', VA, 'i'],

    # бесте беша бехом
    [r''' 
        \b
        бѣ
        (?=
            сте
            |х(?=(ом)?ъ)
            |ша
        )   
        ''', OX, 'i'],

    [r'\bбде\b', VA, 'i'],
    [r'\bбде(?=[нт])', OX, 'i'],
    [r'\bби(?=сер)', OX, 'i'],

    # =========================
    # -благ- -блаж -
    [r'бла(?=г[ѣиоѡꙋъ]\b)', OX, 'i'],
    [r'блага\B', OX, 'i'],
    [r'благі(?=[йеѧ])', OX, 'i'],
    [r'благи(?=[мх][иъ]\b)', OX, 'i'],

    [r'благовѣ(?=щені[аеюѧ]\b)', OX, 'i'],
    [r'благовѣ(?=ст[ін])', OX, 'i'],  # @@@ ѣ
    [r'благовѣсти\b', VA, 'i'],  # @@@ ѣ
    [r'благовѣсти\B', OX, 'i'],  # @@@ ѣ
    [r'благовѣствꙋ', OX, 'i'],  # @@@ ѣ
    [r'благовѣствова\B', OX, 'i'],  # @@@ ѣ
    [r'благовѣствова\b', VA, 'i'],  # @@@ ѣ

    [r'благоговѣ(?=й?н)', OX, 'i'],

    [r'благово(?=н)', OX, 'i'],
    [r'благоволе(?=н)', OX, 'i'],
    [r'благоволи\b', VA, 'i'],
    [r'благоволи\B', OX, 'i'],
    [r'благоволѧ\B', OX, 'i'],

    [r'благодар[ѧю]\b', VA, 'i'],
    # благодарим
    [r'благодар[иеѧ](?=\w+)', OX, 'i'],
    # благодарно, благодать
    [r'благода(?=[рт](?![иеѧ]\w+|[юѧ]\b))', OX, 'i'],
    [r'благодѣ(?!ѧні\B)', OX, 'i'],
    [r'благодѣѧ(?=ні\B)', OX, 'i'],
    [r'благо(?=[йе]|м[ꙋъ])', OX, 'i'],
    [r'благоѡбра(?=з)', OX, 'i'],
    [r'благоро(?=д)', OX, 'i'],
    [r'благосе(?=рд)', OX, 'i'],
    # благослове́нїе
    [r'благослове(?=н)', OX, 'i'],
    # благослови
    [r'благослов([иѧ]|лю)\b', VA, 'i'],
    [r'благослов([иѧ]|лѧ)\B', OX, 'i'],

    [r'благоꙋтро', OX, 'i'],
    [r'благоꙋха', OX, 'i'],
    [r'благочести(?=в)', OX, 'i'],
    [r'благоче(?=сті)', OX, 'i'],
    [r'бла(?=гꙋ\b)', OX, 'i'],
    [r'благꙋ(?=ю)', OX, 'i'],

    # -блаж-
    [r'\bбла(?=же\b)', OX, 'i'],
    # ᲂу҆блажа́емъ блаже́нный # ! блаже
    [r'блаж(?!е\b)[аеи]', OX, 'i'],
    # --------------------------

    [r'блꙋ(?=д([шъ]|имъ|н(?!и[кц])))', OX, 'i'],
    [r'блꙋди\b', VA, 'i'],
    [r'блꙋди\B(?!мъ)', OX, 'i'],
    [r'блꙋдни(?=[цч])', OX, 'i'],
    [r'блꙋдник[аи]\b', VA, 'i'],
    [r'блꙋжд[аеє]', OX, 'i'],


    # =========================
    # -бог- -бож- -боз-
    [r''' # бо́гъ бо́гꙋ бо́гомъ  
        
        (^[Оᲂ]у|\b) # ᲂу҆бо́гїй вынести отдельно
        бо
        (?=г
            (
                [аеиꙋъ]
                |ій  # вынести отдельно
                |о(мъ|ви)
            )\b
        )
        ''', OX, 'i'],
    [r'''  # бога́тый бога́тно
        бога
        (?=т(
            ъ
            |[аіоꙋы]\w\b # бога́тый
            |[оы]м\w?   # бога́томꙋ бога́тымъ 
            |н([аеоѡꙋы]) # бога́тно
            |ств
            )
        )
        ''', OX, 'i'],

    # бо́же бо́жїй
    [r''' 
        \b
        бо
        (?=
            ж
            (е|і[аеийюѧ])\b
        )
        ''', OX, 'i'],

    [r'бо(?=жіи[мх])', OX, 'i'],
    [r'боже(?=ственн)', OX, 'i'],
    [r'\bбожеств[аѣоꙋ]\b', VA, 'i'],
    # бо́зе бо́зи
    [r'\bбо(?=з[еѣи]\b)', OX, 'i'],
    # ---- -бог- -бож- -боз- -------

    [r'боговѣ(?=дѣн)', OX, 'i'],
    [r'богодꙋхнове(?=нн)', OX, 'i'],
    [r'богоно(?=с)', OX, 'i'],
    [r'богоразꙋ', OX, 'i'],
    [r'богоро(?=ди[чц])', OX, 'i'],
    [r'богороди(?=тельниц)', OX, 'i'],
    [r'богосло', OX, 'i'],
    [r'болѣ(?=зн)', OX, 'i'],

    # бо́ль бо́ли споболѝ боли́тъ бо́лїю
    [r'\bбо(?=л([иь]|ію)\b)', OX, 'i'],
    [r'\Bболи\b', VA, 'i'],
    [r'боли\B', OX, 'i'],
    [r'болѧ(?=[йщ])', OX, 'i'],

    # бо́льше бо́льшимъ
    [r'бо(?=льш[еиꙋ])', OX, 'i'],

    [r'брад[аѣꙋы]', VA, 'i'],
    [r'брад[аеѣо]\B', OX, 'i'],
    [r'бра(?=дъ)', OX, 'i'],

    [r'бра(?=к(?!о))', OX, 'i'],
    [r'браконеискꙋ(?=с)', OX, 'i'],
    [r'бракоѡкра(?=д)', OX, 'i'],
    [r'бра(?=ч)', OX, 'i'],

    [r'\b(вз)?бра(?=н(?!([иѧ]|ноискꙋс)\B))', OX, 'i'],
    [r'\bвозбран[ию]\b', VA, 'i'],
    [r'возбран[еєиѧ]\B', OX, 'i'],
    [r'возбра(?=нн\B)', OX, 'i'],

    [r'\bбран[иѧ]\B', OX, 'i'],

    [r'бра(?=т[еѣінсꙋъ])', OX, 'i'],

    # бꙋ́дꙋ
    [r'(?<!оз|по)бꙋ(?=д(е[тм]ъ|[иꙋ]))', OX, 'i'],

    [r'бы(?=(л[иоъ]|ти|ст[еь]|ша|хъ)\b)', OX, 'i'],
    [r'была\b', VA, 'i'],
    # быва́етъ бы́вшїй
    [r'бы(?=в[сшъы])', OX, 'i'],
    [r'быва', OX, 'i'],
    # бытїѐ бытїе́мъ
    [r'\b(не|паки)?быті[еиюѧ]\b', VA, 'i'],
    [r'\b(не|паки)?бытіе(?=мъ\b)', OX, 'i'],
    [r'(?<!одо)бѧ(?=ш)', OX, 'i'],
    [r'(?<!орб)бѧ(?=хꙋ\b)', OX, 'i'],

    # бꙋ́рѧ бꙋ́рный
    [r'(?<![ѻѡ])бꙋ(?=р)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ввв vvv

    [r'вавило(?=н)', OX, 'i'],
    [r'валаа(?=м)', OX, 'i'],

    [r'\bва(?=м[ъи]\b)', OX, 'i'],
    [r'\bва(?=съ\b)', OX, 'i'],
    [r'\bва(?=ш)', OX, 'i'],

    [r'\bвдохнове(?=н)', OX, 'i'],
    [r'\bвдохнови\b', VA, 'i'],
    [r'\bвдохнови\B', OX, 'i'],
    [r'\bвдохновлѧ', OX, 'i'],
    [r'\bвдохновѧ', OX, 'i'],


    # ========================
    #   вѣд вѣж вѣм вѣт вѣс вѣщ
    #   -вѣд-
    [r'''
        \b
        (
            (не)?(из)?
            |испо
            |(?<!за)(про)?по
        )?
        вѣ
        (?=д(
            а [елнтхюѧ]?
            |[еѣ] [нтхш]
            |и [хш]
            |о [м]
            |ꙋ [еюѧ]
            |ы й
            |ѧ т
            |н 
        ))
        ''', OX, 'i'],

    #   -вѣж-
    [r'\b(не)?вѣ(?=ж)', OX, 'i'],

    #   -вѣм-
    [r'''    
        \b
        ((ис)?по)?
        вѣ
        (?=м[ыъ])
        ''', OX, 'i'],

    #   -вѣс-
    [r'\b(не)?вѣ(?=с(и\b|т))', OX, 'i'],
    [r'возвѣсти\B', OX, 'i'],
    # со́вѣсть
    [r'\bсо(?=вѣст)', OX, 'i'],

    #   -вѣт- (! цвѣ́тъ свѣт вѣтіи, вѣтвѧми)
    [r'(?<![сц])вѣ(?=т(?!і[иѧ]|вѧм))', OX, 'i'],
    # вѣтіи
    [r'\bвѣті(?=[иѧ])', OX, 'i'],


    [r'вече(?=рн)', OX, 'i'],
    [r'ве(?=чери\b)', OX, 'i'],

    #   -вѣщ- отдельно : -свѣщ-
    [r'вѣ(?=щій\b)', OX, 'i'],
    [r'вѣща(?!ва)\B', OX, 'i'],
    [r'вѣща\b', VA, 'i'],
    [r'вѣ(?=щенск)', OX, 'i'],
    [r'вѣщꙋ\b', VA, 'i'],

    [r'веще(?=ственн)', OX, 'i'],
    [r'\bве(?=щь\b)', OX, 'i'],

    # ---- вѣд вѣж вѣм вѣт вѣс вѣщ ----

    [r'веде(?=ши(сѧ)?\b)', OX, 'i'],
    [r'введе\B', OX, 'i'],
    [r'введе\b', VA, 'i'],

    [r'вездѣ\b', VA, 'i'],

    # ========================
    # век- вец- веч-
    [r'\bвѣ(?=к(?![оѡ]в|ам))', OX, 'i'],
    [r'''
        \b
        вѣк[аоѡ]
        (?=[мвх][иъ])
        ''', OX, 'i'],

    [r'вѣ(?=цѣ(хъ)?)', OX, 'i'],
    [r'вѣ(?=че?н)', OX, 'i'],
    # ---- век- вец- веч- ----------

    [r'велѣ(?=[нстхш]|въ)', OX, 'i'],
    [r'повелѣва', OX, 'i'],
    [r'повел[ѣию]\b', VA, 'i'],

    # ве́лїй
    [r'(пре)?ве(?=лі(?!ар))', OX, 'i'],
    [r'вели(?=к(?!о(мꙋч|л[ѣе]п)))', OX, 'i'],
    [r'вели(?=ц)', OX, 'i'],
    [r'великолѣ(?=п)', OX, 'i'],
    [r'велича\B', OX, 'i'],
    [r'вели(?=ч[иі])', OX, 'i'],

    [r'велегла', OX, 'i'],

    # ========================
    #   венц- венч-
    [r'\bвѣне(?=цъ\b)', OX, 'i'],
    [r'\bвѣнц[аеѣꙋы]\b', VA, 'i'],

    # вѣнца́ми
    [r''' 
        \b
        вѣнц
        (?!
            [аеѣꙋы]\b   # ! вѣнцꙋ̀
            |ецъ\b      # ! вѣне́цъ   
        )
        [аеєоѡ]
        (?=\w+)
        ''', OX, 'i'],

    # вѣнча̀
    [r'(^[Оᲂ]у|\b([ѻѡ]б)?)вѣнча\b', VA, 'i'],

    # вѣ́нче вѣ́нчанъ
    [r'''    
        (^[Оᲂ]у|\b(раз|[ѻѡ]б)?)
        вѣ
        (?=нч(е|анъ)\b)
        ''', OX, 'i'],
    # вѣнча́еши
    [r'''
        (
            ^[Оᲂ]у
            |\b(?:[ѻѡ]б)?
        )
        вѣнч
        (?!  # ! вѣнча̀ вѣ́нче вѣ́нчанъ
            ([ае]|анъ)\b 
        )
        а   # ударн.
        ''', OX, 'i'],
    # ----  венц- венч- --------------

    # -вѣр-
    [r'(?<!ѕ)вѣ(?=р[аеиноꙋыѧ])', OX, 'i'],

    [r'вертогра(?=д)', OX, 'i'],

    [r'верте(?=п)', OX, 'i'],

    [r'ве(?=сь\b)', OX, 'i'],

    [r'весели\b', VA, 'i'],
    [r'весе(?=лі)', OX, 'i'],
    [r'весел[иѧ]', OX, 'i'],

    [r'весьма\b', VA, 'i'],
    [r'вѣтвѧ(?=м)', OX, 'i'],

    [r'взира', OX, 'i'],
    [r'взыва', OX, 'i'],
    [r'взыгра', OX, 'i'],

    # взы́ди взыдо́хъ
    [r'взы(?=д[еиꙋ])', OX, 'i'],
    [r'взыдо', OX, 'i'],

    [r'взыска\b', VA, 'i'],
    [r'взыск[аꙋ]\B', OX, 'i'],
    [r'взыщ[иꙋ]\b', VA, 'i'],
    [r'взы(?=щ[еиꙋ]\B)', OX, 'i'],

    # ви́ждь
    [r'ви(?=жд)', OX, 'i'],
    [r'ви(?=дит)', OX, 'i'],
    [r'ви(?=дет)', OX, 'i'],
    [r'ви(?=дѧ)', OX, 'i'],
    [r'ви(?=жꙋ\b)', OX, 'i'],

    [r'ви(?=дѣ\b)', OX, 'i'],
    [r'ви(?=дѣ(?!ні|т[еє]л|нь?ми))', OX, 'i'],
    [r'''
        \b
        (
            (брато)?нена  # братоненавидѣ́нїе
            |(лже|за|со|не)?с # свидѣ́телю
            |не
            |сно
            |при 
        )?
        видѣ
        (?=ні|т[еє]л|нь?ми)
        ''', OX, 'i'],

    [r'він[аеоꙋ]\b', VA, 'i'],
    [r'віногра', OX, 'i'],

    [r'\bвкꙋ(?=пѣ\b)', OX, 'i'],

    [r'\bвкꙋси(?=[влсхш]|(ти|[вл]ъ)\b)', OX, 'i'],
    [r'\bвкꙋ(?=съ\b)', OX, 'i'],
    [r'\bвкꙋси\b', VA, 'i'],

    [r'влади(?=мір)', OX, 'i'],
    [r'влады(?=[кчц])', OX, 'i'],

    [r'вложи\b', VA, 'i'],
    [r'вложи\B', OX, 'i'],

    [r'\bвмѣнѧ', OX, 'i'],
    [r'\bвмѣни\B', OX, 'i'],
    [r'\bвмѣни\b', VA, 'i'],

    [r'вни(?=д(?!о[схш]))', OX, 'i'],
    [r'внидо(?=[схш])', OX, 'i'],
    [r'\b(со)?вни(?=ти\b)', OX, 'i'],

    [r'внегда\b', VA, 'i'],

    [r'внꙋ(?=тр(?!и\b|ь[ꙋю]д))', OX, 'i'],
    [r'внꙋтри\b', VA, 'i'],

    [r'внꙋши\b', VA, 'i'],
    [r'внꙋш[аеи]\B', OX, 'i'],

    [r'\bвод[аеѣо]\b', VA, 'i'],
    [r'\bвода\B', OX, 'i'],
    [r'\bводо(?=[йю])', OX, 'i'],
    [r'\bво(?=д[ꙋъ])', OX, 'i'],

    [r'\bводвор[еиюѧ]\B', OX, 'i'],
    [r'\bводвор[ию]\b', VA, 'i'],

    [r'\bвоеди(?=н\B)', OX, 'i'],

    [r'вожделѣ', OX, 'i'],

    [r'возвед[еиꙋ]\b', VA, 'i'],
    [r'\bвозве(?=р(?!за))', OX, 'i'],
    [r'\bвозверза\B', OX, 'i'],
    [r'возвести\b', VA, 'i'],
    [r'возврати\b', VA, 'i'],
    [r'возврати\B', OX, 'i'],

    [r'во(?=згласъ\b)', OX, 'i'],

    [r'возда[юѧ]\b', VA, 'i'],
    [r'возда[юѧ]\B', OX, 'i'],
    [r'возда(?=[мнстхш])\B', OX, 'i'],
    [r'возда(?=в(?!а))', OX, 'i'],
    [r'воздава', OX, 'i'],
    [r'возда(?=й)', OX, 'i'],
    [r'возда(?=л(?!а\b))', OX, 'i'],
    [r'воздала\b', VA, 'i'],

    [r'воздвиг[ао]', OX, 'i'],
    [r'воздви(?=ж|г(?![ао]))', OX, 'i'],
    [r'воздвиза', OX, 'i'],

    [r'воздѣва', OX, 'i'],
    [r'воздѣ(?=ти|еши|ющ)', OX, 'i'],

    [r'воздꙋ(?=[сш]|х(?!ъ))', OX, 'i'],

    [r'воздыха', OX, 'i'],

    [r'возжг[иꙋ]\b', VA, 'i'],
    [r'возжгл[аи]\b', VA, 'i'],
    [r'возжг[оꙋ]\B', OX, 'i'],
    [r'возже\b', VA, 'i'],
    [r'возже(?=г\B)', OX, 'i'],
    [r'возже(?=н\B)', OX, 'i'],
    [r'возжещи\b', VA, 'i'],
    [r'возжещи\B', OX, 'i'],
    [r'возжж[еи]\b', VA, 'i'],
    [r'возжж[еи]\B', OX, 'i'],
    [r'возжзи\b', VA, 'i'],
    [r'возжи[гз]а\B', OX, 'i'],

    [r'возлага\B', OX, 'i'],
    [r'возложа\B', OX, 'i'],
    [r'возлож[иꙋ]\b', VA, 'i'],
    [r'возложе(?=н[іь])', OX, 'i'],
    [r'возложи(?=[влсхш]|т[еи])', OX, 'i'],
    [r'возло(?=жш)', OX, 'i'],
    [r'возло(?=жъ)', OX, 'i'],

    [r'возлюблю\b', VA, 'i'],
    [r'возлю(?=бл([еє]н|ь))', OX, 'i'],
    [r'возлюби\b', VA, 'i'],
    [r'возлюби(?=[влсх]|ти|ша)', OX, 'i'],
    [r'возлю(?=би(мъ|ши))', OX, 'i'],

    [r'возмо(?=ж)', OX, 'i'],

    [r'вознес[еиꙋ]\b', VA, 'i'],
    [r'вознес[еє](?=[мнст])', OX, 'i'],
    [r'вознес[иоꙋы]\B', OX, 'i'],
    [r'возне(?=с([сш]|л[съ]|жес))', OX, 'i'],
    [r'вознесл[аио]\b', VA, 'i'],
    [r'вознесл[аио]\B', OX, 'i'],
    [r'вознести\b', VA, 'i'],
    [r'вознести\B', OX, 'i'],

    [r'возноси\b', VA, 'i'],
    [r'возноси(?=[вл])', OX, 'i'],
    [r'возноси(?=м(?!ъ|сѧ))', OX, 'i'],
    [r'возно(?=сим(ъ|сѧ))', OX, 'i'],
    [r'возноси(?=т[еи](сѧ)?)', OX, 'i'],
    [r'возно(?=сит[ъс])', OX, 'i'],
    [r'возно(?=сиш)', OX, 'i'],
    [r'возносѧ\b', VA, 'i'],
    [r'возносѧ(?!т(ъ|сѧ)\B)', OX, 'i'],
    [r'возно(?=сѧт(ъ|сѧ))', OX, 'i'],

    # возопѝ возопи́ша
    [r'возопи\b', VA, 'i'],
    [r'возоп[іи]\B', OX, 'i'],

    [r'возра(?=д)', OX, 'i'],

    # возсїѧ̀
    [r'возсіѧ\b', VA, 'i'],
    # возсїѧ́й
    [r'возсіѧ(?!\b|ва)', OX, 'i'],
    [r'возсіѧва', OX, 'i'],

    [r'возсле(?=[тш])', OX, 'i'],

    [r'возста\b', VA, 'i'],
    [r'возста(?=в[ишъѧ])', OX, 'i'],
    [r'возстава\B', OX, 'i'],
    [r'возста(?=вленн)', OX, 'i'],
    [r'возставле(?=н[іь])', OX, 'i'],
    [r'возста(?=вл[ью])', OX, 'i'],
    [r'возставлѧ\B', OX, 'i'],
    [r'возста(?=[лтш])', OX, 'i'],
    [r'возста(?=н(?!ов))', OX, 'i'],
    [r'возстановле(?=н)', OX, 'i'],
    [r'возстано(?=ви[вмтхш]ъ)', OX, 'i'],
    [r'возстано(?=вѧт)', OX, 'i'],
    [r'возстанови(?=[тш]и)', OX, 'i'],
    [r'возста[юѧ]\b', VA, 'i'],
    [r'возста[юѧ]\B', OX, 'i'],

    [r'возсыла\b', VA, 'i'],
    [r'возсыла\B', OX, 'i'],

    [r'возше\B', OX, 'i'],

    [r'возьм[иꙋ]\b', VA, 'i'],
    [r'возь?ми\B', OX, 'i'],
    [r'во(?=зьм[еꙋ]т)', OX, 'i'],
    [r'во(?=зме[мш])', OX, 'i'],
    [r'во(?=змет(?!а))', OX, 'i'],
    [r'во(?=змꙋт[съ])', OX, 'i'],

    [r'\bво(?=и\b)', OX, 'i'],
    [r'\bво(?=ин(?!(ств)?(онач|ослов)))', OX, 'i'],

    [r'войн[аеѣꙋ]\b', VA, 'i'],
    [r'войно\B', OX, 'i'],
    [r'во(?=йна\B)', OX, 'i'],
    [r'во(?=йнъ\b)', OX, 'i'],

    [r'вои(?=стин)', OX, 'i'],

    [r'\bво(?=ли(тъ|ши)?\b)', OX, 'i'],
    [r'\b(про|со|благо)?изво(?=ли(?!тел[ьюѧ]))', OX, 'i'],
    [r'(из)?воли(?=тел[ьюѧ])', OX, 'i'],
    [r'\bво(?=л[еѣюѧ])', OX, 'i'],
    [r'благоволю\b', OX, 'i'],
    [r'изво(?=лю\b)', OX, 'i'],
    [r'\Bволѧ\B(?!тъ)', OX, 'i'],
    [r'\Bво(?=лѧтъ)', OX, 'i'],
    [r'\Bволе(?=н[ін])', OX, 'i'],
    [r'во(?=льн(?!о))', OX, 'i'],
    [r'во(?=льно(\b|[еймю]|сть))', OX, 'i'],

    [r'вонми\b', VA, 'i'],
    [r'во(?=нмемъ)', OX, 'i'],

    [r'во(?=нь(же)?\b)', OX, 'i'],
    [r'во(?=нъ\b)', OX, 'i'],

    [r'\bвон[июѧ]\b', VA, 'i'],
    [r'\bвон(?=еѧ\B)', OX, 'i'],

    [r'вопі[еєюѧ]', OX, 'i'],
    [r'вопі[юѧ]\b', VA, 'i'],

    [r'воплоти\B', OX, 'i'],
    [r'воплощ[аеє]\B', OX, 'i'],
    [r'вопло(?=щ[сшь]\B)', OX, 'i'],

    [r'во(?=пл[иью]\b)', OX, 'i'],
    [r'во(?=пле(?!ні)\B)', OX, 'i'],
    [r'вопле(?=ні\B)', OX, 'i'],
    [r'во(?=плѧ)', OX, 'i'],

    [r'воскресн?и\b', VA, 'i'],
    [r'воскре(?=се(нъ)?\b)', OX, 'i'],
    [r'воскре(?=сн[аеоы])', OX, 'i'],
    [r'воскре(?=снꙋю)', OX, 'i'],
    [r'воскре(?=сш)', OX, 'i'],
    [r'воскре(?=сл?ъ)', OX, 'i'],
    [r'воскрес[аиоѧ]\B', OX, 'i'],
    [r'воскресе(?=н[іс])', OX, 'i'],

    [r'воспѣва\B', OX, 'i'],
    [r'воспѣ(?=[лтш]|в[шы]\B)', OX, 'i'],
    [r'воспою\b', VA, 'i'],
    [r'воспѣ\b', VA, 'i'],
    [r'воспо[еи](?=м)', OX, 'i'],

    [r'воста\b', VA, 'i'],
    [r'воста(?=в(?!а))', OX, 'i'],
    [r'востава\B', OX, 'i'],
    [r'востае(?=[мтш])', OX, 'i'],
    [r'воста(?=[лнстхш])', OX, 'i'],
    [r'воста[юѧ]\b', VA, 'i'],
    [r'воста[юѧ]\B', OX, 'i'],

    [r'восто(?=[кцч])', OX, 'i'],

    [r'\Bвосхо(?=ден)', OX, 'i'],
    [r'восходи\b', VA, 'i'],
    [r'восхо(?=ди[мт]ъ)', OX, 'i'],
    [r'восходи(?=[мт](?!ъ))', OX, 'i'],
    [r'восхо(?=диш[иъ])', OX, 'i'],
    [r'восхо(?=дн)', OX, 'i'],
    [r'восхо(?=д[оѣꙋъы])', OX, 'i'],
    [r'\Bвосхо(?=дств)', OX, 'i'],

    [r'восходѧ\b', VA, 'i'],
    [r'восходѧ\B(?!тъ)', OX, 'i'],
    [r'восхо(?=дѧтъ)', OX, 'i'],

    [r'восхожд[ае]\B', OX, 'i'],

    # вра́гъ вра́жїй вражд-
    [r'''
        \b
        вра
        (?=
            гъ
            |ж(?!д) # ! вражда
        )
        ''', OX, 'i'],
    [r'\bвра[гз][аеѣиꙋ]\b', VA, 'i'],
    [r'\bвразе(?=х)', OX, 'i'],
    [r'\bврага(?=[мх])', OX, 'i'],
    [r'\bвраго(?=[вм])', OX, 'i'],
    [r'\bвражд[аеꙋы]\b', VA, 'i'],
    [r'\bвражд[еоꙋ]\B', OX, 'i'],

    [r'\bврата\b', VA, 'i'],
    [r'\bвраты\b', VA, 'i'],
    [r'\bврата(?=[мх])', OX, 'i'],
    [r'\bвратѣ(?=х)', OX, 'i'],
    [r'\bвра(?=тъ)', OX, 'i'],

    [r'вра(?=чь)', OX, 'i'],
    [r'врачб?[аиѣыꙋ]\b', VA, 'i'],
    [r'врачꙋ\B', OX, 'i'],
    [r'\bвра(?=чев[еєи]\b)', OX, 'i'],
    [r'врачева\b', VA, 'i'],
    [r'врачева\B', OX, 'i'],
    [r'враче(?=б)', OX, 'i'],

    [r'вре(?=м(?!ен[аъы]))', OX, 'i'],
    [r'времена\b', VA, 'i'],

    [r'всегда\b', VA, 'i'],
    [r'всего\b', VA, 'i'],

    [r'всѣ(?=м[иъ]|хъ)', OX, 'i'],
    [r'вс[еѣ](?=[йю]\b)', OX, 'i'],
    [r'\bвселе(?=н(с[кт]|н))', OX, 'i'],

    [r'\bвсели\B', OX, 'i'],
    [r'\bвсели\b', VA, 'i'],

    [r'\b(все|над)мі(?=рн)', OX, 'i'],

    [r'всемꙋ\b', VA, 'i'],
    [r'всеѧ\b', VA, 'i'],
    [r'\bвс[еию]\b', VA, 'i'],
    [r'\bвско(?=рѣ)', OX, 'i'],
    [r'\bвскꙋ(?=ю\b)', OX, 'i'],
    [r'\bвсѧ\b',          GKA, 'i'],
    [r'\bвсѧ(?=[кцч])', OX, 'i'],

    [r'вта(?=йне)', OX, 'i'],
    [r'вторы(?![йм]н)', OX, 'i'],

    [r'вы(?=нꙋ\b)', OX, 'i'],
    [r'\bвы\b', VA, 'i'],

    [r'вы(?=шн)', OX, 'i'],
    [r'вы(?=[сш]ш)', OX, 'i'],

    [r'высо(?=к[иіъ])', OX, 'i'],
    [r'высо(?=к[аꙋ]\B)', OX, 'i'],
    [r'высо(?=ко([ейю]|м[ꙋъ]))', OX, 'i'],

    [r'высот[аеѣоꙋы]\b', VA, 'i'],  # ы ???
    [r'высо(?=тъ\b)', OX, 'i'],
    [r'высото(?=ю\b)', OX, 'i'],
    [r'высоча', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ггг ggg

    [r'\bгавріи(?=л)', OX, 'i'],
    # гдѣ̀
    [r'\bгдѣ\b', VA, 'i'],
    [r'ге(?=рман(?![іс]))', OX, 'i'],
    # геѳсїма́нїа
    [r'геѳсіма(?!нійс)', OX, 'i'],
    # геѳсїмані́йстѣй
    [r'геѳсімані(?=йс)', OX, 'i'],

    [r'\bглав[аеѣоꙋ]\b', VA, 'i'],
    [r'\bглаво(?=ю\b)', OX, 'i'],
    [r'\bглави(?=зн)', OX, 'i'],

    # Глаго́лъ
    [r'глаг[оѡ](?=л)', OX, 'i'],
    [r'\bгла(?=д)', OX, 'i'],
    # гла́съ
    [r'\b(со|без|єдино)?гла(?=с[аноеꙋыъ])', OX, 'i'],
    # ѻ҆гласѝ
    [r'(воз|[ѻѡ])гласи\b', VA, 'i'],
    [r'гласи\B', OX, 'i'],
    # глаша́ти ѻ҆глаше́нный
    [r'глаш[ае]', OX, 'i'],

    [r'\bглꙋбин[аеоꙋѣы]\b', VA, 'i'],
    [r'\bглꙋбино(?=ю)', OX, 'i'],
    [r'\bглꙋбоча(?=йш)', OX, 'i'],

    [r'гнѣ(?=в(?!л))', OX, 'i'],
    [r'гнѣвли(?=в)', OX, 'i'],

    # годи́на
    [r'\bгоди(?=н[аеѣоꙋы])', OX, 'i'],
    [r'\bголго(?=ѳ)', OX, 'i'],

    [r'\bго(?=лꙋб([еѣиьѧ]|іе)\b)', OX, 'i'],
    [r'\bголꙋби(?=[нц])', OX, 'i'],

    [r'\bголꙋб[аеꙋы]\B', OX, 'i'],
    [r'\bголꙋбо(?=[ею]\b)', OX, 'i'],

    [r'\bгоне(?=ні)', OX, 'i'],
    [r'гони\b', VA, 'i'],
    [r'гони\B', OX, 'i'],
    [r'\bгора(?=хъ)', OX, 'i'],
    [r'горѣ(?=т)', OX, 'i'],
    [r'\bгорѣ\b', VA, 'i'],
    # го́ре
    [r'\bго(?=ре\b)', OX, 'i'],

    [r'\bго(?=рд[аиоѡꙋ])', OX, 'i'],
    [r'\bго(?=рд[еъы]\b)', OX, 'i'],
    [r'\bгорде(?=ли)', OX, 'i'],
    [r'разгорд[еѣ](?=[всхш])', OX, 'i'],
    [r'горди(?=[встхш])', OX, 'i'],
    [r'го(?=рды[ймхѧ])', OX, 'i'],
    [r'горды(?=н)', OX, 'i'],
    [r'гордѧ(?=[сщ])', OX, 'i'],


    [r'\bго(?=рьк(?!а\b))', OX, 'i'],
    [r'\bгорѧ(?=щ)', OX, 'i'],

    # Го́споди
    [r'го(?=спод([аеиꙋ]|омъ)\b)', OX, 'i'],
    # Госпо́дне
    [r'госпо(?=д([нь]|ств))', OX, 'i'],
    # Госпожа̀
    [r'госпож[аеиѣꙋ]\b', VA, 'i'],

    [r'\bгра(?=д[аеиѣꙋъ]\b)', OX, 'i'],

    # ==============================
    # грѣ́хъ грѣ́шникъ грѣ́шенъ грѣшны̀ согрѣшѝ прегрѣше́нїѧ грѣсѝ грѣсѣ́хъ

    # грѣх (ѣ - ударн.)
    [r'''
        \b
        грѣ
        (?=
            хъ
            |шенъ
            |шн(?!(\w\b|ѣ)) # ! грѣшны
        )
        ''', OX, 'i'],

    [r'(со)?грѣш([иꙋ]|н[аоѡы])\b', VA, 'i'],
    [r'грѣси\b', VA, 'i'],
    [r'грѣх[аеѣиꙋ]\b', VA, 'i'],
    [r'грѣхми\b', VA, 'i'],
    [r'грѣха(?=[мх])', OX, 'i'],

    [r'грѣх[оѡ](?!лю|па)', OX, 'i'],
    [r'грѣхолюби', OX, 'i'],
    [r'грѣхолю(?=бн)', OX, 'i'],
    [r'грѣхопад[еє]', OX, 'i'],
    [r'грѣсѣ(?=хъ\b)', OX, 'i'],
    # прегрѣше́нїѧ
    [r'''
        грѣш
        (
            [аи]
            |е(?!нъ) # ! грѣ́шенъ
        )\B
        ''', OX, 'i'],

    # -------------------------------

    [r'грѧд[еиꙋыѧ]\B', OX, 'i'],
    [r'грѧд[иꙋ]\b', VA, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ддд ddd

    [r'да(?=бы|же)', OX, 'i'],
    [r'даде\b', VA, 'i'],
    [r'даде\B', OX, 'i'],
    [r'дади(?=мъ|те)', OX, 'i'],
    [r'да(?=ждь)', OX, 'i'],
    [r'\bда(?=й|лъ)', OX, 'i'],
    [r'\bда(?=лсѧ)', OX, 'i'],
    [r'да(?=си\b)', OX, 'i'],

    [r'\bда(?=р([аеѣꙋъ]\b|ꙋ\B))', OX, 'i'],
    [r'\bдары\b', VA, 'i'],
    [r'\bдарова\B', OX, 'i'],
    [r'\bдарова\b', VA, 'i'],
    [r'\bдва(?=жд)', OX, 'i'],
    [r'\bдве(?=ри)', OX, 'i'],

    # дѣ́ва
    [r'''
        \b(присно)?
        дѣ
        (?=в(?!омати))
        ''', OX, 'i'],

    [r'\bдѣ(?=л[оѣꙋъы]\b)', OX, 'i'],
    [r'''
        \b
        (
            бого(со)?|благо|(не)?воз(со)?|добро
            |древо|земле|ѕло|не|ново(со)?|перво|плїнѳо
            |садо|само|свѧто|свѧщенно|со|чꙋдо|шаро
        )
        дѣ(?=л[аь])
        ''', OX, 'i'],
    [r'\bдѣ(?=ла\B)', OX, 'i'],

    [r'\bдѣ(?=л[еѣ]хъ\b)', OX, 'i'],
    [r'\bдѣ(?=ломъ\b)', OX, 'i'],
    [r'\bдѣ(?=ль\B)', OX, 'i'],

    [r'\bде(?=нь)', OX, 'i'],
    [r'дне(?=сь)', OX, 'i'],
    [r'\bдні(?=й)', OX, 'i'],
    [r'\bднѣ\b', VA, 'i'],
    [r'\bдни\b', VA, 'i'],

    # дѣ́ло
    [r'\bдѣ(?=л[оꙋъ]\b)', OX, 'i'],

    [r'держа\b', VA, 'i'],
    [r'держа\B', OX, 'i'],

    [r'дерзнове', OX, 'i'],

    [r'\bде(?=сн[оѡ]\b)', OX, 'i'],
    [r'\bдесн[аѣиоꙋы]\B', OX, 'i'],

    [r'\bдѣ(?!то[вр]од|т[еєѣ]й)(?=т)', OX, 'i'],
    [r'\bдѣте(?=й)', OX, 'i'],
    [r'\bдѣто[вр]од[иѧ]', OX, 'i'],
    [r'издѣ(?=тска)', OX, 'i'],

    # дѣ́ѧша
    [r'\bдѣ(?=ѧ[твхш])', OX, 'i'],
    # дѣѧ́нїѧ
    [r'\bдѣѧ(?=н)', OX, 'i'],
    # дѣ́юще
    [r'\bдѣ(?=ю)', OX, 'i'],

    [r'\bдіа(?=вол)', OX, 'i'],

    [r'\bдивѣ(?=е)', OX, 'i'],
    # дивный
    [r'(пре|неиж|много(иж)?|досто|все)?ди(?=вн)', OX, 'i'],
    [r'\bди(?=венъ\b)', OX, 'i'],

    [r'\bдими(?=трі(?!ан))', OX, 'i'],
    [r'\bдимитріа(?=н)', OX, 'i'],

    [r'\bдіѻнѵ(?=сі)', OX, 'i'],
    [r'\bдіѻско(?=р)', OX, 'i'],

    # длѧ
    [r'\bдлѧ\b', VA, 'i'],

    [r'до(?=блі)', OX, 'i'],

    [r'добро\b', VA, 'i'],
    [r'до(?=бр(ы[ймх]|ꙋю|о[емюй]))', OX, 'i'],
    [r'добродѣ(?=тел)', OX, 'i'],

    [r'догма(?=т)', OX, 'i'],

    # доколе
    [r'доко(?=лѣ)', OX, 'i'],
    [r'долготꙋ\b', VA, 'i'],
    # до́мъ до́мы
    [r'\bдо(?=м[еѣиꙋъы]\b)', OX, 'i'],
    # дондеже
    [r'до(?=ндеже)', OX, 'i'],
    [r'досе(?=лѣ)', OX, 'i'],
    # досто́йно ! достойнопѣ́тый
    [r'досто(?=йн(?!о(б|пѣ|сло)))', OX, 'i'],
    [r'достоѧ(?=н)', OX, 'i'],
    [r'доше(?=д)', OX, 'i'],

    [r'дре(?=вле)', OX, 'i'],
    [r'дре(?=вн)', OX, 'i'],
    [r'дре(?=ва\b)', OX, 'i'],  # @@@ чаще дре́ва
    [r'дре(?=в([ꙋеѣъ]|о(мъ)?)\b)', OX, 'i'],

    [r'дрꙋ(?=г([аиеѣꙋъ]|омъ)\b)', OX, 'i'],
    [r'дрꙋ(?=ж(е|ба)\b)', OX, 'i'],
    [r'дрꙋ(?=зи\b)', OX, 'i'],

    # дꙋ́сѣ - предл.п. дꙋ́ше - зват.п
    [r'\bдꙋ(?=сѣ\b)', OX, 'i'],
    [r'\bдꙋ(?=си\b)', OX, 'i'],
    [r'\bдꙋ(?=х[аеѣꙋъ]\b)', OX, 'i'],
    [r'\bдꙋ(?=хомъ\b)', OX, 'i'],
    [r'\bдꙋ(?=хов[еѣи]\b)', OX, 'i'],
    [r'\bдꙋхо(?=вн(?!и[кч]))', OX, 'i'],
    [r'\bдꙋховни(?=к(?!а))', OX, 'i'],
    [r'\bдꙋховника\B', OX, 'i'],
    [r'\bдꙋховника\b', VA, 'i'],
    [r'\bдꙋхоно(?=сиц)', OX, 'i'],
    # дꙋша̀
    #
    #   дꙋша̀: дꙋшѣ̀ - предл. дꙋшѐ - зват.
    #   дꙋ́хъ: дꙋ́сѣ - предл. дꙋ́ше - зват.
    #
    [r'дꙋш[аѣ]\b', VA, 'i'],
    # дꙋше́внꙋю
    [r'дꙋше(?=вн|ю)', OX, 'i'],
    # дꙋ́шꙋ
    [r'дꙋ(?=ш[ꙋъ]\b)', OX, 'i'],
    [r'дꙋша(?=мъ\b)', OX, 'i'],

    [r'дще(?=р)', OX, 'i'],
    [r'дщи\b', VA, 'i'],

    [r'дыха(?=н)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # еее eee

    # не меняет Iso на Apostrof
    # е ю я
    [r'\b[єюꙗ]\b', GAP, 'i'],

    [r'єѵа(?=нгел)', OX, 'i'],
    [r'єгѵ(?=пет)', OX, 'i'],

    [r'євфра(?=фовъ)', OX, 'i'],
    [r'єѵхарі(?=сті)', OX, 'i'],
    [r'єѵхарісти(?=ч)', OX, 'i'],
    # є҆гда̀ є҆да̀
    [r'єг?да\b', VA, 'i'],
    # є҆гѡ̀ є҆го̀
    [r'єг[оѡ]\b', VA, 'i'],
    # є҆го́же
    [r'єго(?=же\b)', OX, 'i'],
    # є҆ди́на є҆ди́наго є҆ди́ны ! є҆динагона́десѧте
    [r'єди(?=н[аеєѣꙋыъ](?!г[оѡ]н|к[оѡ]|че|ні|й?же?над))', OX, 'i'],
    [r'єди(?=но([ейю]|м[ꙋъ]|ж(ды|е))?\b)', OX, 'i'],
    [r'єди(?=нств)', OX, 'i'],
    # є҆́же є҆́й є҆́сть є҆́смь є҆́юже
    [r'\bє(?=же|й|с[тм]ь|юже\b)', IS, 'i'],
    # є҆ктенїѝ
    [r'єктені\w\b', VA, 'i'],
    [r'єле(?=а\b|е(?!п)|ом|[ийѧю])', OX, 'i'],
    # є҆ли́ко є҆ли́цы є҆ли́жды
    [r'єли(?=жды|к[ао]|цы)', OX, 'i'],
    [r'єлисаве(?=т)', OX, 'i'],
    # є҆мꙋ̀ є҆сѝ є҆щѐ є҆стѐ
    [r'\bємꙋ\b', VA, 'i'],
    [r'\bємꙋ(?=же)', OX, 'i'],
    [r'\bєпі(?=скоп)', OX, 'i'],
    [r'\bєс(и|те)\b', VA, 'i'],
    [r'\bєсмы\b', VA, 'i'],
    [r'\bєстеств[аеѣоꙋ]\b', VA, 'i'],
    [r'\bєще\b', VA, 'i'],
    [r'\bєѧ\b', VA, 'i'],
    [r'\bєѧ(?=же)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # жжж

    # [r'жа(?=жда\b)', OX, 'i'],
    # жа́жды жа́ждꙋщїй
    [r'жа(?=жд[еꙋиоы])', OX, 'i'],
    [r'жалѣ(?=[велнстюѧ])', OX, 'i'],

    # жела́нїе
    [r'жел[аѣ]\B', OX, 'i'],
    [r'жел[аѣ]\b', VA, 'i'],

    # желѣ́зо
    [r'желѣ(?=з)', OX, 'i'],
    # же́но
    [r'\bже(?=но\b)', OX, 'i'],
    [r'\bжена(?=х)', OX, 'i'],
    [r'\bже(?=нъ)', OX, 'i'],
    # жена̀ женѐ
    [r'\bжен[аеѣꙋы]\b', VA, 'i'],
    # же́ртва
    [r'же(?=ртв(?!оположн))', OX, 'i'],

    [r'(?<!л)жива(?=го)', OX, 'i'],
    [r'(?<!л)жива(?=ѧ)', OX, 'i'],
    # жива̀
    # [r'жив[аꙋ]\b', VA, 'i'],

    # ѡ҆живи́вый поживѝ живи́ли !живи
    [r'\bжив[іи]\B', OX, 'i'],
    [r'\B(?<!ⷧ\bприсно)жив[іи]\b', VA, 'i'],
    [r'\B(?<!ⷧ\bл)жив[іи]\b', VA, 'i'],

    [r'живо(?=[ей])', OX, 'i'],

    [r'живоно(?=с)', OX, 'i'],
    [r'живо(?=тъ\b)', OX, 'i'],
    [r'живот[аеѣыꙋ]\b', VA, 'i'],
    [r'живото(?=мъ\b)', OX, 'i'],
    [r'животворѧ\b', VA, 'i'],
    [r'животворѧ\B', OX, 'i'],
    [r'живото(?=ч)', OX, 'i'],
    [r'живо(?=тн)', OX, 'i'],

    # живꙋ̀ живꙋ́тъ поживꙋ́тъ
    [r'\Bживꙋ\B', OX, 'i'],
    [r'\bживꙋ\B', OX, 'i'],
    [r'\Bживꙋ\b', VA, 'i'],
    # живꙋ́щїй
    # [r'живꙋ(?=щ\w+)', OX, 'i'],

    # живы́ѧ ! прибли́живыйсѧ
    [r'(присно)?живы(?=([мх]\w|ѧ)\b)', OX, 'i'],
    # жи́вы
    [r'\bжи(?=вы\b)', OX, 'i'],
    # положи́вый послꙋжи́вый
    [r'\Bжи(?=вый\b)', OX, 'i'],

    [r'присноживо(?=т)', OX, 'i'],
    # жи́знь жи́зненный
    [r'жи(?=зн([иь]|енн))', OX, 'i'],
    [r'жи(?=зне\b)', OX, 'i'],
    [r'\bжи(?=тел)', OX, 'i'],
    [r'жите(?=йс)', OX, 'i'],
    [r'житі[еиюѧ]\b', VA, 'i'],
    [r'житіе(?=мъ)', OX, 'i'],
    [r'\bжи(?=ти\b)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ззз zzz

    [r'\bзаблꙋ(?=ж?дш)', OX, 'i'],
    [r'\bзабꙋ(?=д)', OX, 'i'],
    [r'\bзабыва\B', OX, 'i'],
    # завѣ́са
    [r'\bзавѣ(?=с)', OX, 'i'],
    [r'заколе(?=н)', OX, 'i'],

    [r'зако(?=номъ)', OX, 'i'],
    [r'зак[оѡ](?=н[аинꙋы])', OX, 'i'],

    [r'\bзане\b', VA, 'i'],

    [r'за(?=пад)', OX, 'i'],

    # за́повѣдь (??? заповѣ́дети)
    [r'за(?=повѣд[еиь](?!ти))', OX, 'i'],
    # заповѣ́далъ (! за́повѣдь за́повѣдехъ)
    [r'заповѣ(?=д)(?!д([иь]|е[ймх]))', OX, 'i'],

    # зарѧ̀ зарѧ́ми зарю̀ ! лазарѧ
    [r'\bзар[еѣиюѧ]\b', VA, 'i'],
    [r'(?<!ла|на)зарѧ\B', OX, 'i'],
    [r'заре\B', OX, 'i'],
    [r'(?<!ла)заре\B', OX, 'i'],

    [r'застꙋпа\B', OX, 'i'],
    [r'застꙋпи\b', VA, 'i'],
    [r'застꙋпи(?=вш|лъ|ти)', OX, 'i'],
    [r'застꙋпл[еє]\B', OX, 'i'],
    [r'застꙋ(?=пн)', OX, 'i'],
    [r'застꙋ(?=пи(т[ѣъ]|ши))', OX, 'i'],

    [r'затво(?=ра\b)', OX, 'i'],
    [r'затвор[июѧ]\b', VA, 'i'],
    [r'затвор[еєѣиншъыѧ]\B', OX, 'i'],

    [r'защити\b', VA, 'i'],
    [r'защища\B', OX, 'i'],

    # зва́ти
    [r'\b((со?)?при|воз|на|со)?зва(?=[внстхш]|л(?!а))', OX, 'i'],
    # воззва̀ воззвала̀
    [r'\b((со?)?при|воз|на|со)?зва(ла)?\b', VA, 'i'],

    # ѕвѣ́зды ѕвѣ́здный
    [r'ѕвѣ(?=зд(ы\b|н))', OX, 'i'],
    # ѕвѣзда̀
    [r'ѕвѣзд[аеѣоꙋ]\b', VA, 'i'],
    # ѕвѣздо́ю
    [r'ѕвѣзд[ао]\B', OX, 'i'],

    # [r'ѕвѣ(?=р[иеѣ]|рь(?!ми))', OX, 'i'],
    [r'ѕвѣ(?=р[июѧѣ]\b|рь(?!ми)|ре(?!й))', OX, 'i'],
    [r'ѕвѣре(?=й)', OX, 'i'],
    [r'ѕвѣрѧ(?=ми)', OX, 'i'],
    [r'ѕвѣрьми\b', VA, 'i'],

    [r'\bздѣ\b', VA, 'i'],
    [r'\bздѣ(?=сь\b)', OX, 'i'],

    [r'\bздра(?=в(?!л|отв))', OX, 'i'],

    [r'ѕѣлѡ\b', VA, 'i'],
    [r'ѕѣ(?=льн)', OX, 'i'],

    [r'земл[еѣиѧ]\b', VA, 'i'],
    [r'зе(?=млю\b)', OX, 'i'],
    [r'земле(?=ю\b)', OX, 'i'],
    [r'земна\B', OX, 'i'],
    [r'земны\B', OX, 'i'],

    [r'зѣ(?=ниц)', OX, 'i'],

    [r'\bзижди\B', OX, 'i'],

    [r'\bзла(?=т[ао](мъ)?\b)', OX, 'i'],
    [r'\bзлата(?=ѧ\b)', OX, 'i'],
    [r'\bзлато(?=([ейю]|мꙋ)\b)', OX, 'i'],
    [r'\bзлатогла(?=в)', OX, 'i'],
    [r'\bзлатоза(?=рн)', OX, 'i'],

    [r'ѕл[аеіѣоꙋы]\b', VA, 'i'],
    # ѕло
    [r'''
        ѕл(
            [аеѣіы]
            |о(?=
                м
                |б(?!лені)
                |ст(н|ь\b)))
        \B
        ''', OX, 'i'],
    # ѻ҆ѕлобле́нїе
    [r'ѕлобле(?=н[іь])', OX, 'i'],

    [r'\bѕмі(?=[йѧ]\b)', OX, 'i'],

    [r'\b(не)?зна(?=[еєйкнтхшюѧ])', OX, 'i'],
    [r'\bпозна\b', VA, 'i'],
    [r'\bпознаѧ\b', VA, 'i'],
    [r'\bпознава', OX, 'i'],
    [r'\bпозна(?=в[сшъы])', OX, 'i'],
    [r'\bпозна(?=[йлнстхш])', OX, 'i'],
    [r'\bпознаю(?=щ)', OX, 'i'],

    [r'\bзна(?=мена\b)', OX, 'i'],
    [r'\bзна(?=мѧ\b)', OX, 'i'],
    [r'\bзна(?=м[еє]на[вейс])', OX, 'i'],
    [r'\bзна(?=м[еє]нан(о|н?ымъ))', OX, 'i'],
    [r'\bзна(?=м[еє]нающ)', OX, 'i'],
    [r'\bзнам[еє]на(?=ні|л)', OX, 'i'],

    [r'зна(?=мені)', OX, 'i'],

    [r'зове(?=[мтш])', OX, 'i'],
    [r'зовꙋ(?=[тщ])', OX, 'i'],
    [r'зовꙋ\b', VA, 'i'],

    [r'ѕо(?=лъ)', OX, 'i'],

    [r'\bзра(?=к|ц)', OX, 'i'],

    # зрѣ́ти ᲂу҆зрѣ́ти
    [r'\b(^[Оᲂ]у(мо)?|пр[иео]|воз|лице|пред)?зрѣ(?=[лнтхш])', OX, 'i'],
    # зрю̀  призрѣ̀
    [r'\b(пр[иео])?зр[еѣюѧ]\b', VA, 'i'],
    [r'\bпрозрѣ\b', VA, 'i'],
    [r'зрѧ(?=[шщ])', OX, 'i'],
    [r'\bзри\b', VA, 'i'],
    [r'\bзри\B', OX, 'i'],
    [r'(?<!на|р[еио]|[Оᲂ]у)зри\B(?!но)', OX, 'i'],
    [r'(?<!р[еи])зри\b', VA, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # иии iii

    [r'іа(?=кѡв)', OX, 'i'],
    [r'ѵакі(?=нѳ)', OX, 'i'],
    [r'\bи(?=бо\b)', IS, 'i'],
    [r'\bи(?=г[ао]\b)', IS, 'i'],
    [r'игꙋ(?=мен)', OX, 'i'],
    [r'\bидѣ(?=же\b)', OX, 'i'],
    [r'идо(?=[схш])', OX, 'i'],
    [r'іезекі(?=ил)', OX, 'i'],
    # іерей
    [r'іере(?!м)', OX, 'i'],
    [r'іеремі', OX, 'i'],
    [r'іерꙋсали(?=м)', OX, 'i'],

    [r'изба(?=в(и|ль))', OX, 'i'],
    [r'избавле(?=ні)', OX, 'i'],
    [r'избавлѧ\B', OX, 'i'],
    [r'избѣжа(?=в)', OX, 'i'],

    [r'избра\b', VA, 'i'],
    [r'избра\B', OX, 'i'],

    [r'излива\B', OX, 'i'],
    [r'излі[юѧ]\b', VA, 'i'],
    [r'излі[еюѧ]\B', OX, 'i'],

    [r'изѡбраже(?=н)', OX, 'i'],

    [r'ізра(?=ил)', OX, 'i'],
    [r'изрѧ(?=дн)', OX, 'i'],
    [r'изы(?=де([мт]ъ|ши)?)', OX, 'i'],
    [r'изы(?=дꙋ)', OX, 'i'],
    [r'изыдо', OX, 'i'],

    [r'іисꙋ(?=с)', OX, 'i'],

    # і҆́косъ
    [r'\bі(?=кос)', IS, 'i'],
    [r'\bікѡ(?=н)', OX, 'i'],
    [r'\bили\b', VA, 'i'],
    [r'\bи(?=ма)', IS, 'i'],
    [r'\bи(?=мам[ыъ])', IS, 'i'],

    [r'\bимѣ\b', VA, 'i'],
    [r'\bимѣ\B', OX, 'i'],

    [r'\bи(?=мен[еи])', IS, 'i'],
    [r'имена\b', VA, 'i'],

    [r'\bи(?=ми?же\b)', IS, 'i'],
    # !!! убрано для различия форм мн.ч. с апострофом
    # [r'\bи(?=хже\b)', IS, 'i'],

    [r'\bимꙋ\b', VA, 'i'],
    [r'\b(не|пре)?имꙋ(?=щ)', OX, 'i'],
    [r'\bи(?=мꙋтъ)', IS, 'i'],

    # !!! убрано для различия форм мн.ч. с апострофом
    # [r'\bи(?=[мх]ъ\b)', IS, 'i'],

    [r'\bи(?=мѧ\b)', IS, 'i'],
    [r'\bи(?=мѧрекъ)', IS, 'i'],

    [r'\bина(?=г[оѡ]\b)', OX, 'i'],

    [r'иногда\b', VA, 'i'],
    [r'\bи(?=но[кч])', IS, 'i'],
    [r'\bи(?=н[аоꙋыъ]\b)', IS, 'i'],
    [r'\bины(?=[ѧмх])', OX, 'i'],

    [r'іѻрда(?=н)', OX, 'i'],
    # і҆ѡа́ннъ
    [r'іѡа(?=нн(?![іи]к))', OX, 'i'],
    # і҆ѡанни́кїй
    [r'іѡанн?[іи](?=к)', OX, 'i'],
    # і҆́ѡвъ
    [r'\bі(?=ѡв)', IS, 'i'],
    [r'іѡ(?=сиф)', OX, 'i'],

    [r'ѵпакои\b', VA, 'i'],
    [r'ѵпоста(?=с)', OX, 'i'],

    [r'ірмо(?=с)', OX, 'i'],

    [r'\bи(?=род(?!і))', IS, 'i'],

    [r'искꙋш[еє](?=н)', OX, 'i'],
    [r'искꙋша', OX, 'i'],
    [r'искꙋси(?=[влх]|тел)', OX, 'i'],
    [r'искꙋси\b', VA, 'i'],

    [r'испещре(?=н)', OX, 'i'],

    [r'испо(?=лнь\b)', OX, 'i'],
    [r'испо(?=лни(?!тел))', OX, 'i'],
    [r'испо(?=лненн)', OX, 'i'],
    [r'испо(?=лнѧт(ъ|сѧ))', OX, 'i'],
    [r'исполнѧ(?!т(ъ|сѧ))', OX, 'i'],
    [r'исполне(?=ні)', OX, 'i'],

    [r'\bи(?=сповѣд(ь|и\b))', IS, 'i'],
    [r'испра(?=ви(?!тел))', OX, 'i'],
    [r'испроси\b', VA, 'i'],

    # и҆спытꙋ́ѧй и҆спыта́нїе и҆спы́танный и҆спыта́въ
    [r'испыта\b', VA, 'i'],
    [r'испы(?=тан[нъ])', OX, 'i'],
    [r'испыта(?=ні\B)', OX, 'i'],
    [r'испыта(?=[вейлтхшюѧ]\B)', OX, 'i'],
    [r'испытꙋ\B', OX, 'i'],
    [r'испы(?=ты\B)', OX, 'i'],

    [r'ѵссѡ(?=п)', OX, 'i'],

    [r'\bистаѧва\B', OX, 'i'],

    [r'\bи(?=стин)', IS, 'i'],
    [r'\bисточа\B', OX, 'i'],
    [r'\bисточи\b', VA, 'i'],
    [r'\bисточи\B', OX, 'i'],
    [r'\bисто(?=чни)', OX, 'i'],
    [r'\bистоща(?!ва)', OX, 'i'],
    [r'\bистощи\B', OX, 'i'],
    [r'\bистощи\b', VA, 'i'],

    [r'\bистреби\b', VA, 'i'],
    [r'\bистреби\B', OX, 'i'],
    [r'\bистребле(?=н[іиъ])', OX, 'i'],
    [r'\bистреблю\b', VA, 'i'],
    [r'\bистреблѧ\B', OX, 'i'],

    [r'исцѣле(?=н)', OX, 'i'],
    [r'исцѣлѧ\B', OX, 'i'],
    [r'неисцѣ(?=льн)', OX, 'i'],
    [r'исцѣл[еѣи]\b', VA, 'i'],
    [r'исцѣли\B', OX, 'i'],

    [r'\bищ[аꙋиѧ]\b', VA, 'i'],
    [r'\bищ[аиѧ]\B', OX, 'i'],
    [r'\bи(?=щꙋщ)', IS, 'i'],
    [r'\bи(?=ще[мтш])', IS, 'i'],

    [r'іꙋ(?=д(\w\b|о))', OX, 'i'],
    [r'іꙋде(?=\w)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ккк kkk

    [r'кади(?=[лт])', OX, 'i'],

    [r'\bка(?=жд[аоꙋы])', OX, 'i'],

    # ка́мень ка́мени
    [r'\bка(?=ме?н[еѣиюьѧ]([мх][иъ])?\b)', OX, 'i'],
    [r'\bка(?=менн[аоꙋы])', OX, 'i'],
    [r'\bка(?=мѡ)', OX, 'i'],
    [r'\bканѡ(?=н)', OX, 'i'],

    [r'\bка(?=[йюѧ])', OX, 'i'],

    # каса́тисѧ
    [r'каса', OX, 'i'],

    [r'\b(ни)?ка(?=ѧ)', OX, 'i'],
    [r'ка(?=кѡ)', OX, 'i'],
    [r'(ни)?ка(?=коже)', OX, 'i'],
    [r'\bкі(?=ими|й)', OX, 'i'],

    [r'\bківѡ(?=т)', OX, 'i'],
    [r'\bкѵрі(?=лл)', OX, 'i'],
    [r'\b(ни)?когда\b', VA, 'i'],
    [r'\bко(?=е\b)', OX, 'i'],
    [r'\bкоего(?=жд)', OX, 'i'],
    [r'коли(?=ко)', OX, 'i'],
    [r'колѣ(?=н[ао](?!прекл))', OX, 'i'],
    [r'колѣнопреклоне(?=н)', OX, 'i'],

    [r'конда(?=къ)', OX, 'i'],

    # коне́цъ конца̀ конца́мъ
    [r'кон[еє](?=цъ\b)', OX, 'i'],
    [r'конц[аѣꙋы]\b', VA, 'i'],
    [r'конц[аѣ]\B', OX, 'i'],

    # прикоснове́нїемъ косни́сѧ закоснѝ коснѧ́щꙋ
    # одинаковые regex для косный коснути
    [r'косн[иѧ]\B', OX, 'i'],
    [r'косни\b', VA, 'i'],
    [r'ко(?=сны\B)', OX, 'i'],

    [r'прико(?=снꙋтсѧ)', OX, 'i'],
    [r'коснꙋ(?!тсѧ)', OX, 'i'],

    [r'\bкото(?=р)', OX, 'i'],

    # прекра́снаѧ
    [r'прекра(?=с)', OX, 'i'],
    [r'\bкра(?=й)', OX, 'i'],
    # кра́снаѧ
    [r'\bкра(?=сн[аоіꙋы]\B)', OX, 'i'],
    # красны̀ красна̀
    [r'\bкрасн[аы]\b', VA, 'i'],
    # красе́нъ
    [r'\bкрасе(?=нъ\b)', OX, 'i'],

    [r'красот[аеѣоꙋы]\b', VA, 'i'],
    [r'красото(?=ю)', OX, 'i'],
    [r'красото\b', VA, 'i'],

    [r'крѣ(?=пк)', OX, 'i'],
    [r'крѣ(?=пост[іиеѣь])', OX, 'i'],

    [r'кре(?=стн)', OX, 'i'],
    [r'крест[аеиѣꙋыѧ]\b', VA, 'i'],
    [r'крести\B', OX, 'i'],
    [r'кресто(?=м)', OX, 'i'],
    [r'крестови(?=дн)', OX, 'i'],
    [r'крестоно(?=сн)', OX, 'i'],
    [r'крестоноше(?=н)', OX, 'i'],
    [r'крестоѡбра(?=з)', OX, 'i'],
    [r'крестопокло(?=н)', OX, 'i'],

    [r'крилѣ\b', VA, 'i'],
    [r'крилѣ\B', OX, 'i'],
    [r'крилꙋ\b', GKA, 'i'],  # чаще мн.ч.
    [r'кри(?=лъ\b)', OX, 'i'],
    [r'крилѧ', OX, 'i'],

    [r'\bкро(?=в(і|ь(?!ми)))', OX, 'i'],
    [r'кро(?=ве\b)', OX, 'i'],
    [r'\bкровьми\b', VA, 'i'],
    [r'\bкро(?=в(ом)?ъ)', OX, 'i'],

    [r'кро(?=т[коц])', OX, 'i'],
    [r'крꙋ(?=га)', OX, 'i'],

    [r'\b(ни)?кто\b', VA, 'i'],
    [r'\bктомꙋ\b', VA, 'i'],
    [r'кꙋпѣ(?=л)', OX, 'i'],
    [r'кꙋпин[аеоꙋы]\b', VA, 'i'],
    [r'кꙋпино\B', OX, 'i'],
    [r'кꙋ(?=пнѡ\b)', OX, 'i'],
    [r'\bкꙋ(?=ю)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ллл lll

    # бл҃голѣ́пїе ! прилѣплѧтисѧ слѣпой
    [r'(?<![ис])лѣ(?=п)', OX, 'i'],

    [r'лѣ(?=стви)', OX, 'i'],
    [r'лѣ(?=то)', OX, 'i'],

    # ли́къ
    [r'\bли(?=к\w\b)', OX, 'i'],
    [r'\bли(?=цъ\b)', OX, 'i'],
    [r'\bликꙋ(?=[йеюѧ])', OX, 'i'],

    [r'літі[июѧ]', VA, 'i'],
    [r'літꙋргі', OX, 'i'],
    [r'\bлітꙋрги(?!к)', OX, 'i'],

    [r'\bлиц[еоꙋ]\b', VA, 'i'],
    [r'\bлиц[еєо](?=мъ\b)', OX, 'i'],

    [r'\bлꙋн[аеѣоꙋы]\b', VA, 'i'],
    [r'\bлꙋно(?=ю\b)', OX, 'i'],
    [r'лꙋ(?=нн)', OX, 'i'],

    # любвѐ любы̀
    [r'люб(в[ие]|ы)\b', VA, 'i'],
    # любо̀вь
    [r'люби(?=м[аѣиіꙋыь])', OX, 'i'],
    [r'люби(?=мо(?!град))', OX, 'i'],
    [r'лю(?=би[мтш]ъ)', OX, 'i'],
    [r'люби(?=ти)', OX, 'i'],
    [r'любо(?=в([їь]ю?))', OX, 'i'],
    [r'лю(?=биши)', OX, 'i'],
    [r'люби(?=ша)', OX, 'i'],
    [r'люби(?=сх)', OX, 'i'],
    [r'любѧ\b', VA, 'i'],
    [r'лю(?=бѧщ(?!ыѧ|их))', OX, 'i'],
    [r'любѧ(?=[йш])', OX, 'i'],
    [r'лю(?=бле(?!ні))', OX, 'i'],
    [r'лю(?=бль)', OX, 'i'],
    [r'любле(?=ні)', OX, 'i'],
    [r'люблю\b', VA, 'i'],
    [r'люблѧ\B', OX, 'i'],


    # лю́демъ лю́ди лю́дїе лю́дѧмъ лю́дъ лю́дстїи лю́дска
    [r'(?<!б)лю(?=д(и|іе)\b)', OX, 'i'],
    [r'лю(?=дѧмъ)', OX, 'i'],
    [r'лю(?=д[еєѣ][мх]ъ)', OX, 'i'],
    [r'лю(?=дъ\b)', OX, 'i'],
    [r'лю(?=дс(т(іи|ѣ))\b)', OX, 'i'],
    [r'лю(?=дска\b)', OX, 'i'],

    # люде́й людска́ѧ людскі́ѧ людьмѝ
    [r'люд[еі](?=й)', OX, 'i'],
    [r'людск[аиіо]\B', OX, 'i'],
    [r'людьми\b', VA, 'i'],

    [r'\b(все|ѕло)?лю(?=т(?!ѣ(йш|е)|а\b))', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ммм mmm

    [r'\bма(?=л[аѣꙋыъ]\B)', OX, 'i'],
    [r'\bма(?=л[ѣоѡыꙋ]\b)', OX, 'i'],
    [r'\bма(?=ло[ейю]\b)', OX, 'i'],
    [r'\bма(?=лост)', OX, 'i'],

    [r'\bмарі(?=[еиѧю])', OX, 'i'],
    [r'\bмаріа(?=м)', OX, 'i'],

    [r'''
        \b
        (бого|дѣво)?
        ма
        (?=
            т
            (
                и         # ма́ти
                |ер
                    (
                        [неісь] # богома́терїю
                        |и(?!нск) # богома́тери
                    ) 
            )
        )
        ''', OX, 'i'],

    # бг҃омт҃ери́нскїй
    [r'(бого)?матери(?=нс[кт])', OX, 'i'],

    [r'м[еє](?=ртва(го|ѧ))', OX, 'i'],
    [r'[Оᲂ]умертв[иѧ]\B', OX, 'i'],
    [r'м[еє](?=ртво[еймсю])', OX, 'i'],
    [r'ме(?=ртвꙋ)', OX, 'i'],
    [r'м[еє](?=ртвы)', OX, 'i'],  # (?=ртвы\B) ?
    [r'м[еє](?=ртв[еє]н)', OX, 'i'],
    [r'м[еє]ртве(?=ц(?!а))', OX, 'i'],
    [r'м[еє]ртв[еє]ц[аѣꙋы]\b', VA, 'i'],
    [r'м[еє]ртв[еє]ц[аоѣ]\B', OX, 'i'],
    [r'м[еє]ртв[еє]чи\B', OX, 'i'],

    # мѣ́сто
    [r'мѣ(?=ст(?!и(ти|[лмхш])))', OX, 'i'],
    [r'мѣсти\B', OX, 'i'],
    [r'мѣсти\b', VA, 'i'],
    [r'вмѣщ(?=щ[сш])', OX, 'i'],
    [r'вмѣщ[ае]', OX, 'i'],
    [r'мѣ(?=сѧц)', OX, 'i'],
    [r'милосе(?=рд)', OX, 'i'],
    [r'ми(?=лост(?!ивлен))', OX, 'i'],
    [r'ми(?=лꙋющ)', OX, 'i'],

    # мір
    [r'\B(?<!лади|любо)мі(?=р(?!ы))', OX, 'i'],
    [r'міры\b', VA, 'i'],
    [r'\bмі(?=р[аѣꙋъ]\b)', OX, 'i'],
    [r'\bмірск[аиіоꙋ]\B', OX, 'i'],
    [r'\bмірст[іѣ]\B', OX, 'i'],
    [r'\bмірѧ\B', OX, 'i'],
    # мир
    [r'\bми(?=р(а|н[аоѡыꙋ]|енъ|н\w\w|омъ)\b)', OX, 'i'],
    # мѵро
    [r'\bмѵ(?=р\w\b)', OX, 'i'],
    # мѷроно́сицы мѷрото́чный мѷроточи́вый мѷроположе́нїе мѷрополо́жнице
    [r'\b(мѵ)(ро(?!мъ)\B)', r'\1' + dbl_grave + r'\2', 'i'],
    [r'''
        \bмѵро(
        но
        |точи
        |то(?=чн)
        |положе
        |поло(?=жн)
        |дохнове(?=н)
        |ꙋха(?=н)
        |во(?=нн)
        )
        ''', OX, 'i'],

    [r'\bміхаи(?=л)', OX, 'i'],

    [r'младе(?=не?[цч])', OX, 'i'],
    [r'\b(со)?мнѣ', OX, 'i'],
    [r'\bмнѣ\b', VA, 'i'],
    [r'\bмене\b', VA, 'i'],
    [r'\bменѧ\b', VA, 'i'],
    # мно́гимъ мно́гомꙋ мно́го мно́гими
    [r'\bмно(?=г(о(м[ъꙋ])?|и[хм][иъ]|і[иеѧ])\b)', OX, 'i'],
    [r'\bмно(?=гаѧ)', OX, 'i'],
    [r'\bмно(?=г[иа]\b)', OX, 'i'],
    [r'мно(?=жеств)', OX, 'i'],
    [r'\bмно(?=ю\b)', OX, 'i'],
    [r'\bмно(?=зи\b)', OX, 'i'],
    # [r'мно(?=жайш)', OX, 'i'],

    [r'(воз|изне)мог[ао]\B', OX, 'i'],
    [r'(воз|изне)могꙋ\b', VA, 'i'],
    [r'(воз|изне)мо(?=гш)', OX, 'i'],
    [r'(воз|изне)мо(?=же\b)', OX, 'i'],

    # моѐ мою̀ моѧ̀ моѝ
    [r'\bмо[еиюѧ]\b', VA, 'i'],
    [r'\bмоего\b', VA, 'i'],
    [r'\bмоегѡ\b', VA, 'i'],
    [r'\bмоемꙋ\b', VA, 'i'],
    # мое́й
    [r'\bмое(?=[йю]\b)', OX, 'i'],
    [r'\bмое(?=мъ\b)', OX, 'i'],
    [r'\bмоеѧ\b', VA, 'i'],

    # см. помога-
    [r'могꙋ\b', VA, 'i'],
    [r'могꙋ\b', VA, 'i'],
    [r'мо(?=гꙋтъ)', OX, 'i'],
    [r'могꙋ(?=щ)', OX, 'i'],
    [r'(?<!а)мо(?=же(?!ні))', OX, 'i'],

    # мои́хъ мои́мъ
    [r'\bмои(?=[мх]ъ\b)', OX, 'i'],
    [r'\bмо(?=й\b)', OX, 'i'],
    [r'\bмѡѵсе', OX, 'i'],

    [r'\bмоле(?=[бн])', OX, 'i'],
    [r'моли\b', VA, 'i'],
    [r'моли(?=[лс])', OX, 'i'],
    [r'моли(?=тв(?!ослов))', OX, 'i'],
    [r'моли(?=т[еи]сѧ)', OX, 'i'],
    [r'молитвосло(?=в)', OX, 'i'],
    # мо́лимъ мо́лимсѧ
    [r'мо(?=лим)', OX, 'i'],
    [r'мо(?=лит(ъ|сѧ)\b)', OX, 'i'],
    [r'молю\b', VA, 'i'],
    [r'молю\B', OX, 'i'],
    [r'молѧ\b', VA, 'i'],
    [r'молѧ\B(?!тсѧ)', OX, 'i'],
    [r'мо(?=лѧтсѧ)', OX, 'i'],

    [r'молч[иеѧ]\b', VA, 'i'],
    [r'мо(?=лча\b)', OX, 'i'],
    [r'молч[аи]\B(?!лив)', OX, 'i'],
    [r'молчали\B', OX, 'i'],

    [r'мона(?=[хш]\B)', OX, 'i'],
    [r'моско(?=вс[кт])', OX, 'i'],
    [r'мо(?=р[еѣию]\b)', OX, 'i'],
    [r'морск[аиоꙋ]', OX, 'i'],
    [r'морст[ѣі]', OX, 'i'],
    [r'мра(?=з)', OX, 'i'],
    [r'мра(?=[кц])', OX, 'i'],
    [r'\bмра(?=ч)', OX, 'i'],

    # -мꙋ́др-
    [r'''
        мꙋ
        (?!
            др(
                ец
                |и(вш|[лсш])
                |[оѡ]([влт]|с(тьми|ост))
                |ѧ
                |ѣйш
            )
        )
        (?=др)
        ''', OX, 'i'],
    # мученик (! мученіе - ???)
    [r'мꙋдрова(?=н)', OX, 'i'],
    [r'мꙋ(?=жест)', OX, 'i'],
    [r'мꙋ(?=чен(?!і))', OX, 'i'],
    [r'мꙋче(?=ні)', OX, 'i'],
    [r'\bмы\b', VA, 'i'],
    [r'мы(?=сленн)', OX, 'i'],
    [r'мы(?=шц)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ннн nnn

    [r'надѣ(?=[жѧю])', OX, 'i'],
    [r'наде(?=ж)', OX, 'i'],
    [r'намѣ(?=рен)', OX, 'i'],

    # на́мъ на́шꙋ на́шего на́съ
    [r'''
        \b
        на
        (?=
            (
                [мс]
                [иъ]
                |
                ш
                (
                    [аꙋыъѧ]
                    |е([йюѧ]|го|м[ꙋъ])?
                    |и([мх][аиъ])?
                )
            )
            \b
        )
        ''', OX, 'i'],

    [r'\bнапа(?=ст)', OX, 'i'],
    [r'\bнапаѧ\B', OX, 'i'],
    [r'\bнаро(?=д)', OX, 'i'],
    [r'наслѣ(?=д)', OX, 'i'],
    [r'\bнаста\b', VA, 'i'],
    [r'\bнаста(?=ви)', OX, 'i'],
    [r'\bнаставлѧ\B', OX, 'i'],
    [r'\bнастоѧ(?=щ)', OX, 'i'],
    [r'насы(?=ти)', OX, 'i'],
    [r'насыща\B', OX, 'i'],
    [r'\bнаꙋчи\b', VA, 'i'],
    [r'\bнача(?=л[аоеѣꙋ]\b)', OX, 'i'],
    [r'\bнача(?=льн)', OX, 'i'],
    [r'\bначина\B', OX, 'i'],
    # небеса̀
    [r'\bнебес[аеѣи]\b', VA, 'i'],
    [r'\bнебесе(?=[хм]ъ)', OX, 'i'],
    # не́бо не́бꙋ
    [r'\bне(?=б\w\b)', OX, 'i'],
    [r'\bне(?=бомъ)', OX, 'i'],
    # небе́сный небе́съ
    [r'\bнебе(?=с(н\w|ъ))', OX, 'i'],
    [r'\bнебесѣ(?=хъ)', OX, 'i'],
    [r'невѣ(?=ст|щ)', OX, 'i'],
    [r'неви(?=дим)', OX, 'i'],
    [r'неви(?=нн)', OX, 'i'],

    [r'нѣ(?=гдѣ\b)', OX, 'i'],
    [r'негѡ(?=же\b)', OX, 'i'],
    [r'нег[оѡ]\b', VA, 'i'],
    [r'недѣ(?=л)', OX, 'i'],
    [r'нѣ(?=др)', OX, 'i'],
    [r'недꙋ(?=[гжз])', OX, 'i'],
    [r'\b(все)?нѣ(?=жн(?!ѣйш))', OX, 'i'],
    [r'\b(все)?нѣжнѣ(?=йш)', OX, 'i'],
    [r'неизглаго(?=л)', OX, 'i'],
    [r'неизрече(?=нн)', OX, 'i'],
    [r'\bне(?=й\b)', OX, 'i'],
    [r'не(?=йже)', OX, 'i'],
    [r'\bне(?=кі(ими|й))', OX, 'i'],
    [r'нѣ(?=котор)', OX, 'i'],
    [r'некта(?=рі)', OX, 'i'],
    [r'\bнѣ(?=к(то|огда|ій)\b)', OX, 'i'],
    [r'\bне(?=мъ\b)', OX, 'i'],
    [r'\bне(?=мже\b)', OX, 'i'],
    [r'\bнемо(?=лчн)', OX, 'i'],
    [r'\bнемꙋ\b', VA, 'i'],
    # нѣмы̑ѧ
    [r'\bнѣмы(?=ѧ)', GKA, 'i'],  # ??? мн.ч.?
    # нѣмо́й
    [r'\bнѣм(?!ыѧ?\b|от\w)[аіоꙋы]', OX, 'i'],
    # нѣмота̀
    [r'\bнѣмот[аꙋы]\b', VA, 'i'],
    # нѣ́мы
    [r'\bнѣ(?=мы\b)', OX, 'i'],

    [r'неѿе(?=млем)', OX, 'i'],
    [r'неѿстꙋ(?=пн)', OX, 'i'],

    [r'\bнепоколеби(?=м)', OX, 'i'],
    [r'\b(пре)?непоро(?=че?н)', OX, 'i'],
    [r'\bнепостижи(?=м)', OX, 'i'],

    [r'\bнепреста(?=нн)', OX, 'i'],
    [r'\bнепристꙋ(?=п)', OX, 'i'],

    [r'нерадѣ(?=ні)', OX, 'i'],
    [r'\bнерꙋши(?=м)', OX, 'i'],

    [r'нес[еꙋ]\b', VA, 'i'],
    [r'несе\B', OX, 'i'],
    [r'несꙋ(?=т)', OX, 'i'],
    [r'не(?=сл[съ])', OX, 'i'],
    [r'не(?=сш)', OX, 'i'],
    [r'нести\b', VA, 'i'],
    [r'несо(?=ст(?!а[вр]))', OX, 'i'],
    [r'несо(?=х(?!р))', OX, 'i'],
    [r'несо(?=ш)', OX, 'i'],

    [r'несла(?=с)', OX, 'i'],
    [r'несл[аио]\b', VA, 'i'],

    # нѣ́си нѣ́смь нѣ́смы нѣ́сть
    [r'\bнѣ(?=с([мт][ыь]|и)\b)', OX, 'i'],
    [r'\bнестрое(?=н)', OX, 'i'],
    [r'\bнетва(?=рн)', OX, 'i'],

    [r'\bнеꙋвѧда\B', OX, 'i'],
    [r'\bнеꙋгаси\B', OX, 'i'],
    [r'\bнеꙋста(?=нн)', OX, 'i'],

    [r'\bнѣ(?=что)', OX, 'i'],
    [r'\bнеѧ\b', VA, 'i'],
    [r'\bнеѧ(?=же)', OX, 'i'],

    [r'\bниже\b', VA, 'i'],
    [r'\bникого\b', VA, 'i'],
    [r'\bникого(?=же\b)', OX, 'i'],
    # нїко́лае
    [r'ніко(?=лае\b)', OX, 'i'],
    # нїкола́й
    [r'нікола(?!е\b)', OX, 'i'],
    [r'николи(?=же)', OX, 'i'],
    [r'никто(?=же)', OX, 'i'],

    [r'\bни(?=м(ъ|и?(же)?)\b)', OX, 'i'],
    [r'\bни(?=х(же|ъ)\b)', OX, 'i'],

    [r'ниспо[сш]ли\b', VA, 'i'],
    [r'ниспосле(?=ши)', OX, 'i'],
    [r'ниспосы?ла(?=ти|етъ)', OX, 'i'],

    [r'нищет[аеѣꙋы]\b', VA, 'i'],
    [r'нището(?=ю)', OX, 'i'],
    [r'\bни(?=щ[аиіꙋ])', OX, 'i'],

    # но́ваго но́вый но́вомꙋ но́выхъ
    [r'''
        \b
        но
        (?=
            в
            (
                а(г[оѡ]|ѧ)
                |ꙋю
                |о(г[оѡ]|[ейю]|м[ъꙋ])
                |ы([ейѧ]|[мх][аиъ])
            )\b
        )
        ''', OX, 'i'],

    [r'\bнога(?=м)', OX, 'i'],
    [r'\bнога\b', VA, 'i'],
    [r'\bно(?=г(ъ|зе)\b)', OX, 'i'],

    [r'носи(?=ти)', OX, 'i'],
    [r'но(?=сиши)', OX, 'i'],
    [r'(?<!воз)носи(?=м[^ъ])', OX, 'i'],
    [r'\b(?:при|воз)?но(?=си[мт]ъ)', OX, 'i'],
    [r'носѧ(?=щ)', OX, 'i'],
    [r'но(?=сѧт)', OX, 'i'],
    [r'носѧ\b', VA, 'i'],
    [r'(?<!ю)нош[аеꙋ]\B', OX, 'i'],
    [r'(?<!ю)ношꙋ\b', VA, 'i'],

    # но́чь но́щїю но́чи
    [r'\bно(?=[чщ](ь|ію|(?<=ч)и))', OX, 'i'],
    # нощѝ
    # [r'\bнощи\b', VA, 'i'],  # но́щи тоже есть
    [r'\bнощн[аѣоꙋы]\B', OX, 'i'],
    [r'\bно(?=щно\b)', OX, 'i'],

    [r'\bнꙋ(?=жды)', OX, 'i'],
    [r'нꙋжда\B', OX, 'i'],
    [r'\bнꙋ(?=жде\B)', OX, 'i'],
    [r'\Bнꙋжде\B', OX, 'i'],
    [r'\bнꙋ(?=жд?н)', OX, 'i'],

    # ны́нѣ
    [r'ны(?=нѣ)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ооо ooo

    [r'ѡба(?=че)', OX, 'i'],

    [r'\bѡбъе(?=м)', OX, 'i'],
    # [r'\bѡбъе(?=м(?!лите))', OX, 'i'],
    # [r'\bѡбъемли(?=те)', OX, 'i'],

    [r'ѡбѣ(?=сити)', OX, 'i'],

    [r'ѻбѣ(?=тъ)', OX, 'i'],
    [r'ѻбѣща\b', VA, 'i'],
    # ѻ҆бѣ́тъ ѻ҆бѣща́нїе ѻ҆бѣща́хомъ ѻ҆бѣща́въ
    [r'ѻбѣща(?=[влхшеюѧ]|ні|ти)', OX, 'i'],

    [r'ѻби(?=л)', OX, 'i'],
    [r'ѻби(?=тел)', OX, 'i'],

    [r'\bѡбъиди\b', VA, 'i'],
    [r'\bѡбъиди(?=те)', OX, 'i'],
    [r'\bѡбъидо(?=ша)', OX, 'i'],

    [r'\bѡбъи(?=ме)', OX, 'i'],
    [r'\bѡбъи(?=мꙋт)', OX, 'i'],
    [r'\bѡбъим[иꙋ]\b', VA, 'i'],
    [r'\bѡбъими(?=те)', OX, 'i'],
    [r'\bѡбъима', OX, 'i'],

    [r'\bѡбъити\b', VA, 'i'],

    [r'ѻ(?=блак[оъ])', IS, 'i'],
    [r'ѻ(?=блац)', IS, 'i'],

    [r'ѡблек[аіо]', OX, 'i'],
    [r'ѡбле(?=кл)', OX, 'i'],
    [r'ѡблече\b', VA, 'i'],
    [r'ѡблече\B', OX, 'i'],
    [r'ѡблецы\b', VA, 'i'],
    [r'ѡблецы\B', OX, 'i'],
    [r'ѡблеце\B', OX, 'i'],

    [r'ѡблистава\B', OX, 'i'],
    [r'ѡблиста\B(?!ва)', OX, 'i'],
    [r'ѡблиста\b', VA, 'i'],

    [r'ѡбнови\b', VA, 'i'],
    [r'ѡбнови\B', OX, 'i'],
    [r'ѡбновл[еєюѧ]\B', OX, 'i'],

    [r'ѡбожи\b', VA, 'i'],
    [r'ѡбож[аеи]\B', OX, 'i'],

    [r'\bѡ(?=браз(?!ꙋю))', IS, 'i'],
    [r'\bѡбра(?=д)', OX, 'i'],
    [r'\bѡбрати\b', VA, 'i'],
    [r'\bѡбрати\B', OX, 'i'],

    [r'\bѡбремен[еєиѧ]\B', OX, 'i'],

    [r'ѡбстоѧ\B', OX, 'i'],

    [r'\bѡбъѧ\b', VA, 'i'],
    [r'\bѡбъѧ(?=[лтш])', OX, 'i'],
    [r'\bѡбъѧ(?=сте)', OX, 'i'],
    [r'\bѡбъѧд[аео]', OX, 'i'],

    # ѡбъ([еиѧ]) -> ѡб̾\1
    [r'(ѡ)бъ([еиѧ])',  r'\1б̾\2', 'i'],

    [r'ѡбрѣ(?=[лт]ъ\b|тені)', OX, 'i'],
    [r'ѡбрѧ(?=щ)', OX, 'i'],
    [r'ѡбрѣт[ао]', OX, 'i'],
    [r'ѡбрѣ(?=тш)', OX, 'i'],
    [r'ѡбрѣсти\b', VA, 'i'],
    [r'ѡбрѣл[аи]\b', VA, 'i'],
    [r'ѡбꙋр[еє]ва\B', OX, 'i'],

    [r'ѻбщ[аеи](?!ежит)', OX, 'i'],

    [r'ѻбыкнове(?=н)', OX, 'i'],
    [r'ѻбы(?=ч)', OX, 'i'],

    # [r'ѻ(?=вц)', IS, 'i'],
    [r'Ѡглавле(?=н)', OX, 'i'],

    [r'ѻ(?=гнь)', IS, 'i'],
    [r'ѻ(?=гненн)', IS, 'i'],
    [r'ѻгнезра(?=чн)', OX, 'i'],
    [r'ѻгневи(?=дн)', OX, 'i'],
    [r'ѻгне(?=м)', OX, 'i'],
    [r'ѻгнепа(?=льн)', OX, 'i'],
    [r'ѻгн[иѣюѧ]', VA, 'i'],

    # ѡ҆дѣ́ющагосѧ
    [r'ѡдѣ(?=ющ)', OX, 'i'],
    [r'ѡдѣѧ\B', OX, 'i'],
    [r'ѻдѣѧ(?=ні\B)', OX, 'i'],
    [r'ѻдѣ(?=ѧни|ѧлсѧ)', OX, 'i'],
    [r'ѡдѣва(?=[еюѧ])', OX, 'i'],

    [r'\bѻди(?=нъ\b)', OX, 'i'],
    [r'\bѻдного\b', VA, 'i'],

    [r'[ѡѻ]деснꙋ(?=ю)', OX, 'i'],

    [r'ѡживи\b', VA, 'i'],
    [r'ѡживи\B', OX, 'i'],
    [r'ѡживле(?!на\b)', OX, 'i'],
    [r'ѡживлена\b', VA, 'i'],
    [r'ѡживлѧ', OX, 'i'],
    [r'ѡживотвор[еиѧ]\B', OX, 'i'],
    [r'ѡживотвори\b', VA, 'i'],

    [r'ѡжида', OX, 'i'],

    [r'ѡзари\b', VA, 'i'],
    [r'ѡзар[еєиѧ]\B', OX, 'i'],

    [r'ѡкаѧ\B(?!хъ)', OX, 'i'],

    [r'\bѻ(?=к[аоꙋ]\b)', IS, 'i'],
    [r'\bѻ(?=комъ\b)', IS, 'i'],

    [r'ѡкре(?=стн)', OX, 'i'],
    [r'ѡкропи\b', VA, 'i'],
    [r'ѡкропи\B', OX, 'i'],


    [r'\bѡ(?=крестъ)', IS, 'i'],

    [r'\bѡлѧденѣ(?=вш)', OX, 'i'],

    # ѡ҆мы́й ѡ҆мы́ю
    [r'ѡмы(?!ва)', OX, 'i'],
    # ѡ҆мыва́ти
    [r'ѡмыва\B', OX, 'i'],

    [r'ѻн[аи]\b', VA, 'i'],
    [r'ѻ(?=н[оꙋы]\b)', IS, 'i'],
    [r'ѻ(?=н[ьъ]\b)', IS, 'i'],
    [r'ѻ(?=н[аоꙋы]\B)', IS, 'i'],
    [r'ѻ(?=ньже\b)', IS, 'i'],

    # ѡ҆правди́ши
    [r'ѡправд[иѧ]\B', OX, 'i'],
    [r'ѡправда\B(?!ны\b)', OX, 'i'],
    [r'ѡпра(?=вданы\b)', OX, 'i'],
    [r'ѡправд[аи]\b', VA, 'i'],
    [r'ѡпра(?=вды\B)', OX, 'i'],

    [r'ѻ(?=рл[юѧ]\b)', IS, 'i'],

    [r'ѡро(си|ша)\B', OX, 'i'],
    [r'ѡроси\b', VA, 'i'],

    [r'ѻрꙋ(?=[жд]і)', OX, 'i'],

    [r'ѡсѣни\b', VA, 'i'],
    [r'ѡсѣн[еиѧ]\B', OX, 'i'],

    [r'ѡскверни\b', VA, 'i'],
    [r'ѡскверн[еиѧ]\B', OX, 'i'],

    [r'ѡскорб[иѧ]\B', OX, 'i'],
    [r'ѡскорб[иѣ]\b', VA, 'i'],
    [r'ѡскорблю\b', VA, 'i'],
    [r'ѡскорбл[еєѧ]\B', OX, 'i'],

    [r'ѡскꙋдѣ\b', VA, 'i'],
    [r'ѡскꙋдѣ(?!ва)\B', OX, 'i'],
    [r'ѡскꙋдѣва\B', OX, 'i'],
    [r'ѡскꙋдѣва\b', VA, 'i'],

    # ѡ҆ста́ви
    [r'ѡста(?=в([ишьѧ]|ль))', OX, 'i'],
    [r'ѡста(?=влен(?!і))', OX, 'i'],
    [r'ѡставле(?=ні)', OX, 'i'],
    # ѡ҆ставлѧ́ти
    [r'ѡставлѧ', OX, 'i'],
    [r'ѡсꙋжд[аеє]', OX, 'i'],

    [r'ѿве(?=рз[еє](?!ні))', OX, 'i'],
    [r'ѿве(?=рз[илстꙋшыъ])', OX, 'i'],
    [r'ѿверза', OX, 'i'],
    [r'ѿверзо(?=ст|[хш])', OX, 'i'],
    [r'ѿверзе(?=ні)', OX, 'i'],

    [r'ѿвѣ(?=т)', OX, 'i'],
    [r'ѿвѣщава', OX, 'i'],
    [r'ѿвѣща(?!ва)\B', OX, 'i'],
    [r'ѿвѣща\b', VA, 'i'],

    [r'ѿврати\b', VA, 'i'],
    [r'ѿврати\B', OX, 'i'],

    [r'(ѿ|ѻт)крове(?=ні)', OX, 'i'],

    [r'ѿкры\b', VA, 'i'],
    [r'ѿкры(?!ва)', OX, 'i'],
    [r'ѿкрыва', OX, 'i'],

    [r'ѿѻ?ню(?=д)', OX, 'i'],
    [r'ѿне(?=л[еєи]же)', OX, 'i'],

    [r'ѿстꙋпи\b', VA, 'i'],
    [r'ѿстꙋпи(?!тъ)\B', OX, 'i'],
    [r'ѿстꙋ(?=питъ\b)', OX, 'i'],

    # ѻ҆тцы̀ ѻ҆те́цъ ѻ҆те́чь ѻ҆те́ческїй ѻ҆́тча ѻ҆́тчїй ѻ҆те́ческїй ѻ҆те́чество
    [r'\bѻт[еєѣ](?=цъ)', OX, 'i'],
    [r'\bѻтц[аеѣꙋы]\b', VA, 'i'],
    [r'\bѻтц[аеєѣо]\B', OX, 'i'],
    # для Ѻ҆́ч҃е - если в тексте слово Отче уже с исо и с титлом.
    [r'\bѻ(?=че\b)', IS, 'i'],
    [r'\bѻ(?=тч([еєѣіꙋ]|и(?!зн)|а(?!ѧн)))', IS, 'i'],
    [r'\bѻте(?=ч(ь\b|ес[кт]))', OX, 'i'],
    [r'\bпра(?=ѻте?[чц](?!ескаг))', OX, 'i'],

    [r'ѿпꙋ(?=ст[еѣъ])', OX, 'i'],
    [r'ѿпꙋсти(?=т[еє]ль)', OX, 'i'],
    [r'ѿпꙋсти(?=[вш]|ти)', OX, 'i'],
    [r'ѿпꙋсти\b', VA, 'i'],

    # ѿра́до
    [r'ѿра(?=д)', OX, 'i'],

    [r'ѿрѣш[аеи]\B', OX, 'i'],
    [r'ѿрѣш[иꙋ]\b', VA, 'i'],
    [r'ѿрѣ(?=шш)', OX, 'i'],

    [r'ѻтрокови(?=ц)', OX, 'i'],
    [r'ѻ(?=трок[аиꙋъ])', IS, 'i'],
    [r'ѻ(?=троц[ыѣе])', IS, 'i'],
    [r'ѻтроча\b', VA, 'i'],
    [r'ѻтроча\B', OX, 'i'],


    [r'ѿсе(?=лѣ)', OX, 'i'],

    [r'ѿими\b', VA, 'i'],

    # отча́ѧнїе см чаѧ-
    # [r'ѿча(?=ѧн)', OX, 'i'],

    [r'ѡчи(?=с(?!титель)|щꙋ)', OX, 'i'],
    [r'ѡчища', OX, 'i'],

    [r'ѻчи(?=ма)', OX, 'i'],
    [r'\bѻ(?=чи\b)', IS, 'i'],
    [r'\bѻ(?=чію\b)', IS, 'i'],
    # [r'\bѻчесѣ(?=[мх]ъ\b)', OX, 'i'],
    [r'\bѻчес[аеиы]\b', VA, 'i'],
    [r'\bѻчес[аеєѣ]\B', OX, 'i'],
    [r'\bѻче(?=съ|й\b)', OX, 'i'],
    [r'\bѻчи(?=ма\b)', OX, 'i'],
    [r'\bѻча(?=[мх][иъ]\b)', OX, 'i'],

    [r'ѻса(?=н)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ппп ppp

    [r'па(?=ве?л)', OX, 'i'],

    [r'паде(?=ні)', OX, 'i'],
    [r'па(?=дш)', OX, 'i'],

    [r'па(?=(ки|че)\b)', OX, 'i'],
    [r'па(?=мѧ(?!то[вп]))', OX, 'i'],
    [r'пара(?=клис)', OX, 'i'],
    [r'па(?=ст(?!([иꙋ]|рена)))', OX, 'i'],
    [r'пастыренача(?=льн)', OX, 'i'],
    [r'(?<!на)паст?и\b', VA, 'i'],
    [r'пасꙋ\b', VA, 'i'],

    [r'па(?=сх[аеиꙋ]\b)', OX, 'i'],
    [r'па(?=схо[йю]\b)', OX, 'i'],
    [r'пасха\B', OX, 'i'],

    [r'патріа(?=р)', OX, 'i'],

    # пѣ́ти напѣ́въ (! терпѣнїе)
    [r'(?<!ер)пѣ(?!ва)(?=[влнт])', OX, 'i'],
    [r'припѣва\B', OX, 'i'],
    [r'\bвсепѣ(?=т)', OX, 'i'],

    # ѿпѣва́нїе
    [r'ѿпѣва', OX, 'i'],

    [r'пелагі', OX, 'i'],

    [r'пѣ(?=сн(?!о))', OX, 'i'],

    [r'пе(?=тр[еъ])', OX, 'i'],
    [r'петр[оѡ](?=в)', OX, 'i'],
    [r'петро(гра|па)', OX, 'i'],
    [r'петр[аѣꙋ]\b', VA, 'i'],

    [r'печа(?=л)', OX, 'i'],

    [r'печа(?=т(?!л))', OX, 'i'],
    [r'печатлѣ', OX, 'i'],
    [r'пе(?=щн)', OX, 'i'],

    [r'пита(?!ва)', OX, 'i'],
    [r'питава', OX, 'i'],
    [r'\bпіѧ\b', VA, 'i'],
    [r'\bпіѧ(?=[вйнсхш])', OX, 'i'],

    [r'пла(?=менн)', OX, 'i'],
    [r'пламени\B', OX, 'i'],
    [r'\bпла(?=мен[иь]\b)', OX, 'i'],
    [r'\bпла(?=менемъ\b)', OX, 'i'],
    [r'пла(?=мѧ)', OX, 'i'],
    [r'пламен[еѣ](?=[юѧ])', OX, 'i'],

    # пла́чь пла́чꙋщаѧ
    [r'пла(?!чевн)(?=[чк])', OX, 'i'],
    # плаче́вный
    [r'плаче(?=вн)', OX, 'i'],

    [r'плѣ(?=нъ\b)', OX, 'i'],
    [r'плѣн[иꙋю]\b', VA, 'i'],
    [r'плѣн[иѧ]\B', OX, 'i'],
    [r'плѣн[еє](?=н)', OX, 'i'],


    [r'\bпло(?=дъ\b)', OX, 'i'],
    [r'\bплод[ѣꙋы]\b', VA, 'i'],
    [r'пло(?=д(н|ст))', OX, 'i'],

    [r'\bпло(?=т[ьиі])', OX, 'i'],

    [r'побѣжда\B', OX, 'i'],
    [r'побѣди\B', OX, 'i'],
    [r'побѣди\b', VA, 'i'],
    [r'побѣ(?!донос)(?=д[аеоꙋы]\b)', OX, 'i'],
    [r'побѣ(?=дн\B)', OX, 'i'],
    [r'побѣдоно(?=сн)', OX, 'i'],

    [r'пло(?=д[нсіъ])', OX, 'i'],

    [r'погиба\B', OX, 'i'],
    [r'поги(?=б[елнш])', OX, 'i'],
    [r'поги(?=бел)', OX, 'i'],

    [r'погꙋби\B', OX, 'i'],
    [r'погꙋби\b', VA, 'i'],

    [r'по(?=двиг([ъиꙋеѣ]\b|а[мх]?))', OX, 'i'],
    # подви́жникъ (! подвиженїе подвижастесѧ)
    [r'подви(?=ж(?!а(с|ти)|ені))', OX, 'i'],
    # подвиза́лсѧ
    [r'подвиза', OX, 'i'],
    # по́двизехъ
    [r'по(?=двиз[иеѣ])', OX, 'i'],

    # подоба́етъ
    [r'\bподоба', OX, 'i'],
    [r'\bподо(?=бе?н(?!оревн))', OX, 'i'],

    # пое́мъ пои́мъ пое́тъ пое́мый пое́тсѧ
    [r'\bпое(?=м)', OX, 'i'],
    [r'\bпое(?=т(?!е\b))', OX, 'i'],
    [r'\bпои(?=мъ\b)', OX, 'i'],
    [r'\b((пред)?вос|пѣсно)?по(?=йт?)', OX, 'i'],

    # поживѐ поживе́ши
    [r'пожи(?=в[шыъ])', OX, 'i'],
    [r'пожив[еиꙋ]\b', VA, 'i'],
    [r'поживе(?=[мт]ъ|ши\b)', OX, 'i'],
    [r'поживꙋ(?=тъ\b)', OX, 'i'],

    [r'позлаще(?=н)', OX, 'i'],

    [r'поимꙋ\b', VA, 'i'],

    [r'покаж[иꙋ]\b', VA, 'i'],
    [r'показа\b', VA, 'i'],
    [r'показа\B', OX, 'i'],

    # покаѧ́нїе
    [r'покаѧ(?=н)', OX, 'i'],
    # пока́ѧтисѧ
    [r'пока(?=ѧ[стхш])', OX, 'i'],

    [r'покланѧ', OX, 'i'],
    [r'покло(?=нѧтсѧ)', OX, 'i'],
    [r'покло(?=на)', OX, 'i'],
    [r'поклон[еє](?=н)', OX, 'i'],
    [r'покло(?=н[ѣноѡшъыь])', OX, 'i'],
    [r'поклони(?!тсѧ)', OX, 'i'],
    [r'поклоню', OX, 'i'],
    [r'поклонѧ(?!тсѧ)', OX, 'i'],

    [r'поко(?=[йеѣюѧ]\b)', OX, 'i'],
    [r'поко(?=и(?!ваѧ))', OX, 'i'],
    [r'покоева', OX, 'i'],
    [r'покое(?=н(?!а\b))', OX, 'i'],
    [r'поко(?=ена\b)', OX, 'i'],
    [r'поко(?=емъ\b)', OX, 'i'],

    [r'покро(?!в(ен[ан]|ител))(?=в)', OX, 'i'],
    [r'покрове(?=нн)', OX, 'i'],
    [r'покрови(?=тел)', OX, 'i'],

    [r'покры\b', VA, 'i'],
    [r'покры(?=[ейлстхшю])', OX, 'i'],
    [r'покрыва\B', OX, 'i'],

    [r'полага', OX, 'i'],

    [r'\bполки\b', VA, 'i'],

    [r'\bпо(?=лн(?!(ѣйш|от)))', OX, 'i'],
    [r'полнѣ(?=йш)', OX, 'i'],
    [r'полна\b', VA, 'i'],
    [r'полнот[аеєѣꙋы]\b', VA, 'i'],

    [r'\bполож[иꙋ]\b', VA, 'i'],
    [r'\bположи\B', OX, 'i'],

    [r'\bполꙋ(?=де?н)', OX, 'i'],
    [r'\bполꙋ(?=нощ)', OX, 'i'],

    [r'пома(?=ж)', OX, 'i'],
    [r'пома(?=за)', OX, 'i'],
    [r'помазꙋ', OX, 'i'],

    [r'поми(?=л)', OX, 'i'],

    [r'помина', OX, 'i'],

    [r'^по(?=мощ([еиь]|ію))', OX, 'i'],
    [r'^помо(?=щн)', OX, 'i'],
    [r'^помо[гз]и\b', VA, 'i'],
    [r'^помога', OX, 'i'],
    [r'^помо(?=глъ)', OX, 'i'],

    [r'^по(?=мысл[аꙋыъ]\b)', OX, 'i'],
    [r'^по(?=мысл[аеєоѡѣ])', OX, 'i'],
    [r'^помы(?=сл[еє]н)', OX, 'i'],
    [r'^помы(?=сли)', OX, 'i'],
    [r'^помы(?=слѧтъ)', OX, 'i'],
    [r'^помышл[еє](?=н)', OX, 'i'],
    [r'^помышлѧ', OX, 'i'],

    [r'помѧн[еиꙋ]\b', VA, 'i'],
    [r'помѧн[еиꙋ]\B', OX, 'i'],

    [r'поне(?=же\b)', OX, 'i'],
    [r'\bпони(?=к)', OX, 'i'],

    [r'\bпоноша\B', OX, 'i'],
    [r'\bпоноше(?=н)', OX, 'i'],
    [r'\bпоноси\b', VA, 'i'],
    [r'\bпоноси\B(?!тъ)', OX, 'i'],
    [r'\bпоно(?=с[иѧ]тъ)', OX, 'i'],
    [r'\bпоносѧ\B(?!тъ)', OX, 'i'],

    [r'\bпопали\b', VA, 'i'],
    [r'\bпопали\B', OX, 'i'],

    [r'попече\B', OX, 'i'],

    [r'попра\b', VA, 'i'],
    [r'попра\B', OX, 'i'],

    [r'попꙋска\B', OX, 'i'],
    [r'попꙋсти\b', VA, 'i'],
    [r'попꙋсти\B', OX, 'i'],
    [r'попꙋ(?=стѧ\B)', OX, 'i'],
    [r'попꙋщꙋ\b', VA, 'i'],
    [r'попꙋщ[ае]\B', OX, 'i'],

    [r'порабоще\B', OX, 'i'],

    [r'порази\b', VA, 'i'],
    [r'порази\B', OX, 'i'],
    [r'поражꙋ\b', VA, 'i'],
    [r'пораж[аеє]\B', OX, 'i'],

    [r'порꙋга\b', VA, 'i'],
    [r'порꙋга\B(?!н[наъ])', OX, 'i'],
    [r'порꙋ(?=ган[анъ])', OX, 'i'],

    [r'порфѵ(?=р(?!о(?![йю]|\b)))', OX, 'i'],

    [r'посади\b', VA, 'i'],
    [r'посади\B', OX, 'i'],
    [r'посаждꙋ\b', VA, 'i'],
    [r'посажд[аеє]\B', OX, 'i'],
    [r'поса(?=ждь\b)', OX, 'i'],

    [r'посе(?=м[ꙋъ]\b)', OX, 'i'],

    # посѣтѝ
    [r'посѣти\b', VA, 'i'],
    # посѣти́ша
    [r'посѣти\B', OX, 'i'],
    # посѣщꙋ̀
    [r'посѣщ[аꙋ]\b', VA, 'i'],
    # посѣща́еши
    [r'посѣщ[ае]\B', OX, 'i'],

    [r'посл[аию]\b', VA, 'i'],
    [r'по(?=слан[аи]\B)', OX, 'i'],
    [r'по(?=сланъ\b)', OX, 'i'],
    [r'посла(?=[влстхш]\B)', OX, 'i'],
    [r'посла(?=н[і]\B)', OX, 'i'],
    [r'посла(?=нни\B)', OX, 'i'],
    [r'по(?=слеши\b)', OX, 'i'],

    # по́слѣ
    [r'по(?=слѣ(жд[еи])?\b)', OX, 'i'],
    # послѣ́днїй
    [r'послѣ(?=д(?!и\b))', OX, 'i'],
    # послѣдѝ
    [r'послѣди\b', VA, 'i'],
    # посредѝ посредѐ
    [r'посред[еѣи]\b', VA, 'i'],

    [r'пострада\b', VA, 'i'],

    [r'пото(?=к)', OX, 'i'],
    [r'потре(?=бн)', OX, 'i'],
    [r'потреби\b', VA, 'i'],
    [r'потреби\B', OX, 'i'],
    [r'потреблѧ\B', OX, 'i'],

    [r'потщи\B', OX, 'i'],

    [r'поꙋч[аеиꙋ]\B', OX, 'i'],

    [r'похвал[аеѣиоꙋыю]\b', VA, 'i'],
    [r'похвал[аеєиѧ]\B', OX, 'i'],

    [r'\bпо(?=стъ)', OX, 'i'],
    [r'\bпост[аѣꙋы]\b', VA, 'i'],
    [r'\bпостѣ\B', OX, 'i'],
    [r'\bпости([вмстхш]|л(?!а[ехш]))', OX, 'i'],
    [r'\bпосто(?=мъ)', OX, 'i'],
    [r'\bпостѧ\B', OX, 'i'],
    [r'\bпощ[еєꙋ]\B', OX, 'i'],

    [r'поста(?=в(?!л(ѧ|е(й|ні))))', OX, 'i'],
    [r'поставлѧ\B', OX, 'i'],
    [r'поставле(?=й|ні)', OX, 'i'],

    [r'посте(?=л)', OX, 'i'],

    [r'по(?=хот[іиьѧ])', OX, 'i'],
    [r'по(?=хотн[ѣіоы])', OX, 'i'],
    [r'похотѣ(?=[внт])', OX, 'i'],

    [r'почерпа\B', OX, 'i'],
    [r'почерп[еи]\b', VA, 'i'],
    [r'поче(?=рпъ\b)', OX, 'i'],
    [r'поче(?=рпш\B)', OX, 'i'],
    [r'почерпи(?=те\b)', OX, 'i'],
    [r'почерпнꙋ\B', OX, 'i'],
    [r'почерпы\B', OX, 'i'],
    [r'почерпо\B', OX, 'i'],

    [r'почи\b', VA, 'i'],
    [r'почива\B', OX, 'i'],
    [r'почи(?=в[шъы])', OX, 'i'],
    [r'почи(?=л)', OX, 'i'],
    [r'почи(?=ти\b)', OX, 'i'],

    [r'почита\B', OX, 'i'],

    [r'почт[иеꙋ]\b', VA, 'i'],
    [r'почт[еиоꙋыѧ]\B', OX, 'i'],

    [r'почто\b', VA, 'i'],


    [r'пощади\b', VA, 'i'],
    [r'пощади\B', OX, 'i'],
    [r'пощажде\B', OX, 'i'],
    [r'пощаждꙋ\b', VA, 'i'],

    # пою́щїй
    [r'пою(?=[тщ])', OX, 'i'],
    [r'(?<!сто)пою\b', VA, 'i'],
    [r'поѧ(?=щ)', OX, 'i'],
    [r'поѧ\b', VA, 'i'],

    [r'поѧва\B', OX, 'i'],
    [r'поѧвле\B', OX, 'i'],
    [r'поѧд[аео]\B', OX, 'i'],
    [r'поѧде\b', VA, 'i'],

    [r'поѧ(?=[стхш])', OX, 'i'],
    [r'поѧ(?=л)', OX, 'i'],

    [r'пра(?=вд[аеѣꙋы]\b)', OX, 'i'],
    [r'правди\B', OX, 'i'],


    [r'пра(?=вед)', OX, 'i'],
    [r'\bпра(?=ва\B)', OX, 'i'],
    [r'\bпра(?=ви\b)', OX, 'i'],
    [r'пра(?=ви[влшс])', OX, 'i'],
    [r'пра(?=вити)', OX, 'i'],
    [r'прави(?=тел)', OX, 'i'],

    [r'\bпра(?=во[ейю]?\b)', OX, 'i'],
    [r'\bпра(?=вом[ꙋъ]\b)', OX, 'i'],
    [r'\bпра(?=вꙋ)', OX, 'i'],
    [r'\bпра(?=вы)', OX, 'i'],
    [r'\bправот[аѣꙋы]\b', VA, 'i'],
    [r'\bправото(?=ю)', OX, 'i'],

    [r'(?<![Оᲂ]у|ис)пра(?=здн(?!о(люб|сло)))', OX, 'i'],
    [r'\bпразднолю(?=б[нц])', OX, 'i'],
    [r'\bпразднолюбе(?=з)', OX, 'i'],
    [r'\bпраздносло(?=в)', OX, 'i'],
    [r'(?<=[Оᲂ]у|ис)праздн[ию]\b', VA, 'i'],
    [r'(?<=[Оᲂ]у|ис)праздн[еиюѧ]\B', OX, 'i'],


    [r'преврати\b', VA, 'i'],
    [r'преврати\B', OX, 'i'],

    [r'превра(?=тн)', OX, 'i'],
    [r'превратѧ\B', OX, 'i'],
    [r'превращ[ае]\B', OX, 'i'],
    [r'превра(?=щ[сшь])', OX, 'i'],
    [r'превращꙋ\b', VA, 'i'],

    [r'преда[ѧю]?\b', VA, 'i'],
    [r'предава\B', OX, 'i'],
    [r'предаде\b', VA, 'i'],
    [r'предад[еиꙋѧ]\B', OX, 'i'],
    [r'преда[еѧю]\B', OX, 'i'],
    [r'преда(?=[жймстхш]\B)', OX, 'i'],
    [r'преда(?=лсѧ)', OX, 'i'],
    [r'преда(?=ні)', OX, 'i'],
    [r'пре(?=данн[оꙋы])', OX, 'i'],

    [r'предвар[ию]\b', VA, 'i'],
    [r'предвар[иѧ]\B', OX, 'i'],

    [r'предꙋ?вѣ(?=д)', OX, 'i'],

    [r'\b(без|не)?предѣ(?=л(?!опол))', OX, 'i'],
    [r'\b(?<!ез|не)?предѣл[еиѧ]\B', OX, 'i'],
    [r'\b((пред)?ѡ)?предѣли\b', VA, 'i'],

    [r'пре(?=дк\B)', OX, 'i'],
    [r'предте(?=ч)', OX, 'i'],

    [r'\bпре(?=д[оъ]\b)', OX, 'i'],

    [r'\bпредста\b', VA, 'i'],
    [r'предста(?!вл[еѧ]|ет[еъ])\B', OX, 'i'],
    [r'представлѧ', OX, 'i'],
    [r'представле(?=ні)', OX, 'i'],
    [r'предстае(?=т[еъ])', OX, 'i'],

    [r'предсто[юѧ]\b', VA, 'i'],
    [r'предсто[иѧ]\B', OX, 'i'],

    [r'прее(?=м\B)', OX, 'i'],
    [r'преесте(?=ств\B)', OX, 'i'],

    [r'пре(?=жде\b)', OX, 'i'],
    [r'пре(?=жд?н\B)', OX, 'i'],

    [r'презира\B', OX, 'i'],
    # TODO: сравнить с зрѣ- зри-
    [r'пре(?=зри(тъ|ши)?\b)', OX, 'i'],
    [r'презри(?=тел)', OX, 'i'],
    [r'презрѣ\b', VA, 'i'],
    [r'презрѣ\B', OX, 'i'],

    [r'\bпреиспо(?=д)', OX, 'i'],
    [r'\bпре(?=йде\b)', OX, 'i'],
    [r'\bпре(?=йде[мт]ъ\b)', OX, 'i'],
    [r'\bпре(?=йде(те|ши)\b)', OX, 'i'],
    # [r'\bпре(?=йдꙋ(тъ)?\b)', OX, 'i'],

    [r'прекло(?=н[ньш])', OX, 'i'],
    # [r'преклоне(?=н)', OX, 'i'],
    [r'преклон[иѧ]\B', OX, 'i'],
    [r'преклоне(?!нъ)', OX, 'i'],

    [r'преле(?=стн)', OX, 'i'],
    [r'пре(?=лест(?!н))', OX, 'i'],
    [r'прельсти\b', VA, 'i'],
    [r'прельщ[аеєꙋ]\B', OX, 'i'],
    [r'прельсти\B', OX, 'i'],

    [r'\bпреломл[еєѧ]\B', OX, 'i'],
    [r'\bпрело(?=мль)', OX, 'i'],

    [r'\bпреѡбраж[ае]', OX, 'i'],
    [r'\bпреѡбра(?=ж(ь?с|ш))', OX, 'i'],
    [r'\bпреѡбрази\b', VA, 'i'],
    [r'\bпреѡбраз[иꙋ]\B', OX, 'i'],
    [r'\bпреѡбразова\b', VA, 'i'],
    [r'\bпреѡбразова\B', OX, 'i'],

    [r'преподо(?=б(?!но[им]))', OX, 'i'],

    [r'преста(?=вл[ьѧ])', OX, 'i'],
    [r'преста(?=вленн)', OX, 'i'],
    [r'преста(?=в[иш])', OX, 'i'],
    [r'преставле(?=ні)', OX, 'i'],

    [r'престае(?=ш)', OX, 'i'],

    # преста́ти преста́й преста́ша
    [r'преста(?=[йхш]|ти)', OX, 'i'],

    [r'преста(?=н)', OX, 'i'],
    [r'преста[юѧ]\B', OX, 'i'],
    [r'преста[юѧ]\b', VA, 'i'],

    [r'престо(?=л)', OX, 'i'],

    [r'пречи(?=ст)', OX, 'i'],

    [r'прибли(?=жи)', OX, 'i'],
    [r'приближа(?=[еюѧ])', OX, 'i'],

    [r'пріе(?=м[лншьъы])', OX, 'i'],

    [r'призы?ва(?=[внтхш])', OX, 'i'],
    [r'призва(?=л(?!а))', OX, 'i'],
    [r'призыва(?=[еєйлюѧ])', OX, 'i'],
    [r'призвала\b', VA, 'i'],  # ???

    [r'\bпри(?=зри)', OX, 'i'],

    # прїидѝ
    [r'пріид[иꙋ]\b', VA, 'i'],
    # прїиди́те
    [r'пріид[ио]\B', OX, 'i'],
    # прїи́демъ
    [r'пріи(?=де[мтш])', OX, 'i'],
    [r'пріи(?=де\b)', OX, 'i'],
    [r'пріи(?=дꙋт)', OX, 'i'],

    [r'пріи(?=ме[мтш])', OX, 'i'],
    [r'пріи(?=мꙋт)', OX, 'i'],
    [r'пріи(?=м[шъ])', OX, 'i'],
    [r'пріима(?=ти|[хшѧ])', OX, 'i'],
    [r'пріими\b', VA, 'i'],
    [r'пріими(?=те\b)', OX, 'i'],
    [r'пріимы(?=й\b)', OX, 'i'],

    [r'приклон[июѧ]\b', VA, 'i'],
    [r'приклон[еиѧ]\B', OX, 'i'],
    [r'прикло(?=н[шь])', OX, 'i'],

    [r'прикоснове(?=н)', OX, 'i'],

    [r'прилѣ(?=жн)', OX, 'i'],
    [r'прилѣж[аиꙋѧ]\b', VA, 'i'],
    [r'прилѣж[аи]\B', OX, 'i'],

    [r'прилож[иꙋ]\b', VA, 'i'],
    [r'прило(?=жш)', OX, 'i'],
    [r'приложи\B', OX, 'i'],

    [r'припа(?=дае)', OX, 'i'],  # ???
    [r'припаде(?=[мт]ъ\b)', OX, 'i'],
    [r'припадꙋ(?=тъ\b)', OX, 'i'],
    [r'припадо\B', OX, 'i'],
    [r'припад[еиꙋ]\b', VA, 'i'],

    [r'присѣща', OX, 'i'],

    [r'при(?=снѡ\b)', OX, 'i'],
    [r'при(?=сны[йѧ]\b)', OX, 'i'],
    [r'при(?=сны[мх][иъ]\b)', OX, 'i'],

    # приста́нище
    [r'приста(?=н)', OX, 'i'],

    # прите́къ притеко́хъ притекꙋ̀
    [r'притек[аіо]', OX, 'i'],
    [r'притекл[аи]\b', VA, 'i'],
    [r'притекꙋ\b', VA, 'i'],
    [r'прите(?=кл?ъ\b)', OX, 'i'],
    [r'прите(?=кш)', OX, 'i'],

    [r'прича(?=ст[веін])', OX, 'i'],
    [r'причасти\b', VA, 'i'],
    [r'причасти\B', OX, 'i'],
    [r'причащ[аеєꙋ]\B', OX, 'i'],
    [r'прича(?=щ[шь])', OX, 'i'],

    [r'пріѧ', OX, 'i'],

    [r'проба(?=ви)', OX, 'i'],

    [r'пробод[еи]\b', VA, 'i'],
    [r'пробод[аеоы]\B', OX, 'i'],

    [r'прозѧ(?=б(?![аеєоы]|л[еє]н))', OX, 'i'],
    [r'прозѧб[аеєоы]\B', OX, 'i'],
    [r'прозѧбе\b', VA, 'i'],

    [r'простира', OX, 'i'],
    [r'\bпрокі(?=ме?н)', OX, 'i'],

    [r'проле(?=й)', OX, 'i'],
    [r'пролі[юѧ]\b', VA, 'i'],
    [r'пролі[еюѧ]\B', OX, 'i'],
    [r'пролива\B', OX, 'i'],
    [r'пролиты\B', OX, 'i'],
    [r'проли(?=ті)', OX, 'i'],

    [r'про(?=мысл[аѣꙋъ])', OX, 'i'],
    [r'промысли(?=те\B)', OX, 'i'],
    [r'промы(?=сленн)', OX, 'i'],
    [r'промы(?=сли(тъ|в))', OX, 'i'],
    [r'промышл[еѧ]', OX, 'i'],

    [r'\bпроро', OX, 'i'],

    [r'прос[иѧ]\b', VA, 'i'],
    [r'про(?=сива)', OX, 'i'],
    [r'про(?=си[мт]ъ)', OX, 'i'],
    [r'про(?=сиши)', OX, 'i'],
    [r'про(?=сѧтъ)', OX, 'i'],
    [r'проси(?=в[сшъы])', OX, 'i'],
    [r'проси(?=[лсх])', OX, 'i'],
    [r'\bпроси(?=м[аоꙋы])', OX, 'i'],
    [r'проси(?=т(ел|и))', OX, 'i'],
    [r'проси(?=ша)', OX, 'i'],
    [r'просѧ(?=[йхшщ])', OX, 'i'],

    [r'\bпрости\b', VA, 'i'],
    [r'\bпрости\B(?!ра)', OX, 'i'],

    [r'\bпростира\B', OX, 'i'],
    [r'простр[еиꙋ]\b', VA, 'i'],
    [r'простр[еѣиоыꙋ]\B', OX, 'i'],
    [r'простра(?=н[нcш])', OX, 'i'],
    [r'простран[еѧ]\B', OX, 'i'],

    [r'проти(?=ви)', OX, 'i'],
    [r'противл[еєѧ]\B', OX, 'i'],
    [r'проти(?=вл[ью])', OX, 'i'],
    [r'проти(?=в[нѧ])', OX, 'i'],
    [r'\bпро(?=тивъ)', OX, 'i'],

    [r'\bпро(?=ч[аіꙋы])', OX, 'i'],
    [r'\bпро(?=че[еймю])', OX, 'i'],
    [r'\bпро(?=чи[мх])', OX, 'i'],

    [r'прощ[аеє]', OX, 'i'],
    [r'прощꙋ\b', VA, 'i'],

    # ѱало́мъ
    [r'ѱало(?=м)', OX, 'i'],
    # ѱалти́рь
    [r'ѱалт[иы]', OX, 'i'],
    # ѱалмы̀
    [r'ѱалм[аеѣы]\b', VA, 'i'],
    [r'ѱалмопѣ(?=в)', OX, 'i'],

    [r'\bптенц[аеꙋѣы]\b', VA, 'i'],
    [r'\bптенц[аеєоѡ]\b', OX, 'i'],
    [r'\bптене(?=цъ)', OX, 'i'],

    [r'\bпꙋсты(?=н(?!ь|н?([ео](лю|жи))))', OX, 'i'],
    [r'\bпꙋ(?=стынь)', OX, 'i'],

    [r'пꙋт[еѧ](?=м[иъ])', OX, 'i'],
    [r'пꙋт[еѧ](?=хъ)', OX, 'i'],
    [r'пꙋ(?=т(ь|ник))', OX, 'i'],
    [r'\bпꙋти\b', VA, 'i'],

    [r'пѧтидесѧ(?=тниц)', OX, 'i'],
    [r'пѧто(?=к)', OX, 'i'],
    [r'пѧтка\b', VA, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ррр rrr

    # ра́бъ раба̀ рабы̀ рабѝ рабо́мъ рабе́хъ
    [r'\bра(?=бъ)', OX, 'i'],
    [r'\bраб[аиыоꙋ]\b', VA, 'i'],
    [r'\bрабо(?=мъ)', OX, 'i'],
    [r'\bрабѡ(?=въ)', OX, 'i'],
    [r'\bрабе(?=хъ)', OX, 'i'],
    [r'\bраввꙋні\b', VA, 'i'],

    # ра́ди
    [r'\bра(?=ди\b)', OX, 'i'],
    # ра́дость ра́дꙋйсѧ ра́дꙋйтесь ра́достїю
    [r'ра(?=д(ост[еиінь]|ова|ꙋй(сѧ|тес[ьѧ])))', OX, 'i'],
    [r'ра(?=звѣ)', OX, 'i'],

    [r'разрѣш[аеи]\B', OX, 'i'],
    [r'разрѣш[иꙋ]\b', VA, 'i'],

    [r'\bра(?=зꙋм[аꙋъ]\b)', OX, 'i'],
    [r'\bра(?=зꙋмомъ\b)', OX, 'i'],
    [r'разꙋмѣ(?=[ейлнстхшюѧ])', OX, 'i'],
    [r'разꙋмѣ(?=вш)', OX, 'i'],
    [r'разꙋмѣва', OX, 'i'],
    [r'вразꙋмл[еѧ]', OX, 'i'],

    [r'\bра(?=й)', OX, 'i'],
    [r'\bра[юѧ]\b', VA, 'i'],

    [r'\bра(?=н[аеꙋы]\b)', OX, 'i'],
    [r'\bра(?=на\B)', OX, 'i'],

    [r'распина', OX, 'i'],
    [r'распѧ(?=та\B)', OX, 'i'],
    [r'распѧ(?=т[иіосы]\B)', OX, 'i'],
    [r'распѧ(?=[всш]\B)', OX, 'i'],

    [r'\bревн[иꙋ]', OX, 'i'],
    [r'ревнова\B', OX, 'i'],
    [r'ревнова\b', VA, 'i'],
    [r'ре(?=внос)', OX, 'i'],

    [r'пререка', OX, 'i'],
    # ре́клъ
    [r'(?<!мѧ)ре(?=кл?ъ)', OX, 'i'],
    [r'\bре(?=кш)', OX, 'i'],
    [r'\bреко(?=[мсхш])', OX, 'i'],
    [r'\bре(?=къ\b)', OX, 'i'],
    [r'\bрѣка\b', VA, 'i'],
    # рѣ́чь
    [r'\bрѣ(?=ч[иь]\b)', OX, 'i'],
    [r'\bрѣча(?=м[иъ]\b)', OX, 'i'],

    # речѐ рещи
    [r'рече\b', VA, 'i'],
    [r'рече(?=н)', OX, 'i'],
    [r'рещи\b', VA, 'i'],
    [r'рещ[иеш]\B', OX, 'i'],

    # рцы̀ прорцы̀ жерцы
    [r'\b(на)?рцы\b', VA, 'i'],
    [r'\b((пр|тв)о)?рцы\b', VA, 'i'],
    [r'\b(бо|же)?рцы\b', VA, 'i'],
    # рцы́те
    [r'рцы\B', OX, 'i'],

    # ро́дъ ро́дꙋ
    [r'\bро(?=д[аеѣиꙋъ]\b)', OX, 'i'],
    [r'(?<![юу])роди(?=[вмстхш])', OX, 'i'],
    [r'''
     (без|все(на)?|єдино|земно|ино|кꙋпно|на|начало|перво|при|свѣто)ро(?=дн)
     ''', OX, 'i'],
    [r'\bродств[аѣꙋ]\b', VA, 'i'],

    [r'\bражда\B', OX, 'i'],
    [r'\bро(?=ждш)', OX, 'i'],
    [r'\bрожде(?=[йн])', OX, 'i'],
    [r'\bрожде(?=ствен)', OX, 'i'],
    [r'\bрождеств[аоеѣꙋ]\b', VA, 'i'],

    [r'\bри(?=з([аеоꙋы]))', OX, 'i'],

    [r'\bрос[аеѣ]\b', VA, 'i'],
    [r'\bро(?=сꙋ)', OX, 'i'],
    [r'\bросо(?=[йю])', OX, 'i'],
    [r'\bросо(да|но)', OX, 'i'],

    # рѡссі́ѧ
    [r'рѡссі(?!ѧн)', OX, 'i'],
    # рꙋ́сскїй
    [r'рꙋ(?=с(ск|ь))', OX, 'i'],
    [r'\bрꙋси\b', VA, 'i'],

    [r'рыда\B', OX, 'i'],
    [r'рыда\b', VA, 'i'],

    [r'рꙋ(?=къ)', OX, 'i'],
    # [r'рꙋ(?=це)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ссс sss

    [r'саваѡ(?=ѳ)', OX, 'i'],

    [r'\bса(?=мъ)', OX, 'i'],
    [r'\bсама\b', VA, 'i'],

    # свѣ́тъ свѣ́тлый свѣ́та свѣ́телъ
    [r'''
        # ! (свѣтисѧ свѣтлейш. 
        # свѣтозарн. свѣтоподат.
        # свѣтоносн. свѣтѧщійсѧ)
        \b
        (пре)?
        свѣ
        (?!
            т(
                и(?!т) 
                |л(
                    а\b
                    |[еѣ][ей]
                    #|о\B
                  ) 
                |о[дзлнп]
                |ѧ\B
              )
        )
        (?=т)
        ''', OX, 'i'],

    # свѣти́сѧ свѣти́льникъ свѣти́ло
    [r'(про|ѡ)свѣти\b', VA, 'i'],
    [r'(про|ѡ)свѣти\B', OX, 'i'],
    [r'(много|небо|снѣго|три)свѣ(?=т)', OX, 'i'],

    [r'свѣти(?=л[оь]|сѧ)', OX, 'i'],
    [r'свѣтода(?=в)', OX, 'i'],
    [r'свѣтоза(?=рн)', OX, 'i'],
    [r'свѣтоли(?=т)', OX, 'i'],
    [r'свѣтоно(?=с)', OX, 'i'],
    [r'свѣтопода(?=т)', OX, 'i'],
    # свѣтлѣ́е свѣтлѣ́йшꙋю
    [r'свѣтлѣ(?=[ей])', OX, 'i'],
    [r'свѣщ[аеиѣꙋь]\b', VA, 'i'],
    [r'свѣще(?!н[оѡ])\B', OX, 'i'],
    [r'свѣщен[оѡ]\B', OX, 'i'],
    [r'свѣ(?=щ[нш])', OX, 'i'],

    [r'свирѣ(?=л)', OX, 'i'],

    [r'свое(ѧ|г[оѡ]|мꙋ)\b', VA, 'i'],
    [r'сво[еиюѧ]\b', VA, 'i'],
    [r'свое(?=[йю]\b)', OX, 'i'],
    [r'сво(?=й\b)', OX, 'i'],
    [r'свое(?=мъ\b)', OX, 'i'],
    [r'\bсвои(?=[мх])', OX, 'i'],

    [r'\bсвы(?=ш(ш?е|н))', OX, 'i'],

    # свѧ́тъ свѧ́те
    [r'(?<![оѻѡ])свѧ(?=т[аеѣиоѡꙋъы]\b)', OX, 'i'],
    [r'(по|[ѻѡ])свѧти\b', VA, 'i'],
    # свѧта́ѧ свѧте́й свѧтꙋ́ю свѧты́ѧ свѧти́тель
    [r'свѧт[аеѣіиꙋы]\B', OX, 'i'],

    # свѧто́е
    [r'свѧто(?=[ейм])', OX, 'i'],

    # свѧще́нникъ свѧще́нїе ѻ҆свѧще́нный
    [r'''
        свѧще
        (?=
            нн?
            (
                [аиіеѣꙋы]\B
                # ! свѧщеннолѣп- свѧщеннотайн-
                |о(?![дилт]|мон)
            )
        )
        ''', OX, 'i'],

    # посвѧща̀ти
    [r'свѧща\B', OX, 'i'],
    [r'свѧщꙋ\b', VA, 'i'],

    # себе
    [r'\bсеб[еѣє]\b', VA, 'i'],

    [r'сѣ(?=вер)', OX, 'i'],

    # сего̀
    [r'\bсего\b', VA, 'i'],
    # се́й
    [r'\bсе(?=й\b)', OX, 'i'],
    # сеѧ̀ сїѐ
    [r'\bс(еѧ|іе)\b', VA, 'i'],
    # сі́и
    [r'\bсі(?=и\b)', OX, 'i'],

    [r'сѣда(?=л(е|ь)н)', OX, 'i'],

    [r'седми(?=[цч])', OX, 'i'],

    [r'селе(?=ні)', OX, 'i'],

    [r'\bсе(?=мъ\b)', OX, 'i'],
    [r'\bсемꙋ\b', VA, 'i'],

    # сѣ́мо
    [r'\bсѣ(?=мо\b)', OX, 'i'],
    # сѣ́нь
    [r'''
        сѣ(?=н
            (?!
                (
                н?[оѡ](вн|писан)
                |ен
                |[иѧ]
                )
            )
        )
        ''', OX, 'i'],

    [r'серафі(?=м)', OX, 'i'],
    [r'се(?=рг)', OX, 'i'],

    [r'се(?=рдц([ꙋы]|[ѣе](мъ)?)\b)', OX, 'i'],
    [r'сердцевѣ(?=дч)', OX, 'i'],
    # [r'сердца\b', VA, 'i'],  # от числа.
    [r'сердца(?=[мх])', OX, 'i'],

    # сѣ́ть
    [r'\bсѣ(?=т)', OX, 'i'],

    [r'си(?=л([аеѣꙋы]|ою)\b)', OX, 'i'],
    [r'сілꙋа(?=н)', OX, 'i'],
    [r'\bсіѡ(?=н[аеѣоѡꙋъѧ]\b)', OX, 'i'],
    [r'си(?=рѣчь)', OX, 'i'],

    [r'\bси(?=р[аꙋы])', OX, 'i'],
    [r'\bсирот[аеѣꙋы]\b', VA, 'i'],
    [r'\bсиро(?=тств)', OX, 'i'],

    [r'\bси(?=хъ\b)', OX, 'i'],
    # си́це сицева́го сицевы́ѧ сицева̀
    [r'\bси(?=це\b)', OX, 'i'],
    [r'\bсиц[еє]в[аіоꙋы]\B', OX, 'i'],
    [r'\bсиц[еє]в[аоꙋы]\b', VA, 'i'],

    # сїѐ сїѧ̀ сїю̀
    [r'\bсі[еюѧ]\b', VA, 'i'],
    # сїѧ́нїе
    [r'\b(про)?сіѧ\B', OX, 'i'],

    # скажѝ ска́жꙋтъ скажꙋ̀ скажи́те
    [r'\bскаж[иꙋ]\b', VA, 'i'],
    [r'\bскажи(?=те\b)', OX, 'i'],
    [r'\bска(?=ж[еꙋ]\B)', OX, 'i'],

    [r'\bсквозѣ\b', VA, 'i'],

    [r'ски(?=тъ\b)', OX, 'i'],
    [r'скит[аеѣꙋы]\b', VA, 'i'],
    [r'скита\B', OX, 'i'],
    [r'скито\B(?!н)', OX, 'i'],

    [r'\bсконча\b', VA, 'i'],
    [r'\bсконча(?!ва)\B', OX, 'i'],
    [r'\bскончава', OX, 'i'],

    [r'\bско(?=рб(е[мхн]|н|и\b|ію|ь(?!ми)))', OX, 'i'],
    [r'\bскорбѣ(?=[влнт])', OX, 'i'],
    [r'\bскорбе(?=й)', OX, 'i'],
    [r'скорби\B', OX, 'i'],
    [r'\Bскорби\b', VA, 'i'],
    [r'\bскорбьми\b', VA, 'i'],
    [r'\bскорблю\b', VA, 'i'],
    # скорбѧ́щемъ
    [r'\bскорбѧ(?=[мщ])', OX, 'i'],

    [r'\bско(?=рѡ)', OX, 'i'],

    [r'сладча(?=йш)', OX, 'i'],

    # славле́нїе
    [r'славл[еѧ](?!нн)', OX, 'i'],
    # славосло́вїе
    [r'славосло(?=в(?!ень))', OX, 'i'],
    # сла́ва сла́внаѧ (! славле́н- славосло́в- славян-)
    [r'сла(?=в(?!ослов|л[еѧ]|ѧн))', OX, 'i'],
    # славослове́ньми
    [r'славослове(?=нь)', OX, 'i'],

    [r'сла(?=дост(?!раст|ьми))', OX, 'i'],
    [r'сла(?=дк[аіиꙋ])', OX, 'i'],
    [r'сла(?=дко\b)', OX, 'i'],

    # слѣ́д ! слѣда̀ слѣда́м- слѣдѧщ
    [r'слѣ(?=д(?!а\b|а[мх]|[иы]\b|ѧщ|[оѡ]въ))', OX, 'i'],
    [r'слѣда(?=[мх])', OX, 'i'],

    # сле́зъ слеза̀ слеза́ми слезѧ́щи прослези́шасѧ
    [r'слез[аѧ]\b', VA, 'i'],
    [r'сле(?=з(ъ|н[аоꙋы]))', OX, 'i'],
    [r'слеза(?=[мх])', OX, 'i'],
    [r'слезо(?=[йю])', OX, 'i'],
    [r'слезѧ(?=тхщ)', OX, 'i'],
    [r'слези(?=[хш])', OX, 'i'],

    [r'ѡслѣ(?=пш)', OX, 'i'],
    [r'слѣп[оы](?=й)', OX, 'i'],
    [r'слѣп[аіы]\B', OX, 'i'],

    [r'словес[аеиы]\b', VA, 'i'],
    [r'словесе(?=[мх])', OX, 'i'],
    [r'слове(?=съ\b)', OX, 'i'],
    [r'слове(?=сн)', OX, 'i'],
    [r'\bсло(?=в[еѣиоꙋьыъѧ]\b)', OX, 'i'],
    [r'сло(?=вомъ\b)', OX, 'i'],

    [r'слꙋже\B', OX, 'i'],
    [r'слꙋж[аиꙋѧ]\b', VA, 'i'],
    [r'слꙋжа\B(?!тъ)', OX, 'i'],
    [r'слꙋ(?=жатъ)', OX, 'i'],
    [r'слꙋжи\B(?!т[еъ]|мъ|ши)', OX, 'i'],
    [r'слꙋ(?=жи([мт]ъ|ши))', OX, 'i'],
    [r'слꙋ(?=жите(?!л))', OX, 'i'],
    [r'слꙋжи(?=тел)', OX, 'i'],
    [r'слꙋжѧ(?=й)', OX, 'i'],

    [r'\bслꙋ(?=ша)', OX, 'i'],
    [r'\B(?<!вы)слꙋша(?=[ншюѧ]\B)', OX, 'i'],
    [r'\Bслꙋша(?=е(мь|те))', OX, 'i'],
    [r'\Bслꙋ(?=ша(?!е(мь|те)|[ншюѧ]))', OX, 'i'],
    [r'слꙋшли(?=в)', OX, 'i'],
    [r'\Bслꙋ(?=ше?н)', OX, 'i'],
    [r'слы(?=ш)', OX, 'i'],

    # смире́нїе смире́нно
    [r'смире(?=н(і|н(?!омꙋд)))', OX, 'i'],
    # смиренномꙋ́дрый
    [r'смиренномꙋ(?=д)', OX, 'i'],

    [r'смоле(?=нск)', OX, 'i'],

    [r'смотрели(?=в)', OX, 'i'],
    [r'смотре(?=н)', OX, 'i'],

    # снѣ́гъ снѣ́жный
    [r'снѣ(?!г(а[мх]|осв|ꙋ)|жат)(?=[гж])', OX, 'i'],

    [r'собо(?=рнѣй)', OX, 'i'],
    [r'собо(?=ю)', OX, 'i'],

    [r'соверш[аи]\B', OX, 'i'],
    [r'соверш[аиꙋ]\b', VA, 'i'],
    [r'соверше(?=нн(?!о(мꙋд|нач|сод|тв)))', OX, 'i'],
    [r'соверше(?=ні)', OX, 'i'],
    [r'соверше(?=ни\b)', OX, 'i'],

    [r'согрѣ(?=всѧ|[ейстхюѧ]|ш(а\b|ш))', OX, 'i'],
    [r'согрѣва', OX, 'i'],

    [r'созда\b', VA, 'i'],
    [r'созда(?=тел\B)', OX, 'i'],
    [r'созда(?=в(?!а))', OX, 'i'],
    [r'создава\B', OX, 'i'],
    [r'создала\b', VA, 'i'],
    [r'созда(?=л(?!а\b))', OX, 'i'],
    [r'создана\b', VA, 'i'],
    [r'созда(?=н[ін])', OX, 'i'],
    [r'созда(?=[стхш])', OX, 'i'],

    [r'созерца\B', OX, 'i'],

    [r'сокрове(?=н(?!нота))', OX, 'i'],
    [r'сокро(?=ви(?!щехр))', OX, 'i'],

    # сокрꙋше́нїе сокрꙋшѝ сокрꙋши́въ
    [r'сокрꙋш[ае]', OX, 'i'],
    [r'сокрꙋш[иꙋ]\b', VA, 'i'],
    [r'сокрꙋши\B', OX, 'i'],
    [r'сокрꙋ(?=ш[шьъ])', OX, 'i'],

    [r'со(?=лнц(?!ев|зр|[оѻѡ]б|св))', OX, 'i'],
    [r'со(?=лнеч)', OX, 'i'],

    [r'соѡбра(?=зе?н)', OX, 'i'],
    [r'соѡбразꙋ\B', OX, 'i'],

    [r'софрѡ(?=н)', OX, 'i'],

    # спа́съ спа́слъ спа́совъ спа́се спасе́нїе спасѝ спаси́тель спасо́шасѧ спаса́ти спасе́нъ спаса́ющїй
    [r'спас[иꙋ]\b', VA, 'i'],
    [r'спа(?=с([аеѣ]|л?ъ|овъ)\b)', OX, 'i'],
    [r'спас[аеи]\B', OX, 'i'],
    [r'спасо(?!въ)\B', OX, 'i'],
    [r'спасти(?=с)', OX, 'i'],

    [r'сподо(?=би)', OX, 'i'],
    [r'сподо(?=бл[ью])', OX, 'i'],
    [r'сподоблѧ\B', OX, 'i'],

    [r'сра(?=м[аꙋъ]\b)', OX, 'i'],
    [r'\bсра(?=мл?енъ\b)', OX, 'i'],
    [r'([Оᲂ]у|по)срами\B', OX, 'i'],
    [r'([Оᲂ]у|по)срами\b', VA, 'i'],
    [r'([Оᲂ]у|(не)?по)сра(?=млен(?!і))', OX, 'i'],
    [r'посрамле(?=ні)', OX, 'i'],
    [r'срамлѧ\B', OX, 'i'],
    [r'сра(?=мн\B)', OX, 'i'],
    [r'срамот(?=[аѣꙋы]\b)', VA, 'i'],

    [r'срѣ(?=тен)', OX, 'i'],

    [r'сро(?=дн)', OX, 'i'],

    [r'\bста(?=д[оꙋъѣ]\b)', OX, 'i'],

    [r'\bста(?=рецъ)', OX, 'i'],
    [r'\bста(?=риц\B)', OX, 'i'],
    [r'\bста(?=р[чцш])', OX, 'i'],

    # стена́нїе стена́ньми
    [r'стена(?=н[іь])', OX, 'i'],
    [r'стенѧ(?=[йщ])', OX, 'i'],
    [r'стенѧ\b', VA, 'i'],
    # стѣна̀
    [r'стѣн[аеѣо]\b', VA, 'i'],
    [r'стѣ(?=нꙋ\b)', OX, 'i'],
    # стѣно́ю
    [r'стѣно(?=ю)', OX, 'i'],

    [r'\bстіхи\b', VA, 'i'],
    [r'\bсті(?=хъ)', OX, 'i'],
    [r'\bстіхи(?=р)', OX, 'i'],
    [r'\bстіхо(?=внѣ)', OX, 'i'],

    [r'\bсто(?=лп[енъ])', OX, 'i'],
    [r'\bстолп[аѣиꙋ]\b', VA, 'i'],
    [r'\bстолпа\B', OX, 'i'],

    [r'\bсто(?=ны)', OX, 'i'],

    [r'\bстоѧ\B', OX, 'i'],
    [r'\bстоѧ\b', VA, 'i'],

    # стра́ждꙋщїй стра́ждетъ
    [r'стра(?=жд(ꙋщ|е))', OX, 'i'],

    [r'страда(?=[влнстхш])', OX, 'i'],

    # простра́нное стра́нный
    [r'стра(?=нн(?!о[влнѡпꙋѧ]))', OX, 'i'],

    # стра́хъ стра́шный стра́се
    [r'стра(?=(х(?!ован)|ше?н(?!і)|с[еѣ]))', OX, 'i'],

    # стра́сть стра́сти
    [r'стра(?=ст([иь]|но))', OX, 'i'],
    # страсте́мъ страстѧ́хъ
    [r'страст[еѧ](?=[ймх])', OX, 'i'],
    # страстна́ѧ
    [r'\bстрастн[аоꙋ](?=[ейюѧ])', OX, 'i'],
    # страстоте́рпецъ
    [r'страстоте(?=рп)', OX, 'i'],

    [r'стрꙋѧ\B', OX, 'i'],
    [r'стрꙋ[иѧ]\b', VA, 'i'],

    [r'стꙋ(?=дн)', OX, 'i'],
    [r'стꙋдо(?=м)', OX, 'i'],
    [r'стꙋд[аѣꙋ]\b', VA, 'i'],

    # стѧжа̀ стѧжа́ти стѧжава́ти
    [r'\bстѧжа\b', VA, 'i'],
    [r'\bстѧжа(?!ва)\B', OX, 'i'],
    [r'\bстѧжава\B', OX, 'i'],

    [r'сꙋбб[оѡ](?=т)', OX, 'i'],

    [r'сꙋгꙋ(?=б(?!л))', OX, 'i'],
    [r'сꙋ(?=ть)', OX, 'i'],

    [r'сꙋди\b', VA, 'i'],
    [r'сꙋди(?=влмсхщ)', OX, 'i'],
    [r'сꙋди(?=ти)', OX, 'i'],
    [r'сꙋди(?=т[еє]ль)', OX, 'i'],
    [r'сꙋ(?=дит(ъ|сѧ))', OX, 'i'],
    [r'сꙋди(?=ша)', OX, 'i'],
    [r'сꙋ(?=диши)', OX, 'i'],

    [r'\bсꙋ(?=шꙋ)', OX, 'i'],

    [r'\bсꙋще(?=ствен\B)', OX, 'i'],
    [r'сꙋществ[иꙋ]\B', OX, 'i'],
    [r'сꙋществ[иꙋ]\b', VA, 'i'],
    [r'\bсꙋществ[оа]\b', VA, 'i'],
    [r'сꙋществова\B', OX, 'i'],
    [r'сꙋщество(?=м\B)', OX, 'i'],
    [r'сꙋ(?=щ[аиꙋеѣ]\b)', OX, 'i'],
    [r'сꙋ(?=щ[аіиыꙋн]\B)', OX, 'i'],

    # сы́нъ сыны̀ сы́номъ сы́не сыно́внїй сыново́мъ сыно́въ
    [r'\bсыны\b', VA, 'i'],
    [r'\bсы(?=н([аеѣꙋъ]|омъ)\b)', OX, 'i'],
    [r'\bсын[оѡ](?=в[нъ])', OX, 'i'],
    [r'\bсыново(?=м)', OX, 'i'],
    [r'\bсына(?=м[иъ])', OX, 'i'],

    [r'\bсы(?=й\b)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ттт ttt

    [r'\bта(?=же\b)', OX, 'i'],
    [r'\bта(?=ѧ(жд?е)?\b)', OX, 'i'],
    [r'\bтꙋ(?=ю(же)?)', OX, 'i'],
    [r'\bты(?=ѧ)', OX, 'i'],

    # та́йна та́йнѣмъ та́йнымъ та́йномꙋ
    [r'та(?=йн([аеѣꙋыъ]|ом[ꙋъ]))', OX, 'i'],
    [r'та(?=ин(ъ|ство))', OX, 'i'],
    [r'таи(?=нни)', OX, 'i'],
    [r'та(?=йн[оѡ]\b)', OX, 'i'],
    [r'тайнови(?=де?[цч])', OX, 'i'],
    [r'тайноводи(?=[лмт])', OX, 'i'],
    [r'тайново(?=дств)', OX, 'i'],
    [r'тайново(?=диш)', OX, 'i'],
    [r'тайновѣ(?=дѣн)', OX, 'i'],

    # та́къ та́коже та́кѡ та́кожде
    [r'\bта(?=к[ѡоъ](жд?е)?\b)', OX, 'i'],
    [r'\bтаков[аоы]\b', VA, 'i'],
    [r'\bтаков[аоы]\B', OX, 'i'],

    [r'та(?=мо\b)', OX, 'i'],

    [r'таѧ(?=щ)', OX, 'i'],

    [r'тва(?=р[иь])', OX, 'i'],

    [r'\bтвое\b', VA, 'i'],
    [r'\bтвое?ѧ\b', VA, 'i'],
    [r'\bтвою\b', VA, 'i'],
    [r'\bтвое(мꙋ|г[оѡ])\b', VA, 'i'],
    [r'\bтвое(?=[йю]|мъ)', OX, 'i'],
    [r'\bтвои\b', VA, 'i'],
    [r'\bтвои(?=хъ)', OX, 'i'],
    [r'\bтвои(?=м[иъ])', OX, 'i'],
    [r'\bтво(?=й)', OX, 'i'],

    [r'творе(?=н)', OX, 'i'],
    [r'твори\b', VA, 'i'],
    [r'твори\B', OX, 'i'],
    [r'тво(?=рч\B)', OX, 'i'],
    [r'творѧ\B', OX, 'i'],
    [r'твор[юѧ]\b', VA, 'i'],
    [r'\bтворц[аеѣꙋы]\b', VA, 'i'],
    [r'\Bтво(?=рц[аеѣꙋы]\b)', OX, 'i'],
    [r'\bтворц[еоѡ]\B', OX, 'i'],
    [r'\Bтво(?=рц[еоѡ]\B)', OX, 'i'],
    [r'\bтворе(?=ц)', OX, 'i'],
    [r'\Bтво(?=рец)', OX, 'i'],

    [r'\bтеб[еѣ]\b', VA, 'i'],

    [r'тек[аіиоꙋ]\B', OX, 'i'],
    [r'те(?=кл(?![аи]\b))', OX, 'i'],
    [r'текл[аи]\b', VA, 'i'],
    [r'те(?=кш)', OX, 'i'],

    [r'те(?=чь)', OX, 'i'],
    [r'(?<!пред)теч[ае]\b', VA, 'i'],
    [r'(?<!пред)теча\B', OX, 'i'],
    [r'(?<!пред)тече\B(?!с[кт]|[вю])', OX, 'i'],

    [r'теце(?=мъ\b)', OX, 'i'],
    [r'стеце(?=мсѧ\b)', OX, 'i'],
    [r'(вос|по|при)?тецы\b', VA, 'i'],
    [r'(вос|по|при|с)?тецы(?=т)', OX, 'i'],

    # тѣ́ло тѣ́лꙋ
    [r'\bтѣ(?=л\w\b)', OX, 'i'],
    # тѣле́сн-
    [r'\bтѣле(?=с[нъ])', OX, 'i'],
    # тѣлесѝ
    [r'\bтѣлес[еи]\b', VA, 'i'],
    [r'\bтѣлесе(?=[мх])', OX, 'i'],

    [r'\bтѣ(?=мже)', OX, 'i'],
    [r'\bтѣ(?=ми\b)', OX, 'i'],

    [r'\bте(?=мн[аꙋы]\B)', OX, 'i'],
    [r'\bтемна\b', VA, 'i'],
    [r'\bте(?=мн[иоꙋ]\b)', OX, 'i'],
    [r'\bтемн[еи]\B', OX, 'i'],
    [r'\bте(?=мно[ймсю])', OX, 'i'],

    # тепло̀
    [r'\bтепло\b', VA, 'i'],
    # те́плый те́плой
    [r'\bте(?=пл([аыꙋ]|[еѣ](?!йш)|о(?!хл|т|\b)))', OX, 'i'],
    [r'\bтепл[еѣ](?=йш)', OX, 'i'],
    # теплота̀
    [r'\bтеплот[аеѣоꙋы]\b', VA, 'i'],
    # теплото́ю
    [r'\bтеплото\B', OX, 'i'],
    # теплохла́дный
    [r'\bтеплохла(?=дн)', OX, 'i'],

    [r'\bте(?=рні)', OX, 'i'],
    [r'\bтерни(?=ст)', OX, 'i'],

    # терпѣ̀  терпѧ̀
    [r'терп[ѣиѧ]\b', VA, 'i'],
    # терпѣ́нїе
    [r'терпѣ\B(?!лив|ва)', OX, 'i'],
    # терпѣли́вый
    [r'терпѣли(?!во(д|мꙋд|нос|стра))(?=в)', OX, 'i'],
    # претерпѣва́ющи
    [r'терпѣва', OX, 'i'],

    [r'\bті(?=и\b)', OX, 'i'],
    # ти́хїй ( ! тихообразно )
    [r'\bти(?=х(?!(а\b|о[ѻѡг])))', OX, 'i'],
    [r'\bтиха\b', VA, 'i'],
    [r'\bтишин[аѣоꙋы]\b', VA, 'i'],
    [r'\bтишино(?=ю)', OX, 'i'],
    [r'\bпрети(?=х)', OX, 'i'],

    # тлѣ́нъ тлѣ́нїе нетлѣ́нный тлѣ́ть
    [r'тлѣ(?=н[інъ]|т[иь])', OX, 'i'],
    # тлѝ  ! свѣ́тли  ᲂу҆ч҃тли
    [r'(?<!вѣ|уч)тли\b', VA, 'i'],
    # тобо́ю
    [r'\bтобо(?=ю)', OX, 'i'],
    [r'\bтогда\b', VA, 'i'],
    [r'\bтого\b', VA, 'i'],
    [r'то(?=йже\b)', OX, 'i'],
    [r'\bто(?=й\b)', OX, 'i'],
    # то́кмѡ
    [r'то(?=кмѡ)', OX, 'i'],
    [r'толи(?=к)', OX, 'i'],
    [r'топа(?=зі)', OX, 'i'],

    [r'торжеств[аоꙋ]\B', OX, 'i'],
    [r'торжеств[аеѣоꙋ]\b', VA, 'i'],

    [r'тоск[аиѣꙋ]\b', VA, 'i'],
    [r'тоско(?=[йю])', OX, 'i'],

    [r'то(?=чію)', OX, 'i'],

    [r'\bтоѧ\b', VA, 'i'],

    [r'\bтрезве(?=ні)', OX, 'i'],
    [r'трезви\B', OX, 'i'],
    [r'\bтрезвѧ\B', OX, 'i'],
    [r'\bтре(?=звен[нꙋъ])', OX, 'i'],

    # Тро́ица
    [r'\bтро(?=[ий][цч])', OX, 'i'],

    # тропа́рь
    [r'\bтропа(?=рь)', OX, 'i'],
    [r'\bтропар[еѣиѧ]\B', OX, 'i'],
    [r'\bтропар[еѣиюѧ]\b', VA, 'i'],

    [r'трꙋжда', OX, 'i'],

    [r'\bтꙋ(?=не\b)', OX, 'i'],

    [r'\bтщ[аи]\b', VA, 'i'],
    [r'тща(?!ли)', OX, 'i'],
    [r'тще(?=тн)', OX, 'i'],
    [r'тщесла(?=в)', OX, 'i'],
    [r'тщети(?=в)', OX, 'i'],
    [r'тщи\B', OX, 'i'],

    # тьма̀ тьмѣ̀
    [r'\bтьм[аѣꙋы]\b', VA, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ууу uuu

    # ᲂу҆́бѡ
    # [r'^[Оᲂ]у(?=бѡ\b)', IS, 'i'],
    [r'^[Оᲂ]у(?=бѡ\b)', IS, 'i'],
    [r'^[Оᲂ]у(?=бо\b)',      GAP, 'i'],
    [r'^[Оᲂ]убо(?=[гз])', OX, 'i'],
    # ᲂу҆вы̀
    [r'^[Оᲂ]увы\b', VA, 'i'],
    [r'^[Оᲂ]угаси(?=ти)', OX, 'i'],
    [r'^[Оᲂ]угаси\b', VA, 'i'],
    [r'^[Оᲂ]у(?=гл)', IS, 'i'],
    [r'^[Оᲂ]угото(?=в(?!лѧ))', OX, 'i'],

    [r'^[Оᲂ]удѣ(?=л\B)', OX, 'i'],
    # ᲂу҆́дъ ᲂу҆́ды
    [r'^[Оᲂ]у(?=д[ыъ]\b)', IS, 'i'],

    [r'^[Оᲂ]у(?=жас[аъꙋ]\b)', IS, 'i'],
    [r'^[Оᲂ]у(?=жасо[мв]ъ\b)', IS, 'i'],
    [r'^[Оᲂ]у(?=жасам[иъ]\b)', IS, 'i'],
    [r'^[Оᲂ]у(?=жасехъ\b)', IS, 'i'],
    [r'^[Оᲂ]ужасе(?=сѧ\b)', OX, 'i'],
    [r'^[Оᲂ]ужаси\b', VA, 'i'],
    [r'^[Оᲂ]ужаси\B', OX, 'i'],
    [r'^[Оᲂ]ужасо(?=[схш])', OX, 'i'],

    [r'^[Оᲂ]уже\b', VA, 'i'],
    # ᲂу҆́зримъ
    [r'^[Оᲂ]у(?=зри([мт]ъ|тсѧ|иш|ѧтъ|ю)\b)', IS, 'i'],

    # )
    # JustForTest = (

    # ᲂу҆зрѣ
    [r'^[Оᲂ]узрѣ\b', VA, 'i'],
    # ᲂу҆зрѣша
    [r'^[Оᲂ]узрѣ\B', OX, 'i'],

    # ᲂу҆́зы
    [r'^[Оᲂ]у(?=з[ыъ]\b)', IS, 'i'],
    [r'^[Оᲂ]украша\B', OX, 'i'],

    # ᲂу҆крепле́нїе ᲂу҆крѣплѧ́ше
    [r'^[Оᲂ]укрѣпл[еѧ]', OX, 'i'],
    [r'^[Оᲂ]укрѣпи\B', OX, 'i'],
    [r'^[Оᲂ]укрѣпи\b', VA, 'i'],

    # ᲂу҆миле́нїе ᲂу҆миле́нный
    [r'^[Оᲂ]умиле(?=н)', OX, 'i'],
    [r'^[Оᲂ]уми(?=льн)', OX, 'i'],
    [r'^[Оᲂ]умира\B', OX, 'i'],
    [r'^[Оᲂ]умири\b', VA, 'i'],
    # ᲂу҆́мъ ᲂу҆́мный ᲂу҆́мно ᲂу҆́ме
    [r'''
        ^[Оᲂ]у
        (?=
            м
            (
                [ъеѣ]\b # ᲂу҆́м ᲂу҆́ме
                |н
                (?!
                    [еѣ] # ! ᲂумнѣй-
                    |о(ж|госꙋгꙋб) # ! ᲂумножая
                )
            )
        )
        ''', IS, 'i'],
    [r'мꙋжеꙋ(?=мн)', OX, 'i'],

    # ᲂу҆мы̀ ᲂу҆мꙋ̀
    [r'^[Оᲂ]ум[аꙋы]\b', VA, 'i'],

    # ᲂу҆мно́жить ᲂу҆мно́жꙋ
    [r'(\bпреꙋ|^[Оᲂ]у)мно(?=ж[иꙋ])', OX, 'i'],
    # ᲂу҆множа́ти
    [r'(\bпреꙋ|^[Оᲂ]у)множа(?=\w)', OX, 'i'],
    [r'(\bпреꙋ|^[Оᲂ]у)множе(?=ні)', OX, 'i'],

    [r'^[Оᲂ]униже(?=ні)', OX, 'i'],
    [r'^[Оᲂ]уни(?=женн)', OX, 'i'],

    [r'^[Оᲂ]уны\b', VA, 'i'],
    [r'^[Оᲂ]уны(?=[лн]|вш)', OX, 'i'],
    [r'^[Оᲂ]уныва\B', OX, 'i'],

    [r'^[Оᲂ]упас[иꙋ]\b', VA, 'i'],
    [r'^[Оᲂ]упова\b', VA, 'i'],
    [r'^[Оᲂ]упова\B', OX, 'i'],
    [r'^[Оᲂ]уподо(?=б(?!лѧ))', OX, 'i'],
    [r'^[Оᲂ]управлѧ\B', OX, 'i'],

    [r'^[Оᲂ]усе(?=рд)', OX, 'i'],
    # ᲂу҆слы́ши слы́шати
    [r'^[Оᲂ]у?слы(?=ш)', OX, 'i'],
    [r'^[Оᲂ]успе(?=ні)', OX, 'i'],

    # ᲂу҆ста̀ ᲂу҆сты̀ ᲂу҆стнѐ ᲂу҆ста́хъ ᲂу҆ста́ми ᲂу҆сте́нъ ᲂу҆сте́хъ
    [r'^[Оᲂ]устн?[аеы]\b', VA, 'i'],
    [r'^[Оᲂ]устн?а(?=[мх])', OX, 'i'],
    [r'^[Оᲂ]усте(?=[нх])', OX, 'i'],
    [r'^[Оᲂ]у(?=стъ)', IS, 'i'],

    # ᲂу҆твердѝ
    [r'^[Оᲂ]утверди\b', VA, 'i'],
    # ᲂу҆тверди́ша
    [r'^[Оᲂ]утверди\B', OX, 'i'],

    # ᲂу҆твержде́нный
    [r'^[Оᲂ]утвержде(?=н)', OX, 'i'],
    # ᲂу҆твержда́еши
    [r'^[Оᲂ]утвержда(?=\w)', OX, 'i'],
    [r'^[Оᲂ]утверже(?=ні)', OX, 'i'],

    # ᲂу҆тѣ́ха
    [r'^[Оᲂ]утѣ(?=х\w\b)', OX, 'i'],
    # ᲂу҆тѣше́нїе
    [r'^[Оᲂ]утѣше(?=ні)', OX, 'i'],
    # ᲂу҆тѣ́ши ᲂу҆тѣ́шꙋ ᲂу҆тѣ́шитель ᲂу҆тѣ́шивъ
    [r'''
        ^[Оᲂ]утѣ
        (?=
            ш
            (
                ([иꙋ]|енъ)\b
                |и
                (
                    тел
                    # (?!ьн) #? !ᲂу҆тѣши́тельный
                    |в
                ) 
            )
        )
        ''', OX, 'i'],

    # ᲂу҆тѣша́ти
    [r'^[Оᲂ]утѣша(?!тсѧ)\B', OX, 'i'],
    [r'^[Оᲂ]утѣ(?=ш(атсѧ|и(тъ)?)\b)', OX, 'i'],
    # ᲂу҆тѣши́тельный ???
    # [r'^[Оᲂ]утѣши(?=тельн)', OX, 'i'],

    [r'^[Оᲂ]утоли\b', VA, 'i'],
    [r'^[Оᲂ]утоли\B', OX, 'i'],
    [r'^[Оᲂ]утолѧ\B', OX, 'i'],
    [r'^[Оᲂ]у(?=тренн)', IS, 'i'],
    [r'^[Оᲂ]у(?=тро(?![бийю]))', IS, 'i'],
    [r'^[Оᲂ]утро(?=б)', OX, 'i'],

    [r'^[Оᲂ]учени(?=къ)', OX, 'i'],
    [r'^[Оᲂ]ученик[аи]\b', VA, 'i'],
    [r'^[Оᲂ]ученик[аоѡ]\B', OX, 'i'],

    [r'^[Оᲂ]учи(?=т)', OX, 'i'],

    [r'^[Оᲂ]уѧзви\b', VA, 'i'],
    [r'^[Оᲂ]уѧзви\B', OX, 'i'],
    [r'^[Оᲂ]уѧ(?=зв[еє])', OX, 'i'],
    [r'^[Оᲂ]уѧ(?=звль)', OX, 'i'],
    [r'^[Оᲂ]уѧзвлѧ', OX, 'i'],

    # ᲂу҆́хо ᲂу҆́ши
    [r'^[Оᲂ]у(?=[хш][оиы]\b)', IS, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ффф fff

    [r'ѳавѡ(?=р)', OX, 'i'],

    [r'фарісе', OX, 'i'],
    [r'\bѳѵміа', OX, 'i'],
    [r'\bѳѡм[аеѣоꙋы]\b', VA, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ххх hhh

    [r'херꙋві(?=м)', OX, 'i'],
    [r'\bхвали(?=т[ни])', OX, 'i'],
    [r'\bхвали(?=т[ие])', OX, 'i'],

    # хода́тай
    [r'хода(?=т)', OX, 'i'],

    [r'ходи(?=ша)', OX, 'i'],
    # хор хорови
    [r'\bхо(?=р([ъаꙋеѣ]|о(мъ|ви))\b)', OX, 'i'],
    [r'хлѣ(?=б)', OX, 'i'],

    [r'ход[иѧ]\b', VA, 'i'],
    [r'ходи(?=[вл])', OX, 'i'],
    [r'хо(?=ди[мт]ъ)', OX, 'i'],
    [r'ходи(?=ти)', OX, 'i'],
    [r'\bходи(?=c)', OX, 'i'],
    [r'ходи(?=х)', OX, 'i'],
    [r'ходи(?=ша)', OX, 'i'],
    [r'хо(?=диши)', OX, 'i'],
    [r'ходѧ(?=[йхщ])', OX, 'i'],
    [r'хо(?=дѧтъ)', OX, 'i'],
    [r'хо(?=д[ыѣъ]\b)', OX, 'i'],

    [r'хожд[аеє]\B', OX, 'i'],
    [r'хо(?=ждш)', OX, 'i'],
    [r'хождꙋ\b', VA, 'i'],

    [r'хот[ѣѧ]\B', OX, 'i'],
    [r'\bхот[ѣѧ]\b', VA, 'i'],
    [r'хощꙋ\b', VA, 'i'],
    [r'хо(?=щ[еꙋ]\B)', OX, 'i'],

    # храм
    [r'хра(?=м)', OX, 'i'],
    # хранѝ сохрани́хомъ
    [r'(со)?хран[июѧ]\b', VA, 'i'],
    [r'(со)?хран[еиюѧ]\B', OX, 'i'],

    # хрїсто́съ
    [r'хр(іс)?то(?=[вмс])', OX, 'i'],
    [r'хр(іс)?тіа(?=нс)', OX, 'i'],
    [r'хр(іс)?тіа(?=н[еѣаъы])', OX, 'i'],
    # хрїста̀
    [r'хр(іс)?т[аеѣꙋ]\b', VA, 'i'],

    [r'хꙋл[аеѣꙋы]\b', VA, 'i'],
    [r'хꙋле(?=н)', OX, 'i'],
    [r'хꙋли(?=тел)', OX, 'i'],
    [r'хꙋло(?=ю)', OX, 'i'],
    [r'хꙋ(?=л(ьн|ѧщ|ивш|итс))', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ццц ссс

    # ца́рь ца́рскїй
    [r'ца(?=р([сь]))', OX, 'i'],
    # царю̀
    [r'цар[иеѣюѧ]\b', VA, 'i'],
    # царе́ви
    [r'цар[еє]\B', OX, 'i'],
    # цари́ца
    [r'цари(?=ц)', OX, 'i'],

    # цвѣ́тъ цвѣ́те цвѣ́лъ цвѣ́томъ
    [r'''
        цвѣ
        (?=
            (
                т(
                  [еѣꙋиъ]
                  |омъ
                )
            )\b
            |лъ
        )
        ''', OX, 'i'],
    [r'цвѣт[аеы]\B', OX, 'i'],
    [r'цвѣ(?=тш)', OX, 'i'],

    [r'всецѣ(?=л)', OX, 'i'],
    [r'\bцѣ(?=лаѧ)', OX, 'i'],
    [r'цѣл[ѣи]\b', VA, 'i'],
    [r'цѣл[еєѣ](?!ва)\B', OX, 'i'],
    [r'цѣл[еѣ]ва\B', OX, 'i'],
    [r'цѣли\B', OX, 'i'],
    [r'цѣ(?=ло[ею]\b)', OX, 'i'],

    [r'цѣлова\B', OX, 'i'],
    [r'цѣ(?=лꙋ\b)', OX, 'i'],
    [r'\bцѣлꙋ\B', OX, 'i'],
    [r'\bцѣлꙋ\B', OX, 'i'],

    [r'цѣ(?=лы)', OX, 'i'],
    [r'цѣл[юѧ]\B', OX, 'i'],
    [r'цѣльб[аеѣꙋы]\b', VA, 'i'],
    [r'цѣльба\B', OX, 'i'],
    [r'цѣльбо\B(?![нп][оѡ])', OX, 'i'],
    [r'цѣльбо[нп][оѡ]', OX, 'i'],
    [r'цѣ(?=льн)', OX, 'i'],

    [r'цѣ(?=нн)', OX, 'i'],

    # це́рковь це́ркви
    [r'це(?=рк(в(?!([аѧ]м|ей))|овь))', OX, 'i'],
    # церква́ми церквѧ́ми
    [r'церкв[аѧ](?=м)', OX, 'i'],
    # церкве́й
    [r'церкве(?=й)', OX, 'i'],
    # церко́вный
    [r'церко(?=вн(?!ослав))', OX, 'i'],
    [r'церковнославѧ(?=нск)', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ччч

    [r'\bча(?=д(?!о[лрт]))', OX, 'i'],
    [r'\bчадолюби(?=в)', OX, 'i'],
    [r'\bча(?=съ\b)', OX, 'i'],
    [r'\bча(?=ш)', OX, 'i'],
    # ча́ѧше
    [r'\bѿ?ча(?=[еюѧ])', OX, 'i'],
    # человѣ́къ
    [r'человѣ(?=ч|к(?!олюб))', OX, 'i'],
    # человѣколю́бный
    [r'человѣколю(?=б)', OX, 'i'],

    [r'честно(?=мꙋ)', OX, 'i'],
    [r'честн[аꙋы]\B', OX, 'i'],
    [r'честна\b', VA, 'i'],
    [r'честно(?!с[тл])\B', OX, 'i'],
    [r'честнѣ(?=йш|мъ)', OX, 'i'],
    [r'че(?=сть)', OX, 'i'],

    [r'чинѡ(?=въ)', OX, 'i'],

    # чи́стый чи́стꙋю чи́стей чи́стилъ
    [r'(?<!мра)чи(?=ст(?!от|[еѣ]йш|илищ|итель))', OX, 'i'],
    # чистота̀
    [r'чистот[аеѣꙋы]\b', VA, 'i'],
    # чистото́ю
    [r'чистото(?=ю)', OX, 'i'],
    # чисте́йшаѧ
    [r'чист[еѣ](?=йш)', OX, 'i'],
    # ѡ҆чисти́тельный
    [r'чисти(?=тель)', OX, 'i'],
    [r'чре(?=в[аеѣоꙋ]\b)', OX, 'i'],
    [r'чре(?=вомъ\b)', OX, 'i'],

    [r'чте(?=цъ|ні)', OX, 'i'],
    [r'чтец[аѣꙋы]\b', VA, 'i'],

    [r'чти(?=[лмтш])', OX, 'i'],
    [r'чтꙋ\B', OX, 'i'],
    [r'(?<!при)чтꙋ\b', VA, 'i'],

    [r'\b(во|ни|по)?что\b', VA, 'i'],
    # чꙋ́домъ чꙋ́до
    [r'чꙋ(?=дн(?!ѣйш))', OX, 'i'],
    [r'чꙋ(?=до(мъ)?\b)', OX, 'i'],
    # чꙋдесѐ чꙋдесы̀ чꙋдесе́хъ чꙋдеса́ми
    [r'чꙋдес[аеиы]\b', VA, 'i'],
    [r'чꙋдес[аеє](?=[мх][иъ])', OX, 'i'],
    [r'чꙋде(?=с[нъ])', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # шшш

    [r'(?<!мона)ше(?=ств[еіоꙋ])', OX, 'i'],
    [r'ше(?=д[шъы])', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # щщщ

    [r'ще(?=др[еи])', OX, 'i'],
    [r'ще(?=дро\b)', OX, 'i'],
    [r'щедро(?=т(?!ода))', OX, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # ююю

    # !!! убрано для различия форм мн.ч. с апострофом
    # [r'\bю(?=же\b)', IS, 'i'],

    # ю҆нѣ́йшїй
    [r'\bюнѣ(?=йш)', OX, 'i'],
    # ю҆́ность
    [r'\bю(?!н([еєѣ]|ц([аы]|[еєѡ]))|род)', IS, 'i'],
    # ю҆нцы̀
    [r'\bюнц[аеѣꙋы]\b', VA, 'i'],

    # @@@@@@@@@@@@@@@@@@@@@@@@@@
    # яяя

    [r'\bꙗви\b', VA, 'i'],
    [r'\bꙗви\B', OX, 'i'],
    # ꙗ҆́вѣ
    [r'\bꙗ(?=вѣ\b)', IS, 'i'],
    # [r'\bꙗ(?=влен([оъ]|н[еѣ]))', IS, 'i'],
    # ꙗ҆́вно ꙗ҆́вственно ꙗ҆́вльсѧ
    [r'\bꙗ(?=в(ль|ст|н))', IS, 'i'],
    [r'\bꙗвле(?=й)', OX, 'i'],
    [r'\bꙗвле(?=ні)', OX, 'i'],
    # ꙗ҆́вленнымъ ꙗ҆́вленнѣ
    [r'\bꙗвле(?=нн(?!ымъ|ѣ\b))', OX, 'i'],
    [r'\bꙗвл[юѧ]\B', OX, 'i'],
    [r'\bꙗвлю\b', VA, 'i'],
    [r'ѧвл[еєѧ]', OX, 'i'],

    [r'\bꙗ(?=дш)', IS, 'i'],

    [r'\bꙗ(?=звл?ен)', IS, 'i'],
    [r'\bꙗ(?=зв[аоѣыꙋъ])', IS, 'i'],
    [r'\bꙗзви(?=ш)', OX, 'i'],
    [r'ѧзви\B', OX, 'i'],
    [r'ѧзви\b', VA, 'i'],
    [r'ѧзвлѧ\B', OX, 'i'],
    [r'ѧ(?=звль)', OX, 'i'],
    [r'ѧ(?=зв[еє]\B)', OX, 'i'],
    [r'ѧзвѧ(?=тс)', OX, 'i'],
    [r'ѧ(?=звѧтъ)', OX, 'i'],

    [r'\b[ꙗѧ]зы(?=к[аиꙋъ])', OX, 'i'],
    [r'\bꙗзы(?=ч)', OX, 'i'],
    [r'\b[ꙗѧ]зы(?=к[оѡ][мв]ъ)', OX, 'i'],
    [r'\bꙗ(?=р[оѡ]ст)', IS, 'i'],
    [r'\bꙗ(?=коже\b)', IS, 'i'],
    # !!! убрано для различия форм мн.ч. с апострофом
    # [r'\bꙗже\b)', IS, 'i'],
    [r'\bꙗ(?=кѡ\b)', IS, 'i'],

    # ПРЕДЛОГИ + ерок
    [r'\b(из|над|ѡб|под)ъ\b', ER, 'i'],
    [r'\b(пр(?P<remove>е)д)ъ\b', ER, 'i'],

    # Суффиксы, окончания и т.д. с ударением
    [r'(?<!мн[оѡ]ж)а(?=йш)', OX, 'i'],
    # -лѧющ-
    [r'лѧ(?=ющ)', OX, 'i'],
    # полага́хꙋ
    [r'[гжмнрстхцчщ]а(?=хꙋ)', OX, 'i'],
    # ѡ҆бнища́хомъ
    [r'[жзнрсчщ]а(?=хомъ)', OX, 'i'],

    # -ѣ́вш-
    [r'(?<![бв]ид|вѣд|рѣп|лат)ѣ(?=вш)', OX],

    # [r'', r''],
    # [r'', r''],

    # months
    [r'септе(?=мвріа)', OX, 'i'],
    [r'ктѡ(?=вріа)', OX, 'i'],
    [r'ное(?=мвріа)', OX, 'i'],
    [r'деке(?=мвріа)', OX, 'i'],
    [r'іаннꙋа(?=ріа)', OX, 'i'],
    [r'еврꙋа(?=ріа)', OX, 'i'],
    [r'ма(?=рта)', OX, 'i'],
    [r'апрі(?=ліа)', OX, 'i'],
    [r'\bма(?=іа)', OX, 'i'],
    [r'іꙋ(?=[лн]іа)', OX, 'i'],
    [r'а(?=ѵгꙋста)', IS, 'i'],
)

# Выставить титла
'''
Для некоторых случаев необходимо точно указать букву под ударением,
чтобы при ее удалении "под титло", удалилось и само ударение
эта буква захватывается в regex-группу (?P<remove>  )
например (упрощенно):
[r'д(?P<remove> ѣ )в(?=а)', r'дв' + titlo]
 
'''
regs_titles_set = (
    [r'(?<!ѵ)(а)нге(?=л)', r'\1гг' + titlo, 'i'],
    [r'(ап)(?P<remove>о)сто(?=л)', r'\1' + titlo_s, 'i'],
    [r'(бл)а(г)ода(?=т)', r'\1\2' + titlo_d, 'i'],
    [r'(бл)а(г)осло(?=в)', r'\1\2' + titlo_s, 'i'],
    [r'(бл)(?P<remove>а)(?=[гж])', r'\1' + titlo, 'i'],
    [r'''
        \b
        (б)о(г)
        (?=
            [аеꙋъ]\b
            |а\B(?![тщ])
            |о(?!родиц|хꙋл|мерз) # ???
        )
        ''', r'\1\2' + titlo, 'i'],

    [r'(б)огороди(ц)', r'\1\2' + titlo_d, 'i'],
    [r'''
        \b
        (б)о(ж)
        (?=і|е(ств|\b))
        ''', r'\1\2' + titlo, 'i'],

    [r'\b(б)о(з)(?=ѣ)', r'\1\2' + titlo, 'i'],
    [r'(вл)ады(?=[кчц])', r'\1' + titlo_d, 'i'],
    [r'(воскр)е(?=с\w\b)', r'\1' + titlo, 'i'],
    [r'(воскр)(?P<remove>е)се?(?=\w\B)', r'\1' + titlo_s, 'i'],
    [r'\b(гл)аг(?P<remove>о)л', r'\1' + titlo, 'i'],
    [r'\b(гла)съ', r'\1' + titlo_s, 'i'],
    [r'\b(г)оспо(д)', r'\1\2' + titlo_s, 'i'],
    [r'\b(г)ос(п)о(?=ж)', r'\1\2' + titlo_s, 'i'],

    [r'\b(д)а(в)и(?=д)', r'\1\2' + titlo, 'i'],

    # дѣва
    [r'''
        \b
        ( (?:присно)? д )  # N1
        (?P<remove> # <- указание удалить ударение N2
            ѣ
        )
        (в)  # N3 
        (?=[аеѣиоꙋы])
        ''',
     r'\1\3' + titlo, 'i'],

    [r'(д)ѣ(в)с(?=тв)', r'\1\2' + titlo_s, 'i'],
    [r'\b(д)е(н)(?=ь)', r'\1\2' + titlo, 'i'],
    [r'\b(дн)е(?=сь)', r'\1' + titlo, 'i'],
    [r'\b(д)ꙋ(х)', r'\1\2' + titlo, 'i'],

    # !!! два титла
    [r'''
        \b
        (б)о?(г)
        (о?д)ꙋ(х)''',
     r'\1\2' + titlo + r'\3\4' + titlo, 'i'],

    [r'\b(д)ꙋ(ш)', r'\1\2' + titlo, 'i'],
    [r'\b(д)ꙋ(с)(?=[еѣ]\b)', r'\1\2' + titlo, 'i'],
    [r'\b(єѵ)анге(?=л)', r'\1' + titlo_g, 'i'],
    [r'\b(за)чало\b', r'\1' + titlo_ch, 'i'],
    [r'(іер)ꙋса(?=л)', r'\1' + titlo_s, 'i'],
    [r'(і)зра(и)(?=л)', r'\1\2' + titlo, 'i'],
    [r'(іи)сꙋ(?=с)', r'\1' + titlo, 'i'],
    [r'(им)ѧ(?=рек)', r'\1' + titlo, 'i'],
    [r'\b(кр)ес(?=т)', r'\1' + titlo_s, 'i'],
    [r'\b(м)а(р)(?=(і[аеѣиюѧ]))', r'\1\2' + titlo, 'i'],

    # ма́терь ма́ти
    [r'''
        \b
        (?P<prefix>
            (?:
                б(?:г҃|ог)о
                |д(?:ѣв|в҃)о
            )?
        )   
        (?P<m>м)а(?P<t>т)
        (?=
            и
            |ер
        )
        ''', r'\g<prefix>\g<m>\g<t>' + titlo, 'i'],
    [r'(м)ѣсѧ(ц)(?=ъ)', r'\1\2' + titlo_s, 'i'],
    [r'(м)и(л)осе(?=рд)', r'\1\2' + titlo_s, 'i'],
    [r'(м)и(л)ос(?=т)', r'\1\2' + titlo_s, 'i'],
    # [r'(м)оли(?=тв)', r'\1л' + titlo, 'i'],
    [r'(м)о(л)и(?=тв)', r'\1\2' + titlo, 'i'],
    [r'(м)ꙋд(?=р)', r'\1' + titlo_d, 'i'],
    [r'(м)ꙋ(ч)е(?=ни[кчц])', r'\1\2' + titlo, 'i'],
    [r'(мл)аде(?=не?[чц])', r'\1' + titlo_d, 'i'],
    [r'\b(н)е(б)(?=\w\b)', r'\1\2' + titlo, 'i'],
    [r'\b(н)е(б)ес(?=н)', r'\1\2' + titlo_s, 'i'],
    [r'\b(н)едѣ(л)', r'\1\2' + titlo_d, 'i'],
    [r'(н)ы(н)(?=ѣ)', r'\1\2' + titlo, 'i'],
    [r'(ѻ)те?(ц)', r'\1\2' + titlo, 'i'],  # @@@ вариат.
    [r'(ѻ)те?(ч)(?!ест|а(ѧн|йш))', r'\1\2' + titlo, 'i'],  # @@@ вариат.
    [r'(пр)а(в)ед(?=е?н)', r'\1\2' + titlo_d, 'i'],
    [r'(пр)е(п)одо(?=б(е?н))', r'\1\2' + titlo_d, 'i'],
    [r'(пр)ед(?=теч)', r'\1' + titlo_d, 'i'],
    [r'(пр)ес(?=тол)', r'\1' + titlo_s, 'i'],
    [r'(пр)ис(?=нѡ\b)', r'\1' + titlo_s, 'i'],
    [r'(пр)о(?=ро[кч])', r'\1' + titlo_o, 'i'],
    [r'(р)о(ж)дес(?=тв)', r'\1\2' + titlo_s, 'i'],
    [r'(с)вѧ([тщ])', r'\1\2' + titlo, 'i'],
    [r'(с)е(р)де?(?=[цч])', r'\1\2' + titlo_d, 'i'],
    # FIXME: смр҃ть (??? вариант см҃рть)
    [r'(см)е(?=рт)', r'\1' + titlo, 'i'],
    [r'(сп)а(?=с)', r'\1' + titlo, 'i'],

    # страсть
    # [r'''
    #     (?<!ладо)
    #     (стр)
    #     (?P<remove>
    #         а
    #     )
    #     с(?=т)
    #     ''', r'\1' + titlo_s, 'i'],

    [r'(с)ы(н)(?=[аеєѣоѡꙋъ])', r'\1\2' + titlo, 'i'],  # @@@ вариант.
    [r'(тр)ои(?=[цч])', r'\1' + titlo_o, 'i'],
    [r'(^[Оᲂ]уч)е(?=ник)', r'\1' + titlo, 'i'],
    [r'(?<!нт[иі])(хр)іс(?=т)', r'\1' + titlo_s, 'i'],
    [r'(ч)е(л)о(?=вѣ[кч])', r'\1\2' + titlo, 'i'],
    [r'(ч)ес(?=тн)', r'\1' + titlo_s, 'i'],
    [r'(?<!мра)(ч)ис(?=т)', r'\1' + titlo_s, 'i'],
    [r'(ц)а(р)с', r'\1\2' + titlo_s, 'i'],
    [r'(ц)а(р)(?=\w)', r'\1\2' + titlo, 'i'],
    [r'(ц)е(р)(?=к)', r'\1\2' + titlo, 'i'],
)

# Раскрыть титла
# TODO: если все буквы - прописные
# убрать 'i', ввести ([Аа])
# написать правила для прописных букв
regs_titles_open = (
    [r'(а)гг' + titlo, r'\1нге', 'i'],
    # А҆пⷭ҇лъ А҆пⷭ҇толъ
    [r'(а)п' + titlo_s + r'(то)?', r'\1посто', 'i'],
    [r'(б)л' + titlo + r'([гж])', r'\1ла\2', 'i'],
    [r'(б)лг' + titlo_d, r'\1лагода', 'i'],
    [r'(б)лг' + titlo_s, r'\1лагосло', 'i'],
    [r'(б)([гжз])' + titlo, r'\1о\2', 'i'],
    [r'(б)ж' + titlo_s, r'\1ожес', 'i'],
    [r'(б)ц' + titlo_d, r'\1огородиц', 'i'],
    [r'(в)л' + titlo_d + r'чц', r'\1ладычиц', 'i'],
    [r'(в)л' + titlo_d, r'\1лады', 'i'],
    [r'(воск)р' + titlo_s + r'(?=ні)', r'\1ресе', 'i'],
    [r'(воск)р' + titlo_s + r'(?=[ншы])', r'\1рес', 'i'],
    [r'(воск)р' + titlo + r'(?=с)', r'\1ре', 'i'],
    [r'\b(г)л' + titlo, r'\1лагол', 'i'],
    [r'\b(г)ла' + titlo_s, r'\1ласъ', 'i'],
    [r'\b(г)д' + titlo_s + r'нь', r'\1осподень', 'i'],
    [r'\b(г)д' + titlo_s, r'\1оспод', 'i'],
    [r'\b(г)п' + titlo_s + r'ж', r'\1оспож', 'i'],
    [r'\b(д)в' + titlo + r'д', r'\1авид', 'i'],
    [r'\b((?:присно)?д)в' + titlo + r'(?=[аеѣиоꙋы])', r'\1ѣв', 'i'],
    [r'(д)в' + titlo_s + r'(?=тв)', r'\1ѣвс', 'i'],
    [r'\b(д)н' + titlo + r'(?=ь)', r'\1ен', 'i'],
    [r'\b(д)н' + titlo + r'(?=сь)', r'\1не', 'i'],
    [r'(д)х' + titlo, r'\1ꙋх', 'i'],
    [r'\b(д)ш' + titlo, r'\1ꙋш', 'i'],
    [r'\b(д)с' + titlo + r'(?=[еѣ]\b)', r'\1ꙋс', 'i'],
    [r'\b([Еє][ѵв])' + titlo_g + r'(?=л)', r'\1анге', 'i'],
    [r'\b(з)а' + titlo_ch, r'\1ач.', 'i'],
    [r'(і)ер' + titlo_s + r'(?=л)', r'\1ерꙋса', 'i'],
    [r'(і)и' + titlo + r'(?=л)', r'\1зраи', 'i'],
    [r'(і)и' + titlo + r'(?=с)', r'\1исꙋ', 'i'],
    [r'(и)м' + titlo + r'(?=рек)', r'\1мѧ', 'i'],
    [r'(к)н' + titlo + r'(?=[зж])', r'\1нѧ', 'i'],
    [r'\b(к)р' + titlo_s + r'(?=т)', r'\1рес', 'i'],
    [r'\b(м)р' + titlo + r'(?=(і[аеѣиюѧ]))', r'\1ар', 'i'],
    [r'(м)т' + titlo + r'(?=и|ер)', r'\1ат', 'i'],
    [r'(м)т' + titlo + r'(?=р)', r'\1ате', 'i'],
    [r'(м)ц' + titlo_s + r'(?=[аеоꙋъы])', r'\1ѣсѧц', 'i'],
    [r'(м)л' + titlo_d + r'(?=не?[чц])', r'\1ладе', 'i'],
    [r'(м)л' + titlo_s + r'(?=рд)', r'\1илосе', 'i'],
    [r'(м)л' + titlo_s + r'(?=т)', r'\1илос', 'i'],
    [r'(м)л' + titlo + r'(?=тв)', r'\1оли', 'i'],
    [r'м' + titlo_d + r'(?=р)', r'мꙋд', 'i'],
    [r'(м)ч' + titlo + r'нк', r'\1ꙋченик', 'i'],
    [r'(м)ч' + titlo + r'(?=н)', r'\1ꙋче', 'i'],

    [r'\b(н)б' + titlo + r'(?=с[аеиъ]([мх]ъ)?\b)', r'\1ебе', 'i'],
    [r'\b(н)б' + titlo + r'(?=съ\b)', r'\1ебе', 'i'],
    [r'\b(н)б' + titlo + r'(?=\w\b)', r'\1еб', 'i'],
    [r'\b(н)б' + titlo_s + r'(?=н)', r'\1ебес', 'i'],

    [r'\b(н)л' + titlo_d, r'\1едѣл', 'i'],
    [r'(н)н' + titlo + r'(?=ѣ)', r'\1ын', 'i'],
    [r'(ѻ)ц' + titlo + r'(?=ъ)', r'\1тец', 'i'],
    [r'(ѻ)ц' + titlo + r'(?=[аеєѣоꙋы])', r'\1тц', 'i'],
    [r'(ѻ)ч' + titlo + r'(?=ес|н)', r'\1теч', 'i'],  #
    [r'(ѻ)ч' + titlo, r'\1тч', 'i'],  #
    [r'(п)рв' + titlo_d + r'(?=е?н)', r'\1равед', 'i'],
    [r'(п)рп' + titlo_d + r'(?=б(е?н))', r'\1реподо', 'i'],
    [r'(п)р' + titlo_d + r'(?=теч)', r'\1ред', 'i'],
    [r'(п)р' + titlo_s + r'(?=тол)', r'\1рес', 'i'],
    [r'(п)р' + titlo_s + r'(?=нѡ\b)', r'\1рис', 'i'],
    [r'(п)р' + titlo_s + r'нодв' + titlo, r'\1риснодѣв', 'i'],
    [r'(п)р' + titlo_o + r'(?=р[оѡ][кчц])', r'\1ро', 'i'],
    [r'(р)ж' + titlo_s + r'(?=тв)', r'\1ождес', 'i'],
    [r'(с)([тщ])' + titlo, r'\1вѧ\2', 'i'],
    [r'(с)р' + titlo_d + r'(?=цъ\b|чн)', r'\1ерде', 'i'],
    [r'(с)р' + titlo_d + r'(?=ц)', r'\1ерд', 'i'],
    [r'(с)мр' + titlo + r'(?=т)', r'\1мер', 'i'],
    [r'(с)м' + titlo + r'(?=рт)', r'\1ме', 'i'],
    [r'(с)п' + titlo + r'(?=с)', r'\1па', 'i'],
    [r'(с)п' + titlo_s + r'(?=н)', r'\1пасе', 'i'],
    [r'(с)тр' + titlo_s + r'(?=т)', r'\1трас', 'i'],
    [r'(с)н' + titlo + r'(?=[аеєѣоꙋъ])', r'\1ын', 'i'],  # @@@ вариат.
    [r'(т)р' + titlo_o + r'(?=[цч])', r'\1рои', 'i'],
    [r'(^[Оᲂ]уч)' + titlo + r'(ни?)(?=[кц])', r'\1ени', 'i'],
    [r'(х)р' + titlo_s + r'(?=т)', r'\1рїс', 'i'],
    [r'(ч)л' + titlo + r'(?=вѣ[кцч])', r'\1ело', 'i'],
    [r'(ч)' + titlo_s + r'(?=тн)', r'\1ес', 'i'],
    [r'(ч)т' + titlo_s + r'(?=[нь])', r'\1ест', 'i'],
    [r'(ч)' + titlo_s + r'(?=т)', r'\1ис', 'i'],
    [r'(ц)р' + titlo_s, r'\1арс', 'i'],
    [r'(ц)р' + titlo + r'(?=\w\b)', r'\1ар', 'i'],
    [r'(ц)р' + titlo + r'(?=[еиѧ]\w)', r'\1ар', 'i'],
    [r'(ц)р' + titlo + r'(?=к)', r'\1ер', 'i'],
)

# TODO: стат. анализ словаря
regs_acutes_morph = (
    # при анализе словаря
    # https://www.ponomar.net/files/wordlist.tsv
    # можно выбрать буквосочетания
    # с ударениями а также определить исключения, если их немного
    # например для -лѧю[щт]- одно исключение
    # 5     1     лѧ̑ющ     лѧющ (и҆спра́влѧюще )
    # 130   0     лѧ́ют     лѧют
    # 593   1     лѧ́ющ     лѧющ (и҆спра́влѧюще )
    #
    # 1 ст. - кол-во совпадений в словаре
    # выбранного фрагмента (3-й ст.)
    # 2 ст. - кол-во совпадений в словаре
    # для выбранного фрагмента, но без ударения (4-й ст.)
    # в скобках - полное слово для совпадения
    # (одно, в данном случае общее для -лѧ̑ющ- и -лѧ́ющ-)
)
