# _*_ coding: utf-8

from Letters import *

# Наборы регулярных выражений вида:
# [find, replace [, flags] ]
# компилируются перед запуском основной функции

# Буквы в словах: ѿ, ѡ, ѵ, ѣ, etc

# OX = r'\1' + Oxia  #
# VA = r'\1' + Varia  #
# IS = r'\1' + Iso  #

VA = r'\g<0>' + Varia
OX = r'\g<0>' + Oxia
IS = r'\g<0>' + Iso
GKA = r'\g<0>' + Kamora
GAP = r'\g<0>' + Apostrof
ER = r'\1' + Erok
# GER = r'\g<0>' + Erok
# OX = OX
# VA = VA
# ZG = r'\g<0>'


regs_letters_in_word = (
    [  # ѿ
        r'''
        \bот
        (?!
            е?ц
            | е?ч(?!аѧн)
            | да[нт]
            | враща
            | врещи
            | в[еѣ][тщ]
            | жен
            | зд[еѣ]
            | иш
            #| крове # ѿкрове́нїе
            | расль
            | реб
            | ри\b
            | ро[кч]
                  
        )
        ''',
        r'ѿ'],  # или наоборот, перечислить ѿ ?

    [  # Ѿ
        r'''
        \bОт
        (?!
            е?ц
            | е?ч
            | да[нт]
            | враща
            | врещи
            | в[еѣ][тщ]
            | жен
            | зд[еѣ]
            | иш
            #| крове # ѿкрове́нїе
            | расль
            | реб
            | ри\b
            | ро[кч]
            
        )
        ''', r'Ѿ'],  # или наоборот, перечислить ѿ ?

    [r'\b(ѿ)ъ\b', r'\1', 'i'],

    [r'ейш', r'ѣйш'],


    [r'\bОу(?=[' + cu_cap_letters + r']+)', r'ОꙊ'],  # УМ -> ОꙊ҆МЪ
    [r'\bО\b', r'Ѽ'],  # как правило - обращение
    [r'\bо\b', r'ѡ'],
    [r'\bо', r'ѻ'],
    [r'\bО(?!у)', r'Ѻ'],

    [  # ᲂꙋ -> ᲂу (для исправления ошибок набора)
        # проблема: узкое о
        # на границе слова '\bᲂ' не работает
        # условно \b = не буквы (ноль или больше)
        # все не-буквы попадают в pref и post
        # и вырезаются (с сохранением) в начале,
        # поэтому можно (конкретно для этого случая) использовать
        # ^ - начало строки
        # Вариант:  cu_non_letter + '*' + unicNarrowO + '?ꙋ'
        r'^' + unicNarrowO + 'ꙋ', 'ᲂу'],


    [  # -ии- -> -їи-
        # TODO: -їѧ & -їа
        r'и(?=[аеєийоѡꙋюѧ])', r'ї'],

    [r'И(?=[АЕЄИЙОѠꙊЮѦаеєийоѡꙋюѧ])', r'І'],
    [r'ᲂ+', r'ᲂ'],

    # Zvatelce for first letter of word
    [r'^([АЄИІѴѠЮꙖаєиіѻѡюꙗ]|Ѻ(?!ꙋ))', r'\1' + Zvatelce],

    # Исправление ошибочного парсинга
    # слово начинается с прописной У
    # У -> Ꙋ -> Оу -> Ѻꙋ
    [r'Ѻꙋ', r'Оу'],

    # =========================
    [r'(а)кафист', r'\1каѳїст', 'i'],
    [r'(а)нти(?=х)', r'\1нтї', 'i'],
    [r'(а)ф(?=анас)', r'\1ѳ', 'i'],
    [r'(а)фо(?=н)', r'\1ѳѡ', 'i'],
    #
    [r'\b(б)ед(?=[аеносꙋъы])', r'\1ѣд', 'i'],

    # -бѣг- -бѣж-
    [r'''  
        (
            \b(?:
                из|при|ѿ|на
            )?
            |^ᲂу
        )
        бе
        (?=
            (
                г
                |ж(?!д) # ! убежден-
            )
            [аеилноꙋъ]
        )
        ''',
        r'\1бѣ'],

    [r'(безм)е(?=(р|ст)н)', r'\1ѣ', 'i'],

    [r'(\b|^[Оᲂ]у)бел', r'\1бѣл', 'i'],
    [r'\bбес(?=[аиноѡꙋы])', r'бѣс'],
    [r'\b(б)е\b', r'\1ѣ', 'i'],
    [r'\b(б)е(?=сте\b)', r'\1ѣ', 'i'],
    [r'\b(б)е(?=х(ом)?ъ\b)', r'\1ѣ', 'i'],
    [r'\b(б)е(?=ша\b)', r'\1ѣ', 'i'],
    [r'\b(бд)е(?=[нт])', r'\1ѣ', 'i'],
    [r'(благогов)е(?=й?н)', r'\1ѣ', 'i'],
    [r'(благодарн)о', r'\1ѡ', 'i'],
    [r'(благод)е(?=тел)', r'\1ѣ', 'i'],
    [r'(богов)е(?=ден)', r'\1ѣ', 'i'],
    [r'\b(боз)е\b', r'\1ѣ', 'i'],
    [r'(бол)е(?=зн)', r'\1ѣ', 'i'],

    # ========================
    #   вѣд вѣж вѣм вѣт вѣс вѣщ
    #   -вѣд-
    [r'''
        \b(не|из|(за|ис|про)?по)?
        вед
        (?=[аеиноыꙋь])
        ''',
        r'\1вѣд', 'i'],

    [r'\b((не)?в)ѣдені', r'\1ѣдѣнї', 'i'],
    #   -вѣж-
    [r'\b(не)?веж', r'\1вѣж'],

    #   -вѣм-
    [r'''
        \b((ис)?по)?
        вем
        (?=[ыъ])
        ''',
        r'\1вѣм'],

    #   -вѣс-
    [r'\b([Нн]е|[Сс]о|[Бб]лаго)?вес(?=и\b|т)', r'\1вѣс'],

    #   -вѣт-
    [r''' 
        \b([Зз]а|из|ѻт|ꙋ|на|со)
        вет
        (?=[ълнаеиоѡꙋы])
        ''',
        r'\1вѣт'],
    [r'веті(?=[иѧ])', r'вѣті'],

    #   -вѣщ-
    [r'''
        (?<!кле)
        вещ
        (?!
            # ! вещи, вещество
            (
                и
                |
                (
                    [еє]([ймх]|ств)
                    |ам[иъ]
                    |ь?ми
                )
            )
            # \b
        )
        ''',
     r'вѣщ'],
    # ---- вѣд вѣж вѣм вѣт вѣс вѣщ ----

    # ========================
    # вѣк- вѣц- вѣч-
    [r'\bвек(?=[аеиꙋъ](ми)?\b)', r'вѣк'],
    [r'\bвековъ', r'вѣкѡвъ'],
    [r'веце(хъ)?', r'вѣцѣ\1'],
    [r'веч(?=е?н)', r'вѣч'],
    # ------------------------

    [r'(?<!пер)(в)ен(?=е?[чц])', r'\1ѣн', 'i'],
    [r'(\b(не|[ѿвѕ]|благо)?в)ер(?=[аеиноꙋыѧ])', r'\1ѣр', 'i'],
    [r'ветв', r'вѣтв'],
    [r'вет(е?р)', r'вѣт\1'],

    [r'\b((?:нена)?в)идені', r'\1идѣнї', 'i'],
    [r'\b(в)ин(?=[аеоꙋ]\b|оград)', r'\1їн', 'i'],
    [r'\bвиссон', r'вѵ́ссон'],
    [r'([Вв])ладими(?=р)', r'\1ладимї'],
    [r'вменѧ', r'вмѣнѧ'],
    [r'возде(?=(ва)?ти|еши|ющ)', r'воздѣ'],
    [r'([Вв])осп[еѣ]ва', r'\1оспѣва'],
    [r'врач[ьъ]', r'врачь'],
    [r'\b([Вв])се(?=(м[иъ]|хъ)\b)', r'\1сѣ'],
    [r'втайне', r'втайнѣ'],

    [r'([Гг])ефсиман', r'\1еѳсїман'],
    [r'(([Гг])еѳсімані)ѧ', r'\g<1>а'],
    [r'(([Гг])еѳсіманійст)ей', r'\g<1>ѣй'],
    [r'([Гг])олгоф', r'\1олгоѳ'],

    [r'([Гг])нев', r'\1нѣв'],
    [r'горет', r'горѣт'],

    [r'([Гг])ресех', r'\1рѣсѣх'],
    [r'([Гг])ре(?=[схш])', r'\1рѣ'],

    [r'''
        \b
        (присно)?
        (д)ев
        (?=[аеоꙋы]|ств|ическ)
        ''',
        r'\1\2ѣв', 'i'],

    [r'\bдет(?!=инец)', r'дѣт'],
    [r'издетска', r'издѣтска'],
    [r'дел(?=[оаꙋ])', r'дѣл'],

    # дѣѧнїѧ ! ѳаддеѧ і҆ꙋдеѧ
    [r'(?<!дд|іꙋ)([Дд])еѧ', r'\1ѣѧ'],
    # дѣю ! надеждею і҆ꙋдею
    [r'(?<![аеꙋ]ж|іꙋ)([Дд])ею', r'\1ѣю'],

    [r'([Дд])иве(?=ев)', r'\1ивѣ'],
    [r'([Дд])ивно\b', r'\1ивнѡ'],
    [r'\bдне\b', r'днѣ'],
    [r'добродетел', r'добродѣтел'],
    [r'([Дд])околе', r'\1околѣ'],
    [r'([Дд])оселе', r'\1оселѣ'],
    [r'\b([Дд])ꙋсе\b', r'\1ꙋсѣ'],

    [r'(є)в(?=ангел)', r'\1ѵ'],
    [r'(є)в(?=фрафовъ)', r'\1ѵ'],
    [r'(є)вхарист', r'\1ѵхарїст'],
    [r'(є)го\b', r'\1гѡ'],  # Род: єгѡ Вин.: єго
    [r'(є)ги(?=пе?т)', r'\1гѵ'],  # Род: єгѡ Вин.: єго
    [r'(є)лисе(?=\w)', r'\1лиссе'],  # var: єлїссей

    [r'желез', r'желѣз'],

    [r'([Зз])авес', r'\1авѣс'],
    [r'Звезд', r'Ѕвѣзд'],
    [r'звезд', r'ѕвѣзд'],
    [r'звер(?!ж)', r'ѕвѣр'],
    [r'\b([Зз])де(?=(сь)?\b)', r'\1дѣ'],
    [r'\b([Гг])де\b', r'\1дѣ'],
    [r'зело', r'ѕѣлѡ'],

    [r'зельне', r'ѕѣльнѣ'],
    [r'зельн', r'ѕѣльн'],

    [r'зениц', r'зѣниц'],
    [r'(?<!же)зл(?=об)', r'ѕл'],
    [r'\bЗолъ\b', r'Ѕолъ'],
    [r'\bзолъ\b', r'ѕолъ'],
    [r'\b(?<!же)зл(?=[еѣіоꙋы]|а(?![зтцчщ]|га))', r'ѕл'],
    [r'зме(?=[йюѧ]\b|[еи]\w+)', r'ѕмѣ'],
    [r'(при)?зре(?=ти|ні|\b)', r'\1зрѣ'],

    [r'идеже', r'идѣже'],
    [r'И(?=зраил)', r'І'],
    [r'и(?=зраил)', r'і'],
    [r'изрѧдно', r'изрѧднѡ'],
    [r'\bикон', r'ікѡн'],
    [r'\bИкон', r'Ікѡн'],
    [r'икосъ', r'ікосъ'],
    [r'Икосъ', r'Ікосъ', 'i'],
    [r'\b([Ии])ме(?![нт])', r'\1мѣ'],
    [r'([Іі])о(?=ан|аким|в|на|сиф|ил|ота)', r'\1ѡ'],
    [r'([Іі])ордан', r'\1ѻрдан'],
    [r'Ирмос', r'Ірмос'],
    [r'ирмос', r'ірмос'],
    [r'иссоп', r'ѵссѡп'],
    [r'исцелен', r'исцѣлен'],

    [r'\b([Кк])ако\b', r'\1акѡ'],
    [r'([Кк])ано(?=н(?!ар))', r'\1анѡ'],
    [r'([Кк])оле(?=н)', r'\1олѣ'],
    [r'крепк', r'крѣпк'],
    [r'крѣпко', r'крѣпкѡ'],
    [r'([Кк])репост', r'\1рѣпост'],
    [r'([Кк])ꙋпел', r'\1ꙋпѣл'],

    # лепо боголепный великолѣ́пїе
    [r'''
        \b
        (
            (
                б
                (
                    (о|ла|л҃)г
                    |г҃
                )о
                |велико 
            )?
            л
        )
        еп(?=н?[иіоы])
        ''', r'\1ѣп', 'i'],

    [r'\bлес(?=[аъ])', r'лѣс'],
    [r'\bлестви(?=[чц])', r'лѣстви'],
    [r'\bлето', r'лѣто'],
    [r'\b(не|ѻб|раз)?лен(?=ь|ив|ост|ѧщ|ен)', r'\1лѣн'],
    [r'\b([Лл])итꙋрг', r'\1їтꙋрг'],
    [r'\b([Лл])иті', r'\1їтї'],

    [r'\b(из|от)?мер(?=[аеыꙋ]\b|ил)', r'\1мѣр'],
    [r'мест(?=[аеѣоꙋ]\b)', r'мѣст'],
    [r'\b([Мм])е(?=сѧц)', r'\1ѣ'],
    # всемїрный надмїрный
    [r'\b((все|над)м)и(?=рн)', r'\1ї', 'i'],
    [r'\b([Мм])и(?=хаил)', r'\1ї'],
    [r'\b(м)и(?=ро\b|ронос)', r'\1ѵ'],
    [r'\b([Мм])не\b', r'\1нѣ'],
    [r'\b((со)?[Мм])не(?=ти\b|ні)', r'\1нѣ'],
    [r'\b([Мм])оисе', r'\1ѡѷсе'],

    [r'надеѧ(?=ніе|тисѧ)', r'надѣѧ'],
    [r'надею(?=щі|с)', r'надѣю'],
    [r'намерен', r'намѣрен'],
    [r'([Нн])евест', r'\1евѣст'],
    [r'([Нн])егоже\b', r'\1егѡже'],

    # нѣгдѣ
    [r'\b([Нн])егде\b', r'\1ѣгдѣ'],

    [r'([Нн])едел', r'\1едѣл'],
    [r'недр', r'нѣдр'],
    [r'\b((?:все)?н)е(?=жн)', r'\1ѣ', 'i'],
    [r'([Нн])ѣжно', r'\1ѣжнѡ'],

    # нѣкто нѣкогда нѣкїй
    [r'\b([Нн])е(?=к(огда|то|ій)\b)', r'\1ѣ'],
    [r'\b([Нн])е(?=котор)', r'\1ѣ'],

    # нѣ́мы
    [r'\bне(?=м([аіоꙋы]\w|ы)\b)', r'нѣ'],
    [r'\bнераде(?=ні)', r'нерадѣ'],
    [r'\b([Нн])еси\b', r'\1ѣси'],
    [r'\b([Нн])есм(?=[ыь]\b)', r'\1ѣсм'],
    [r'\b([Нн])ест(?=[еь]\b)', r'\1ѣст'],
    [r'\b([Нн]епрестанн)о', r'\1ѡ'],
    # нїкола́й
    [r'([Нн])икол(?!иже)', r'\1їкол'],
    [r'([Нн])ыне', r'\1ынѣ'],

    # TODO:
    # ѻ в середине слова праѻтє́цъ
    [r'оо(?!рꙋж|тв|з)', r'оѻ'],

    [r'Ѻбаче', r'Ѡбаче'],
    [r'ѻбаче', r'ѡбаче'],
    [r'ѻбесити', r'ѡбѣсити'],
    [r'ѻбет', r'ѻбѣт'],
    [r'ѻбеща', r'ѻбѣща'],
    [r'ѻбле(?=[цч])', r'ѡбле'],
    [r'Ѻбнов', r'Ѡбнов'],
    [r'ѻбнов', r'ѡбнов'],
    [r'\bѺбож', r'Ѡбож'],
    [r'\bѻбож', r'ѡбож'],
    [r'Ѻбраз', r'Ѡбраз'],
    # [r'((?<!о)[ѻо])браз', r'ѡбраз'],
    # [r'(из)?[ѻо]браз', r'\1ѡбраз'],
    # [r'оѻбра([зжщ])', r'оѡбра\1'],
    [r'[ѻо]бра([зжщ])', r'ѡбра\1'],
    [r'ѻблекоша', r'ѡблекоша'],
    [r'ѻбре(?=[лст])', r'ѡбрѣ'],
    [r'ѻбрѧщ', r'ѡбрѧщ'],

    [r'ѻб(ы|ъи)м(?=[аеиꙋ])', r'ѡбъим'],
    [r'ѻб(ы|ъи)д(?=[еиоꙋ])', r'ѡбъид'],
    [r'ѻб(ы|ъи)ти', r'ѡбъити'],

    [r'ѻбъѧ(?=[вдлстхш])', r'ѡбъѧ'],
    [r'ѻбъем', r'ѡбъем'],
    [r'Ѻбъем', r'Ѡбъем'],

    [r'ѻде(?=ва[еюѧ]|ющ|ѧ)', r'ѡдѣ'],
    [r'ѻж(?=[ежир])', r'ѡж'],
    [r'Ѻзар(?=[еєиѧ])', r'Ѡзар'],
    [r'ѻзар(?=[еєиѧ])', r'ѡзар'],
    [r'ѻкропи', r'ѡкропи'],
    [r'Ѻкрест', r'Ѡкрест'],
    [r'ѻкрест', r'ѡкрест'],
    [r'Ѻмы(?=\w)', r'Ѡмы'],  # ѡ҆мы́й
    [r'ѻмы(?=\w)', r'ѡмы'],
    [r'ѻправд', r'ѡправд'],
    [r'Ѻсен', r'Ѡсѣн'],
    [r'ѻсен', r'ѡсѣн'],
    [r'Ѻстав', r'Ѡстав'],
    [r'ѻстав', r'ѡстав'],
    [r'ѻтчаѧн', r'ѿчаѧн'],
    [r'([Ѻѻ])тцевъ', r'\1тцєвъ'],
    [r'Ѻчи(?=сти|щ)', r'Ѡчи'],
    [r'ѻчи(?=сти|щ)', r'ѡчи'],

    [r'\b([Пп])е(ні|сн|ти|л)', r'\1ѣ\2'],

    [r'\b(в)сепе(?=т)', r'\1сепѣ', 'i'],
    [r'''  
        (
            [зн]а       # напѣвъ
            |ѿ          # ѿпѣванїе
            |пр[ио]     # припѣвъ
            |псалмо  
            |р[ао]с     # распѣвъ
            |с          # спѣлъ
        )
        пе([влт])       # пѣти
        ''', r'\1пѣ\2', 'i'],

    [r'([Пп])лач[ьъ]\b', r'\1лачь'],
    [r'\bплен', r'плѣн'],
    [r'побе(?=ж?д)', r'побѣ'],
    [r'([Пп])онедельник', r'\1онедѣльник'],
    [r'([Пп])осе(?=[тщ])', r'\1осѣ'],
    [r'([Пп])осле', r'\1ослѣ'],
    [r'пререкан', r'прерѣкан'],
    [r'прилеж(?=а|н)', r'прилѣж'],
    [r'присещ', r'присѣщ'],
    [r'([Пп])рисно\b', r'\1риснѡ'],
    [r'([Пп])роки(?=м)', r'\1рокї'],

    [r'Псал(?=о?м|т)', r'Ѱал'],
    [r'псал(?=о?м|т)', r'ѱал'],

    [r'([Рр])азве\b', r'\1азвѣ'],
    [r'реза', r'рѣза'],
    [r'(раз|ѿ)реш', r'\1рѣш', 'i'],
    # разумѣ-
    [r'разꙋме(?!нъ)', r'разꙋмѣ'],
    # рѣчь
    [r'\bреч(?=[иь]|ам[иъ]\b)', r'рѣч'],
    # рѣка
    [r'\bрек(?=[аеѣиоꙋ])', r'рѣк'],
    [r'([Рр])осс', r'\1ѡсс'],

    [r'([Сс])аваоф', r'\1аваѡѳ'],
    [r'([Сс])ветле(?=[ей])', r'\1вѣтлѣ'],
    [r'([Сс])ве(?=[тщ])', r'\1вѣ'],
    [r'([Сс])вире(?=л)', r'\1вирѣ'],
    [r'([Сс])вѧтемъ', r'\1вѧтѣмъ'],
    [r'семо', r'сѣмо'],
    [r'\bсен(?=[иіь])', r'сѣн'],
    [r'\bсено', r'сѣно'],
    [r'([Сс])ерафи', r'\1ерафі'],
    [r'''
        \b
        сет
        (?=([иь]|ію)\b|ѧм)
        ''', r'сѣт'],

    [r'([Сс])лаве', r'\1лавѣ'],
    [r'([Сс])лед', r'\1лѣд'],

    [r'''
        \bстен #
        (?!  # ! стенать
            а([нт][иіь]|ющ)
            |ѧ
        )
        ''', r'стѣн'],

    [r'\b([Сс])илꙋан', r'\1їлꙋан'],
    [r'\b([Сс])іон', r'\1їѡн'],
    [r'сиречь', r'сирѣчь'],

    [r'\b([Сс])корбе(?=ти|ні|л|вый)', r'\1корбѣ'],
    [r'\b([Сс])коро\b', r'\1корѡ'],

    [r'сне(?=[гж])', r'снѣ'],
    [r'совест', r'совѣст'],
    [r'([Сс])овет', r'\1овѣт'],
    [r'([Сс])огре', r'\1огрѣ'],
    [r'([Сс])офрон', r'\1офрѡн'],
    [r'([Сс])тихир', r'\1тїхир'],
    [r'([Сс])ыновъ', r'\1ынѡвъ'],

    [r'([Тт])ако\b', r'\1акѡ'],
    [r'тайнемъ', r'тайнѣмъ'],
    # [r'([Тт])ебе\b', r'\1ебѣ'],  # ? в Дат. Предложн
    [r'\b([Тт])ел(?=[аоꙋ]|е(с[аеин]|х)?)', r'\1ѣл'],
    [r'([Тт])емже', r'\1ѣмже'],
    [r'([Тт])епле', r'\1еплѣ'],
    [r'([Тт])ерпе', r'\1ерпѣ'],
    [r'\b([Тт])ехъ', r'\1ѣхъ'],
    [r'([Тт])ле(?=н[інъ]|т[иь])', r'\1лѣ'],
    [r'\bтьме\b', r'тьмѣ'],
    [r'\bтокмо\b', r'токмѡ'],

    # граница слова для ᲂу :
    # (\b - для `ᲂ' не работает)
    # (?<=\W)ᲂу
    # или (?<=(\W))?ᲂу - И для начала строки
    # или ^ᲂу - только для начала строки
    # (в *этом* модуле ᲂу всегда должен оказаться
    # в начале строки, т.к.
    # - обрабатывается отдельное слово
    # без предшествующих буквам символов)
    [r'^([Оᲂ]у)б[оѡ]\b', r'\1бѡ'],
    [r'^([Оᲂ]у)зре', r'\1зрѣ'],
    [r'^([Оᲂ]у)кре', r'\1крѣ'],
    [r'^([Оᲂ]у)те(?=[хш])', r'\1тѣ'],

    [r'\bФавор', r'Ѳавѡр'],
    [r'\bфавор', r'ѳавѡр'],
    [r'фарисе', r'фарїсе'],
    # Ѳѡма̀
    [r'\bФом(?=\w)', r'Ѳѡм'],
    [r'\bфом(?=\w)', r'ѳѡм'],


    [r'([Хх])леб', r'\1лѣб'],
    [r'([Хх])рист', r'\1рїст'],

    [r'царск[ао]го', r'царскагѡ'],
    [r'([Цц])ве(?=[лст])', r'\1вѣ'],
    [r'цел(?=[еєиюѧ]|ьб|омꙋ)', r'цѣл'],

    [r'([Чч])елове(?=[кч])', r'\1еловѣ'],
    [r'([Чч])естнейш', r'\1естнѣйш'],

    [r'([Ꙗꙗ])ве\b', r'\1вѣ'],
    [r'([Ꙗꙗ])ко\b', r'\1кѡ'],

    # чаще Въ чем ВЪ
    [r'\b([ВКС])Ъ\b', r'\1ъ'],

    [r'', r'0'],
    [r'', r'1'],
    [r'', r'2'],
    [r'', r'3'],
    [r'', r'4'],
    [r'', r'5'],
    [r'', r'6'],
    [r'', r'7'],
    [r'', r'8'],
    [r'', r'9'],

    # months
    [r'ентѧбрѧ', r'ептемврїа'],
    [r'ктѧбрѧ', r'ктѡврїа'],
    [r'оѧбрѧ', r'оемврїа'],
    [r'екабрѧ', r'екемврїа'],
    [r'ꙗнварѧ', r'іаннꙋарїа'],
    [r'Ꙗнварѧ', r'Іаннꙋарїа'],
    [r'евралѧ', r'еврꙋарїа'],
    [r'([Мм])арта\b', r'\1арта'],
    [r'прелѧ', r'прілїа'],
    [r'\b([Мм])аѧ\b', r'\1аїа'],
    [r'([Іі])ю([лн])ѧ\b', r'\1ꙋ\2їа'],
    [r'([Аа])вгꙋста', r'\1ѵгꙋста'],
)
# Ударения
'''
    Набор правил для ударений.
    В основном используются regex методы look ahead/behind
    Ударение ставится после группы \g<0>
    [r'\bада(?=м)', OX, 'i'],
    в данном правиле это "ада". 
    OX - оксия, VA - вария, IS - исо и т.д.
    Остаьная часть слова (после ударения) остается неизменной
    флаг 'i' - регистронезависимость (исключение - для ^[Оᲂ]у)
    
'''
regs_acutes = (
    [r'\bа(?=біе\b)', IS, 'i'],
    [r'\bа(?=вел)',   IS, 'i'],
    [r'\bа(?=гне?[цч])',  IS, 'i'],
    [r'\bа(?=д[аꙋѣеъ]\b)', IS, 'i'],
    [r'\bада(?=м)',     OX, 'i'],
    [r'\bа(?=зъ\b)',  IS, 'i'],
    [r'ака(?=ѳіст)',  OX, 'i'],
    [r'\bа(?=ки\b)',  IS, 'i'],
    [r'аллилꙋ(?=і[ѧа])',  OX, 'i'],
    [r'\bа(?=лчꙋ)', IS, 'i'],
    [r'ами(?=нь)', OX, 'i'],
    [r'\bа(?=може\b)',    IS, 'i'],
    [r'\bа(?=нгел)',    IS, 'i'],
    [r'анті(?=хр)',   OX, 'i'],
    [r'анат[оѡ]',   OX, 'i'],
    [r'апо(?=стол)',  OX, 'i'],
    [r'арха(?=нгел)', OX, 'i'],
    [r'архистрати',   OX, 'i'],
    [r'аѳана',        OX, 'i'],
    [r'аѳѡ(?=н)',     OX, 'i'],
    [r'\bа(?=ще\b)',  IS, 'i'],

    # =========================
    # -бед-
    [r'\bбѣ(?=д([енс]\w|ъ)\b)',     OX, 'i'],
    [r'\bбѣд([аеꙋ]\b|о(?=\w))',     OX, 'i'],
    [r'\bбѣд[аꙋ]\b',                VA, 'i'],

    # =========================
    # -бег-, -беж-
    # отбеже
    [r'''  
        (^[Оᲂ]у|\b(из|при|ѿ)?)
        бѣ
        [гж]
        [аеиꙋ]
        \b
        ''', VA, 'i'],

    # избѣглъ избѣгнꙋти
    [r'(^[Оᲂ]у|\b(из|при|ѿ|на)?)бѣ(?=г(л?ъ|н))', OX, 'i'],

    [r'\bбѣ(?=гати\b)', OX, 'i'],
    [r'(^[Оᲂ]у|\b(из|при|ѿ)?)бѣжа(?=ти\b)', OX, 'i'],

    # избѣга́ти избѣго́х
    [r'(^[Оᲂ]у|\b(из|при|ѿ))бѣг[оа](?=\w+)', OX, 'i'],
    # ---- -бег-, -беж- ---------------

    [r'безмѣ(?=(р|cт)н)', OX, 'i'],
    [r'безбо(?=ж)',   OX, 'i'],
    [r'безгла(?=с)',  OX, 'i'],
    [r'беззако(?=н)', OX, 'i'],
    [r'безмо(?=л)',   OX, 'i'],
    [r'безпло(?=т)',  OX, 'i'],
    [r'безꙋ(?=м)',    OX, 'i'],
    [r'безчи(?=с)',   OX, 'i'],
    # бѣлый
    [r'\bбѣ(?=л[аꙋы]\w)', OX, 'i'],
    [r'\bбѣ(?=ло(м[ꙋъ]|[ею]))', OX, 'i'],
    [r'\bбѣло\b', VA, 'i'],
    [r'\bбѣлоза', OX, 'i'],
    [r'\bбѣлока', OX, 'i'],
    [r'\bбѣлопе', OX, 'i'],
    [r'\bбѣлори', OX, 'i'],
    [r'\bбѣлостѣ', OX, 'i'],

    [r'''  # убеленный 
        (\b|^[Оᲂ]у)
        бѣл
        (?![аоꙋы]\w) # ! бѣлый
        [еиоѧ]
        ''', OX, 'i'],
    # ---- -бел- -----------------

    [r'\bбѣ(?=с[аиꙋыъ]\b)', OX, 'i'],
    [r'\bбѣ(?=сомъ\b)',     OX, 'i'],
    [r'\bбѣсо(?=вск)',      OX, 'i'],
    [r'\bбѣ\b',             VA, 'i'],

    # бесте беша бехом
    [r''' 
        \b
        бѣ
        (?=
            сте
            |х(?=(ом)?ъ)
            |ша
        )   
        ''', OX, 'i'],

    [r'\bбде\b',          VA, 'i'],
    [r'\bбде(?=[нт])',    OX, 'i'],
    [r'\bби(?=сер)',      OX, 'i'],

    # =========================
    # -благ- -блаж -
    [r'бла(?=г[ѣиоѡꙋъ]\b)',   OX, 'i'],
    [r'блага\B',              OX, 'i'],
    [r'благі(?=[йеѧ])',       OX, 'i'],
    [r'благи(?=[мх][иъ]\b)',  OX, 'i'],

    [r'благовѣ(?=щені[аеюѧ]\b)', OX, 'i'],
    [r'благовѣ(?=ст[ін])', OX, 'i'],  # @@@ ѣ
    [r'благовѣсти\b',     VA, 'i'],  # @@@ ѣ
    [r'благовѣсти\B',     OX, 'i'],  # @@@ ѣ
    [r'благовѣствꙋ',      OX, 'i'],  # @@@ ѣ
    [r'благовѣствова\B',  OX, 'i'],  # @@@ ѣ
    [r'благовѣствова\b',  VA, 'i'],  # @@@ ѣ

    [r'благоговѣ(?=й?н)', OX, 'i'],

    [r'благово(?=н)',     OX, 'i'],
    [r'благоволе(?=н)',   OX, 'i'],
    [r'благоволи\b',      VA, 'i'],
    [r'благоволи\B',      OX, 'i'],
    [r'благоволѧ\B',      OX, 'i'],

    [r'благодар[ѧю]\b', VA, 'i'],
    # благодарим
    [r'благодар[иеѧ](?=\w+)', OX, 'i'],
    # благодарно, благодать
    [r'благода(?=[рт](?![иеѧ]\w+|ѧ\b))', OX, 'i'],
    [r'благодѣ(?!ѧні\B)',     OX, 'i'],
    [r'благодѣѧ(?=ні\B)',     OX, 'i'],
    [r'благо(?=[йе]|м[ꙋъ])',  OX, 'i'],
    [r'благоѡбра(?=з)',       OX, 'i'],
    [r'благоро(?=д)',         OX, 'i'],
    [r'благосе(?=рд)',        OX, 'i'],
    # благослове́нїе
    [r'благослове(?=н)', OX, 'i'],
    # благослови
    [r'благослов([иѧ]|лю)\b', VA, 'i'],
    [r'благослов([иѧ]|лѧ)\B', OX, 'i'],

    [r'благоꙋтро',        OX, 'i'],
    [r'благоꙋха',         OX, 'i'],
    [r'благочести(?=в)',  OX, 'i'],
    [r'благоче(?=сті)',   OX, 'i'],
    [r'бла(?=гꙋ\b)',      OX, 'i'],
    [r'благꙋ(?=ю)',       OX, 'i'],

    # -блаж-
    [r'\bбла(?=же\b)', OX, 'i'],
    # ᲂу҆блажа́емъ блаже́нный # ! блаже
    [r'блаж(?!е\b)[аеи]', OX, 'i'],
    # --------------------------

    [r'блꙋ(?=д([шъ]|имъ|н(?!и[кц])))', OX, 'i'],
    [r'блꙋди\b',        VA, 'i'],
    [r'блꙋди\B(?!мъ)',  OX, 'i'],
    [r'блꙋдни(?=[цч])', OX, 'i'],
    [r'блꙋдник[аи]\b',  VA, 'i'],
    [r'блꙋжд[аеє]',     OX, 'i'],


    # =========================
    # -бог- -бож- -боз-
    [r''' # бо́гъ бо́гꙋ бо́гомъ  
        
        (^[Оᲂ]у|\b) # ᲂу҆бо́гїй вынести отдельно
        бо
        (?=г
            (
                [аеиꙋъ]
                |ій  # вынести отдельно
                |о(мъ|ви)
            )\b
        )
        ''', OX, 'i'],
    [r'''  # бога́тый бога́тно
        бога
        (?=т(
            ъ
            |[аіоꙋы]\w\b # бога́тый
            |[оы]м\w?   # бога́томꙋ бога́тымъ 
            |н([аеоѡꙋы]) # бога́тно
            |ств
            )
        )
        ''', OX, 'i'],

    # бо́же бо́жїй
    [r''' 
        \b
        бо
        (?=
            ж
            (е|і[аеийюѧ])\b
        )
        ''', OX, 'i'],

    [r'боже(?=ственн)',     OX, 'i'],
    [r'\bбожеств[аѣоꙋ]\b',  VA, 'i'],
    # бо́зе бо́зи
    [r'\bбо(?=з[еѣи]\b)', OX, 'i'],
    # ---- -бог- -бож- -боз- -------

    [r'боговѣ(?=дѣн)',        OX, 'i'],
    [r'богодꙋхнове(?=нн)',    OX, 'i'],
    [r'богоно(?=с)',          OX, 'i'],
    [r'богоразꙋ',             OX, 'i'],
    [r'богоро(?=ди[чц])',     OX, 'i'],
    [r'богороди(?=тельниц)',  OX, 'i'],
    [r'богосло',              OX, 'i'],
    [r'болѣ(?=зн)',           OX, 'i'],

    # бо́ль бо́ли споболѝ боли́тъ бо́лїю
    [r'\bбо(?=л([иь]|ію)\b)', OX, 'i'],
    [r'\Bболи\b',     VA, 'i'],
    [r'боли\B',       OX, 'i'],
    [r'болѧ(?=[йщ])', OX, 'i'],

    # бо́льше бо́льшимъ
    [r'бо(?=льш[еиꙋ])', OX, 'i'],


    [r'бра(?=т[еѣінсꙋъ])', OX, 'i'],

    # бꙋ́дꙋ
    [r'(?<!оз|по)бꙋ(?=д(е[тм]ъ|[иꙋ]))', OX, 'i'],

    [r'бы(?=(л[иоъ]|ти|сть|ша)\b)', OX, 'i'],
    [r'была\b',           VA, 'i'],
    # быва́етъ бы́вшїй
    [r'бы(?=в[сшъы])',    OX, 'i'],
    [r'быва',             OX, 'i'],
    # бытїѐ бытїе́мъ
    [r'\b(не|паки)?быті[еиюѧ]\b',       VA, 'i'],
    [r'\b(не|паки)?бытіе(?=мъ\b)',      OX, 'i'],
    [r'(?<!одо)бѧ(?=ш)',      OX, 'i'],
    [r'(?<!орб)бѧ(?=хꙋ\b)',   OX, 'i'],

    # бꙋ́рѧ бꙋ́рный
    [r'(?<!ѻ)бꙋ(?=р)', OX, 'i'],

    # ввв vvv

    [r'вавило(?=н)',  OX, 'i'],
    [r'валаа(?=м)',   OX, 'i'],

    [r'\bва(?=м[ъи]\b)',  OX, 'i'],
    [r'\bва(?=съ\b)',     OX, 'i'],
    [r'\bва(?=ш)',        OX, 'i'],

    [r'\bвдохнове(?=н)',  OX, 'i'],
    [r'\bвдохнови\b',     VA, 'i'],
    [r'\bвдохнови\B',     OX, 'i'],
    [r'\bвдохновлѧ',      OX, 'i'],
    [r'\bвдохновѧ',       OX, 'i'],


    # ========================
    #   вѣд вѣж вѣм вѣт вѣс вѣщ
    #   -вѣд-
    [r'''
        \b
        (
            (не)?(из)?
            |испо
            |(?<!за)(про)?по
        )?
        вѣ
        (?=д(
            а [елнтхюѧ]?
            |[еѣ] [нтхш]
            |и [хш]
            |о [м]
            |ꙋ [еюѧ]
            |ы й
            |ѧ т
            |н 
        ))
        ''', OX, 'i'],

    #   -вѣж-
    [r'\b(не)?вѣ(?=ж)', OX, 'i'],

    #   -вѣм-
    [r'''    
        \b
        ((ис)?по)?
        вѣ
        (?=м[ыъ])
        ''', OX, 'i'],

    #   -вѣс-
    [r'\b(не)?вѣ(?=с(и\b|т))', OX, 'i'],
    # со́вѣсть
    [r'\bсо(?=вѣст)', OX, 'i'],

    #   -вѣт- (! цвѣ́тъ свѣт вѣтіи, вѣтвѧми)
    [r'(?<![сц])вѣ(?=т(?!і[иѧ]|вѧм))', OX, 'i'],
    # вѣтіи
    [r'\bвѣті(?=[иѧ])', OX, 'i'],

    #   -вѣщ-
    [r'вѣ(?=щій\b)',      OX, 'i'],
    [r'вѣща',             OX, 'i'],
    [r'вѣ(?=щенск)',      OX, 'i'],
    [r'веще(?=ственн)',   OX, 'i'],
    [r'вѣщꙋ\b',           VA, 'i'],

    # ---- вѣд вѣж вѣм вѣт вѣс вѣщ ----

    # ========================
    # век- вец- веч-
    [r'\bвѣ(?=к(?![оѡ]в|ам))', OX, 'i'],
    [r'''
        \b
        вѣк[аоѡ]
        (?=[мвх][иъ])
        ''', OX, 'i'],

    [r'вѣ(?=цѣ(хъ)?)',  OX, 'i'],
    [r'вѣ(?=че?н)',     OX, 'i'],
    # ---- век- вец- веч- ----------

    # ве́лїй
    [r'(пре)?ве(?=лі(?!ар))', OX, 'i'],
    [r'вели(?=к(?!о(мꙋч|л[ѣе]п)))', OX, 'i'],
    [r'вели(?=ц)',        OX, 'i'],
    [r'великолѣ(?=п)',    OX, 'i'],
    [r'велича\B',         OX, 'i'],
    [r'вели(?=ч[иі])',    OX, 'i'],

    [r'велегла', OX, 'i'],

    # ========================
    #   венц- венч-
    [r'\bвѣне(?=цъ\b)',   OX, 'i'],
    [r'\bвѣнц[аеѣꙋы]\b',  VA, 'i'],

    # вѣнца́ми
    [r''' 
        \b
        вѣнц
        (?!
            [аеѣꙋы]\b   # ! вѣнцꙋ̀
            |ецъ\b      # ! вѣне́цъ   
        )
        [аеєоѡ]
        (?=\w+)
        ''', OX, 'i'],

    # вѣнча̀
    [r'(^[Оᲂ]у|\b([ѻѡ]б)?)вѣнча\b', VA, 'i'],

    # вѣ́нче вѣ́нчанъ
    [r'''    
        (^[Оᲂ]у|\b(раз|[ѻѡ]б)?)
        вѣ
        (?=нч(е|анъ)\b)
        ''', OX, 'i'],
    # вѣнча́еши
    [r'''
        (
            ^[Оᲂ]у
            |\b(?:[ѻѡ]б)?
        )
        вѣнч
        (?!  # ! вѣнча̀ вѣ́нче вѣ́нчанъ
            ([ае]|анъ)\b 
        )
        а   # ударн.
        ''', OX, 'i'],
    # ----  венц- венч- --------------

    [r'вѣ(?=р[аеиноꙋыѧ])', OX, 'i'],
    [r'ве(?=сь\b)',   OX, 'i'],
    [r'весе(?=лі)',   OX, 'i'],
    [r'весьма\b',     VA, 'i'],
    [r'вѣтвѧ(?=м)',   OX, 'i'],

    [r'взира',    OX, 'i'],
    [r'взыва',    OX, 'i'],
    [r'взыгра',   OX, 'i'],
    [r'взыска\b', VA, 'i'],
    [r'взыска\B', OX, 'i'],

    # ви́ждь
    [r'ви(?=жд)',     OX, 'i'],
    [r'ви(?=дѧ)',     OX, 'i'],
    [r'ви(?=жꙋ\b)',   OX, 'i'],

    [r'\b(?:нена)?видѣ(?=ні)', OX, 'i'],

    [r'він[аеоꙋ]\b',      VA, 'i'],
    [r'віногра',          OX, 'i'],

    [r'влади(?=мір)',     OX, 'i'],
    [r'влады(?=[кчц])',   OX, 'i'],

    [r'вложи\b', VA, 'i'],
    [r'вложи\B', OX, 'i'],

    [r'\bвмѣнѧ',    OX, 'i'],
    [r'\bвмѣни\B',  OX, 'i'],
    [r'\bвмѣни\b',  VA, 'i'],

    [r'внегда\b', VA, 'i'],

    [r'внꙋ(?=тр(?!и\b|ь[ꙋю]д))', OX, 'i'],
    [r'внꙋтри\b', VA, 'i'],

    [r'\bвод[аеѣо]\b',    VA, 'i'],
    [r'\bвода\B',         OX, 'i'],
    [r'\bводо(?=[йю])',   OX, 'i'],
    [r'\bво(?=д[ꙋъ])',    OX, 'i'],

    [r'\bводвор[еиюѧ]\B', OX, 'i'],
    [r'\bводвор[ию]\b',   VA, 'i'],

    [r'воздѣва',              OX, 'i'],
    [r'воздѣ(?=ти|еши|ющ)',   OX, 'i'],

    [r'возвед[еиꙋ]\b',    VA, 'i'],
    [r'возврати\b',       VA, 'i'],
    [r'возврати\B',       OX, 'i'],

    [r'возда[юѧ]\b',          VA, 'i'],
    [r'возда[юѧ]\B',          OX, 'i'],
    [r'возда(?=[мнстхш])\B',  OX, 'i'],
    [r'возда(?=в(?!а))',      OX, 'i'],
    [r'воздава',              OX, 'i'],
    [r'возда(?=й)',           OX, 'i'],
    [r'возда(?=л(?!а\b))',    OX, 'i'],
    [r'воздала\b',            VA, 'i'],

    [r'воздвиг[ао]',  OX, 'i'],
    [r'воздви(?=ж|г(?![ао]))', OX, 'i'],
    [r'воздвиза',     OX, 'i'],
    [r'воздыха',      OX, 'i'],

    [r'возло(?=жен)', OX, 'i'],

    [r'возлюблю\b',               VA, 'i'],
    [r'возлю(?=бл([еє]н|ь))',     OX, 'i'],
    [r'возлюби\b',                VA, 'i'],
    [r'возлюби(?=[влсх]|ти|ша)',  OX, 'i'],
    [r'возлю(?=би(мъ|ши))',       OX, 'i'],

    [r'возмо(?=ж)', OX, 'i'],

    # возопѝ возопи́ша
    [r'возопи\b', VA, 'i'],
    [r'возопи\B', OX, 'i'],

    [r'возра(?=д)', OX, 'i'],

    # возсїѧ̀
    [r'возсіѧ\b', VA, 'i'],
    # возсїѧ́й
    [r'возсіѧ(?!\b|ва)', OX, 'i'],
    [r'возсіѧва', OX, 'i'],

    [r'\bво(?=и\b)', OX, 'i'],
    [r'\bво(?=ин(?!(ств)?(онач|ослов)))', OX, 'i'],

    [r'вои(?=стин)', OX, 'i'],

    [r'вонми\b',      VA, 'i'],
    [r'во(?=нмемъ)',  OX, 'i'],

    [r'вон[юѧ]\b', VA, 'i'],

    [r'вопі[еєюѧ]', OX, 'i'],
    [r'вопі[юѧ]\b', VA, 'i'],

    [r'воспѣва\B',       OX, 'i'],
    [r'воспою\b',         VA, 'i'],
    [r'воспо[еи](?=м)',   OX, 'i'],
    [r'восходѧ\b',        VA, 'i'],
    [r'восходѧ\B',        OX, 'i'],
    [r'восхожде\B',       OX, 'i'],
    [r'восхожда\B',       OX, 'i'],

    # вра́гъ вра́жїй вражд-
    [r'''
        \b
        вра
        (?=
            гъ
            |ж(?!д) # ! вражда
        )
        ''', OX, 'i'],
    [r'\bвра[гз][аеѣиꙋ]\b', VA, 'i'],
    [r'\bвразе(?=х)',     OX, 'i'],
    [r'\bврага(?=[мх])',  OX, 'i'],
    [r'\bвраго(?=[вм])',  OX, 'i'],
    [r'\bвражд[аеꙋы]\b',  VA, 'i'],
    [r'\bвражд[еоꙋ]\B',   OX, 'i'],

    [r'врата\b',      VA, 'i'],
    [r'враты\b',      VA, 'i'],
    [r'врата(?=[мх])', OX, 'i'],
    [r'вратѣ(?=х)',   OX, 'i'],
    [r'вра(?=тъ)',    OX, 'i'],

    [r'вра(?=чь)',    OX, 'i'],
    [r'врачꙋ\b',      VA, 'i'],

    [r'вре(?=м(?!ен[аъы]))', OX, 'i'],
    [r'времена\b', VA, 'i'],

    [r'всегда\b', VA, 'i'],
    [r'всего\b',  VA, 'i'],

    [r'всѣ(?=м[иъ]|хъ)',          OX, 'i'],
    [r'вс[еѣ](?=ю\b)',            OX, 'i'],
    [r'\bвселе(?=н(с[кт]|н))',    OX, 'i'],

    [r'\bвсели\B', OX, 'i'],
    [r'\bвсели\b', VA, 'i'],

    [r'\b(все|над)мі(?=рн)', OX, 'i'],

    [r'всемꙋ\b',          VA, 'i'],
    [r'всеѧ\b',           VA, 'i'],
    [r'\bвс[еию]\b',      VA, 'i'],
    [r'\bвско(?=ре)',     OX, 'i'],
    [r'\bвсѧ\b',          GKA, 'i'],
    [r'\bвсѧ(?=[кцч])',   OX, 'i'],

    [r'вта(?=йне)', OX, 'i'],

    [r'вы(?=нꙋ\b)',   OX, 'i'],
    [r'\bвы\b',       VA, 'i'],
    [r'вы(?=шн)',     OX, 'i'],
    [r'вы(?=[сш]ш)',  OX, 'i'],

    # ггг ggg

    [r'\bгавріи(?=л)', OX, 'i'],
    # гдѣ̀
    [r'\bгдѣ\b', VA, 'i'],
    [r'ге(?=рман(?![іс]))', OX, 'i'],
    # геѳсїма́нїа
    [r'геѳсіма(?!нійс)', OX, 'i'],
    # геѳсїмані́йстѣй
    [r'геѳсімані(?=йс)', OX, 'i'],

    # Глаго́лъ
    [r'\bглаго(?=л)', OX, 'i'],
    [r'\bгла(?=д)',   OX, 'i'],
    # гла́съ
    [r'\bгла(?=с[аноеꙋыъ])', OX, 'i'],
    # глаша́ти ѻ҆глаше́нный
    [r'глаш[ае]', OX, 'i'],
    # ѻ҆гласѝ
    [r'(воз|[ѻѡ])гласи\b',    VA, 'i'],
    [r'\bглꙋбин[аеоꙋѣы]\b',   VA, 'i'],
    [r'\bглꙋбино(?=ю)',       OX, 'i'],
    [r'\bглꙋбоча(?=йш)',      OX, 'i'],

    [r'гнѣ(?=в(?!л))', OX, 'i'],
    [r'гнѣвли(?=в)', OX, 'i'],

    # годи́на
    [r'\bгоди(?=н[аеѣоꙋы])', OX, 'i'],
    [r'\bголго(?=ѳ)', OX, 'i'],
    [r'\bгоне(?=ні)', OX, 'i'],
    [r'\bгора(?=хъ)', OX, 'i'],
    [r'горѣ(?=т)',    OX, 'i'],
    [r'\bгорѣ\b',     VA, 'i'],
    # го́ре
    [r'\bго(?=ре\b)',         OX, 'i'],
    [r'\bго(?=рьк(?!а\b))',   OX, 'i'],
    [r'\bгорѧ(?=щ)',          OX, 'i'],

    # Го́споди
    [r'го(?=спод([аеиꙋ]|омъ)\b)', OX, 'i'],
    # Госпо́дне
    [r'госпо(?=д([нь]|ств))', OX, 'i'],
    # Госпожа̀
    [r'госпож[аеиѣꙋ]\b', VA, 'i'],

    [r'\bгра(?=д[аеиѣꙋъ]\b)', OX, 'i'],

    # ==============================
    # грѣ́хъ грѣ́шникъ грѣ́шенъ грѣшны̀ согрѣшѝ прегрѣше́нїѧ грѣсѝ грѣсѣ́хъ

    # грѣх (ѣ - ударн.)
    [r'''
        \b
        грѣ
        (?=
            хъ
            |шенъ
            |шн(?!(\w\b|ѣ)) # ! грѣшны
        )
        ''', OX, 'i'],

    [r'(со)?грѣш([иꙋ]|н[аоѡы])\b', VA, 'i'],
    [r'грѣси\b',          VA, 'i'],
    [r'грѣх[аеѣиꙋ]\b',    VA, 'i'],
    [r'грѣхми\b',         VA, 'i'],
    [r'грѣха(?=[мх])',    OX, 'i'],

    [r'грѣх[оѡ](?!лю|па)',    OX, 'i'],
    [r'грѣхолюби',            OX, 'i'],
    [r'грѣхолю(?=бн)',        OX, 'i'],
    [r'грѣхопад[еє]',         OX, 'i'],
    [r'грѣсѣ(?=хъ\b)',        OX, 'i'],
    # прегрѣше́нїѧ
    [r'''
        грѣш
        (
            [аи]
            |е(?!нъ) # ! грѣ́шенъ
        )\B
        ''', OX, 'i'],

    # -------------------------------

    [r'грѧд[еиꙋыѧ]\B',    OX, 'i'],
    [r'грѧд[иꙋ]\b',       VA, 'i'],

    # ддд ddd

    [r'да(?=бы|же)',  OX, 'i'],
    [r'даде\b',       VA, 'i'],
    [r'даде\B',       OX, 'i'],
    [r'да(?=ждь)',    OX, 'i'],
    [r'\bда(?=й|лъ)', OX, 'i'],
    [r'\bда(?=лсѧ)',  OX, 'i'],

    [r'\bда(?=р([аеѣꙋъ]\b|ꙋ\B))', OX, 'i'],
    [r'\bдары\b',     VA, 'i'],
    [r'\bдарова\B',   OX, 'i'],
    [r'\bдарова\b',   VA, 'i'],
    [r'\bдва(?=жд)',  OX, 'i'],
    [r'\bдве(?=ри)',  OX, 'i'],

    # дѣ́ва
    [r'''
        \b(присно)?
        дѣ
        (?=в(?!омати))
        ''',
        OX, 'i'],

    [r'\bде(?=нь)',   OX, 'i'],
    [r'дне(?=сь)',    OX, 'i'],
    [r'\bдні(?=й)',     OX, 'i'],
    [r'\bднѣ\b',      VA, 'i'],
    [r'\bдни\b',      VA, 'i'],

    [r'держа\b',  VA, 'i'],
    [r'держа\B',  OX, 'i'],

    [r'дерзнове', OX, 'i'],

    [r'\bдѣ(?!то[вр]од|т[еєѣ]й)(?=т)', OX, 'i'],
    [r'\bдѣте(?=й)',      OX, 'i'],
    [r'\bдѣто[вр]од[иѧ]', OX, 'i'],
    [r'издѣ(?=тска)',     OX, 'i'],

    # дѣ́ло
    [r'\bдѣ(?=л[оаꙋ]\b)', OX, 'i'],
    # дѣ́ѧша
    [r'\bдѣ(?=ѧ[твхш])',  OX, 'i'],
    # дѣѧ́нїѧ
    [r'\bдѣѧ(?=н)',   OX, 'i'],
    # дѣ́юще
    [r'\bдѣ(?=ю)',    OX, 'i'],

    [r'\bдивѣ(?=е)',  OX, 'i'],
    # дивный
    [r'(пре|неиж|много(иж)?|досто|все)?ди(?=вн)', OX, 'i'],

    [r'\bдими(?=трі(?!ан))',  OX, 'i'],
    [r'\bдимитріа(?=н)',      OX, 'i'],

    # длѧ
    [r'\bдлѧ\b', VA, 'i'],

    [r'добро\b', VA, 'i'],
    [r'до(?=бр(ы[ймх]|ꙋю|о[емюй]))', OX, 'i'],
    [r'добродѣ(?=тел)', OX, 'i'],

    # доколе
    [r'доко(?=лѣ)',   OX, 'i'],
    [r'долготꙋ\b',    VA, 'i'],
    # до́мъ до́мы
    [r'до(?=м[еѣиꙋъы]\b)', OX, 'i'],
    # дондеже
    [r'до(?=ндеже)',  OX, 'i'],
    [r'досе(?=лѣ)',   OX, 'i'],
    # досто́йно ! достойнопѣ́тый
    [r'досто(?=йн(?!о(б|пѣ|сло)))', OX, 'i'],
    [r'достоѧ(?=н)',  OX, 'i'],
    [r'доше(?=д)',    OX, 'i'],

    [r'дре(?=вле)',   OX, 'i'],
    [r'дре(?=вн)',    OX, 'i'],
    [r'дре(?=ва\b)',  OX, 'i'],  # @@@ чаще дре́ва
    [r'дре(?=в([ꙋеѣъ]|о(мъ)?)\b)', OX, 'i'],

    [r'дрꙋ(?=г([аиеѣꙋъ]|омъ)\b)', OX, 'i'],
    [r'дрꙋ(?=ж(е|ба)\b)', OX, 'i'],
    [r'дрꙋ(?=зи\b)',      OX, 'i'],

    # дꙋ́сѣ - предл.п. дꙋ́ше - зват.п
    [r'\bдꙋ(?=сѣ\b)',     OX, 'i'],
    [r'\bдꙋ(?=си\b)',     OX, 'i'],
    [r'\bдꙋхо(?=вн(?!и[кч]))',    OX, 'i'],
    [r'\bдꙋховни(?=к(?!а))',      OX, 'i'],
    [r'\bдꙋховника\B',    OX, 'i'],
    [r'\bдꙋховника\b',    VA, 'i'],
    [r'\bдꙋхоно(?=сиц)',  OX, 'i'],
    # дꙋша̀
    # TODO: ?
    #   дꙋша̀: дꙋшѣ̀ - предл. дꙋшѐ - зват.
    #   дꙋ́хъ: дꙋ́сѣ - предл. дꙋ́ше - зват.
    #
    [r'дꙋш[аѣ]\b', VA, 'i'],
    # дꙋше́внꙋю
    [r'дꙋше(?=вн|ю)', OX, 'i'],
    # дꙋ́шꙋ
    [r'дꙋ(?=ш[ꙋъ]\b)',    OX, 'i'],
    [r'дꙋша(?=мъ\b)',     OX, 'i'],

    [r'дще(?=р)', OX, 'i'],
    [r'дщи\b',    VA, 'i'],

    [r'дыха(?=н)', OX, 'i'],

    # TODO: є҆̀ ю҆̀ ꙗ҆̀
    # не меняет Iso на Apostrof
    [r'\b[єюꙗ]\b', GAP, 'i'],

    [r'єѵа(?=нгел)',  OX, 'i'],
    [r'єгѵ(?=пет)',   OX, 'i'],

    [r'євфра(?=фовъ)',    OX, 'i'],
    [r'єѵхарі(?=сті)',    OX, 'i'],
    [r'єѵхарісти(?=ч)',   OX, 'i'],
    # є҆гда̀ є҆да̀
    [r'єг?да\b',  VA, 'i'],
    # є҆гѡ̀ є҆го̀
    [r'єг[оѡ]\b', VA, 'i'],
    # є҆го́же
    [r'єго(?=же\b)', OX, 'i'],
    # є҆ди́на є҆ди́наго є҆ди́ны ! є҆динагона́десѧте
    [r'єди(?=н[аеєѣꙋыъ](?!г[оѡ]н|к[оѡ]|че|ні|й?же?над))', OX, 'i'],
    [r'єди(?=но([ейю]|м[ꙋъ]|ж(ды|е))?\b)', OX, 'i'],
    [r'єди(?=нств)', OX, 'i'],
    # є҆́же є҆́й є҆́сть є҆́смь є҆́юже
    [r'\bє(?=же|й|с[тм]ь|юже\b)', IS, 'i'],
    # є҆ктенїѝ
    [r'єктені\w\b', VA, 'i'],
    [r'єле(?=а\b|е(?!п)|ом|[ийѧю])', OX, 'i'],
    # є҆ли́ко є҆ли́цы є҆ли́жды
    [r'єли(?=жды|ко|цы)', OX, 'i'],
    [r'єлисаве(?=т)',     OX, 'i'],
    # є҆мꙋ̀ є҆сѝ є҆щѐ є҆стѐ
    [r'\bємꙋ\b',      VA, 'i'],
    [r'\bємꙋ(?=же)',  OX, 'i'],
    [r'\bєс(и|те)\b', VA, 'i'],
    [r'\bєсмы\b',     VA, 'i'],
    [r'\bєстеств[аеѣоꙋ]\b', VA, 'i'],
    [r'\bєще\b',      VA, 'i'],
    [r'\bєѧ\b',       VA, 'i'],
    [r'\bєѧ(?=же)',   OX, 'i'],

    # [r'жа(?=жда\b)', OX, 'i'],
    # жа́жды жа́ждꙋщїй
    [r'жа(?=жд[еꙋиоы])', OX, 'i'],
    # жела́нїе
    [r'жела(?=ні)',   OX, 'i'],
    # желѣ́зо
    [r'желѣ(?=з)',    OX, 'i'],
    # же́но
    [r'\bже(?=но\b)', OX, 'i'],
    [r'\bжена(?=х)',  OX, 'i'],
    [r'\bже(?=нъ)',   OX, 'i'],
    # жена̀ женѐ
    [r'\bжен[аеѣꙋы]\b', VA, 'i'],
    # же́ртва
    [r'же(?=ртв(?!оположн))', OX, 'i'],
    # живꙋ́щїй
    [r'живꙋ(?=щ\w+)', OX, 'i'],
    [r'жива(?=го)',   OX, 'i'],
    [r'жива(?=ѧ)',    OX, 'i'],
    # жива̀
    [r'жив[аꙋ]\b',    VA, 'i'],

    [r'живоно(?=с)',      OX, 'i'],
    [r'живо(?=тъ\b)',     OX, 'i'],
    [r'живот[аеѣыꙋ]\b',   VA, 'i'],
    [r'живото(?=мъ\b)',   OX, 'i'],
    [r'животворѧ\b',      VA, 'i'],
    [r'животворѧ\B',      OX, 'i'],
    [r'живото(?=ч)',      OX, 'i'],

    # живы́ѧ
    [r'(?<!бли)живы\B', OX, 'i'],
    # жи́вы
    [r'\bжи(?=вы\b)', OX, 'i'],

    [r'присноживо(?=т)', OX, 'i'],
    # жи́знь жи́зненный
    [r'жи(?=зн([иь]|енн))', OX, 'i'],
    [r'жите(?=йс)',   OX, 'i'],
    [r'житі[еиюѧ]\b', VA, 'i'],
    [r'житіе(?=мъ)',  OX, 'i'],

    [r'\bзаблꙋ(?=ж?дш)',  OX, 'i'],
    [r'\bзабꙋ(?=д)',      OX, 'i'],
    [r'\bзабыва\B',       OX, 'i'],
    # завѣ́са
    [r'\bзавѣ(?=с)',  OX, 'i'],
    [r'\bзане\b',     VA, 'i'],

    # за́повѣдь (??? заповѣ́дети)
    [r'за(?=повѣд[еиь](?!ти))', OX, 'i'],
    # заповѣ́далъ (! за́повѣдь за́повѣдехъ)
    [r'заповѣ(?=д)(?!д([иь]|е[йх]))', OX, 'i'],

    # зарѧ̀ зарѧ́ми зарю̀ ! лазарѧ
    [r'\bзар[еѣиюѧ]\b',   VA, 'i'],
    [r'(?<!ла|на)зарѧ\B', OX, 'i'],
    [r'заре\B',           OX, 'i'],
    [r'(?<!ла)заре\B',    OX, 'i'],

    [r'застꙋпа\B', OX, 'i'],
    [r'застꙋпи\b', VA, 'i'],
    [r'застꙋпи\B', OX, 'i'],
    [r'застꙋпл[еє]\B',    OX, 'i'],
    [r'застꙋ(?=пн)',      OX, 'i'],

    [r'защити\b', VA, 'i'],
    [r'защища\B', OX, 'i'],

    # зва́ти
    [r'\b(при|воз|на)?зва(?=[нтхш]|л(?!а))', OX, 'i'],
    # воззва̀
    [r'\b(при|воз|на)?зва\b', VA, 'i'],

    # ѕвѣ́зды ѕвѣ́здный
    [r'ѕвѣ(?=зд(ы\b|н))', OX, 'i'],
    # ѕвѣзда̀
    [r'ѕвѣзд[аеѣоꙋ]\b', VA, 'i'],
    # ѕвѣздо́ю
    [r'ѕвѣзд[ао]\B', OX, 'i'],

    [r'ѕвѣ(?=р[иеѣ]|рь(?!ми))',   OX, 'i'],
    [r'ѕвѣ(?=р[иеѧѣ]\b|ь(?!ми))', OX, 'i'],
    [r'ѕвѣрѧ(?=ми)',  OX, 'i'],
    [r'ѕвѣрьми\b',    VA, 'i'],

    [r'\bздѣ\b',          VA, 'i'],
    [r'\bздѣ(?=сь\b)',    OX, 'i'],

    [r'\bздра(?=в(?!л|отв))', OX, 'i'],

    [r'ѕѣлѡ\b',       VA, 'i'],
    [r'ѕѣ(?=льн)',    OX, 'i'],

    [r'земл[еѣиѧ]\b', VA, 'i'],
    [r'зе(?=млю\b)',  OX, 'i'],
    [r'земле(?=ю\b)', OX, 'i'],
    [r'земна\B', OX, 'i'],
    [r'земны\B', OX, 'i'],

    [r'зѣ(?=ниц)', OX, 'i'],

    [r'\bзижди\B', OX, 'i'],

    [r'\bзла(?=т[ао](мъ)?\b)',    OX, 'i'],
    [r'\bзлата(?=ѧ\b)',           OX, 'i'],
    [r'\bзлато(?=([ейю]|мꙋ)\b)',  OX, 'i'],
    [r'\bзлатогла(?=в)', OX, 'i'],
    [r'\bзлатоза(?=рн)', OX, 'i'],

    [r'ѕл[аеіѣоꙋы]\b', VA, 'i'],
    # ѕло
    [r'''
        ѕл(
            [аеѣіы]
            |о(?=
                м
                |б(?!лені)
                |ст(н|ь\b)))
        \B
        ''', OX, 'i'],
    # ѻ҆ѕлобле́нїе
    [r'ѕлобле(?=н[іь])', OX, 'i'],

    [r'\bѕмі(?=й)\b', OX, 'i'],

    [r'\b(не)?зна(?=[еєйкнтхшюѧ])',  OX, 'i'],
    [r'\bпозна\b',  VA, 'i'],
    [r'\bпознаѧ\b',  VA, 'i'],
    [r'\bпознава',  OX, 'i'],
    [r'\bпозна(?=в[сшъы])',  OX, 'i'],
    [r'\bпозна(?=[йлнстхш])',  OX, 'i'],
    [r'\bпознаю(?=щ)',  OX, 'i'],

    [r'\bзна(?=мена\b)',  OX, 'i'],
    [r'\bзна(?=мѧ\b)',  OX, 'i'],
    [r'\bзна(?=м[еє]на[вейс])',  OX, 'i'],
    [r'\bзна(?=м[еє]нан(о|н?ымъ))',  OX, 'i'],
    [r'\bзна(?=м[еє]нающ)',  OX, 'i'],
    [r'\bзнам[еє]на(?=ні|л)',  OX, 'i'],

    [r'зна(?=мені)',  OX, 'i'],

    [r'зове(?=[мт])', OX, 'i'],
    [r'зовꙋ(?=[тщ])', OX, 'i'],
    [r'зовꙋ\b',       VA, 'i'],
    [r'ѕо(?=лъ)',     OX, 'i'],

    [r'\bзра(?=к|ц)', OX, 'i'],

    # зрѣ́ти ᲂу҆зрѣ́ти
    [r'(^[Оᲂ]у|\bпри)?зрѣ(?=[лнтхш])', OX, 'i'],
    # зрю̀  призрѣ̀
    [r'\b(при)?зр[еѣюѧ]\b', VA, 'i'],
    [r'зрѧ(?=[шщ])',  OX, 'i'],
    [r'\bзри\b',      VA, 'i'],

    # иии iii

    [r'іа(?=ков)',    OX, 'i'],
    [r'\bи(?=бо\b)',      IS, 'i'],
    [r'\bи(?=г[ао]\b)',   IS, 'i'],
    [r'игꙋ(?=мен)',       OX, 'i'],
    [r'\bидѣ(?=же\b)',    OX, 'i'],
    [r'іезекі(?=ил)', OX, 'i'],
    # іерей
    [r'іере(?!м)',        OX, 'i'],
    [r'іеремі',           OX, 'i'],
    [r'іерꙋсали(?=м)',    OX, 'i'],

    [r'изба(?=в(и|ль))',  OX, 'i'],
    [r'избавле(?=ні)',    OX, 'i'],
    [r'избавлѧ\B',        OX, 'i'],
    [r'избѣжа(?=в)',      OX, 'i'],

    [r'избра\b',  VA, 'i'],
    [r'избра\B',  OX, 'i'],

    [r'излива\B',         OX, 'i'],
    [r'излі[юѧ]\b',       VA, 'i'],
    [r'излі[еюѧ]\B',      OX, 'i'],
    [r'изнемог[ао]\B',    OX, 'i'],
    [r'изнемогꙋ\b',       VA, 'i'],
    [r'изнемо(?=гш)',     VA, 'i'],
    [r'изѡбраже(?=)',     OX, 'i'],

    [r'ізра(?=ил)',       OX, 'i'],
    [r'изрѧ(?=дн)',   OX, 'i'],
    [r'изы(?=де([мт]ъ|ши)?)', OX, 'i'],
    [r'изы(?=дꙋ)',    OX, 'i'],
    [r'изыдо',        OX, 'i'],

    [r'іисꙋ(?=с)',        OX, 'i'],

    # і҆́косъ
    [r'\bі(?=кос)',     IS, 'i'],
    [r'\bікѡ(?=н)',   OX, 'i'],
    [r'\bили\b',      VA, 'i'],
    [r'\bи(?=ма)',    IS, 'i'],
    [r'\bи(?=мам[ыъ])', IS, 'i'],

    [r'имѣ\b', VA, 'i'],
    [r'имѣ\B', OX, 'i'],

    [r'\bи(?=мен[еи])', IS, 'i'],
    [r'имена\b',      VA, 'i'],

    [r'\bи(?=(ми?|х)?же\b)',  IS, 'i'],
    [r'имꙋ(?=щ)', OX, 'i'],
    [r'\bи(?=[мх]ъ\b)',       IS, 'i'],

    [r'\bи(?=мѧ\b)', IS, 'i'],
    [r'\bи(?=мѧрекъ)', IS, 'i'],

    [r'иногда\b',         VA, 'i'],
    [r'\bи(?=но[кч])',      IS, 'i'],
    [r'\bи(?=н[аоꙋыъ]\b)',  IS, 'i'],
    [r'ины(?=[ѧмх])',     OX, 'i'],

    [r'іѻрда(?=н)', OX, 'i'],
    # і҆ѡа́ннъ
    [r'іѡа(?=нн(?![іи]к))', OX, 'i'],
    # і҆ѡанни́кїй
    [r'іѡанн?[іи](?=к)', OX, 'i'],
    # і҆́ѡвъ
    [r'\bі(?=ѡв)', IS, 'i'],
    [r'іѡ(?=сиф)', OX, 'i'],

    [r'ірм(?=ос)',    OX, 'i'],

    [r'испещре(?=н)', OX, 'i'],

    [r'испо(?=лнь\b)',        OX, 'i'],
    [r'испо(?=лни(?!тел))',   OX, 'i'],
    [r'испо(?=лненн)',        OX, 'i'],
    [r'испо(?=лнѧт)',         OX, 'i'],
    [r'исполнѧ(?!т)',         OX, 'i'],

    [r'\bи(?=сповѣд(ь|и\b))', IS, 'i'],
    [r'испра(?=ви(?!тел))', OX, 'i'],
    [r'испроси\b',        VA, 'i'],
    [r'\bи(?=стин)',      IS, 'i'],
    [r'\bисточа\B',       OX, 'i'],
    [r'\bисточи\b',       VA, 'i'],
    [r'\bисточи\B',       OX, 'i'],
    [r'\bисто(?=чни)',    OX, 'i'],
    [r'\bистоща(?!ва)',   OX, 'i'],
    [r'\bистощи\B',       OX, 'i'],
    [r'\bистощи\b',       VA, 'i'],

    [r'ѵссѡ(?=п)', OX, 'i'],

    [r'исцѣле(?=н)',      OX, 'i'],
    [r'исцѣлѧ\B',         OX, 'i'],
    [r'неисцѣ(?=льн)',    OX, 'i'],
    [r'исцѣл[еи]\b',      VA, 'i'],
    [r'\bи(?=щꙋщ)',         IS, 'i'],

    [r'іꙋ(?=д(\w\b|о))',  OX, 'i'],
    [r'іꙋде(?=\w)',       OX, 'i'],

    [r'о?лѣ(?=п)', OX, 'i'],

    # ккк kkk

    # ка́мень ка́мени
    [r'\bка(?=ме?н[еѣиюьѧ]([мх][иъ])?\b)', OX, 'i'],
    [r'\bка(?=менн[аоꙋы])',   OX, 'i'],
    [r'\bканѡ(?=н)',          OX, 'i'],

    [r'\bка(?=ѧ)',        OX, 'i'],
    [r'ка(?=кѡ)',         OX, 'i'],
    [r'(ни)?ка(?=коже)',  OX, 'i'],
    [r'\bкі(?=ими|й)',    OX, 'i'],
    [r'\bко(?=е\b)',      OX, 'i'],
    [r'\bкоего(?=жд)',    OX, 'i'],
    [r'коли(?=ко)',       OX, 'i'],
    [r'колѣ(?=н[ао](?!прекл))',   OX, 'i'],
    [r'колѣнопреклоне(?=н)',      OX, 'i'],

    [r'конда(?=къ)', OX, 'i'],

    # коне́цъ конца̀ конца́мъ
    [r'кон[еє](?=цъ\b)',  OX, 'i'],
    [r'конц[аѣꙋы]\b',     VA, 'i'],
    [r'конц[аѣ]\B',       OX, 'i'],
    [r'\bкото(?=р)',      OX, 'i'],

    [r'кро(?=ве\b)',  OX, 'i'],
    [r'кто\b',        VA, 'i'],

    # прекра́снаѧ
    [r'прекра(?=с)', OX, 'i'],
    # кра́снаѧ
    [r'\bкра(?=сн[аоіꙋы]\B)', OX, 'i'],
    # красны̀ красна̀
    [r'\bкрасн[аы]\b', VA, 'i'],
    # красе́нъ
    [r'\bкрасе(?=нъ\b)', OX, 'i'],

    [r'красот[аеѣоꙋы]\b', VA, 'i'],
    [r'красото(?=ю)',     OX, 'i'],
    [r'красото\b',        VA, 'i'],

    [r'крѣ(?=пк)',            OX, 'i'],
    [r'кре(?=стн)',           OX, 'i'],
    [r'крѣ(?=пост[іиеѣь])',   OX, 'i'],
    [r'крест[аеѣꙋыѧ]\b',      VA, 'i'],
    [r'крестоѡбра(?=з)',      OX, 'i'],

    [r'крилꙋ\b',      GKA, 'i'],  # чаще мн.ч.
    [r'крилѣ\b',      VA, 'i'],
    [r'кри(?=лъ\b)',  OX, 'i'],
    [r'крилѧ',        OX, 'i'],

    [r'\bкро(?=в(і|ь(?!ми)))',  OX, 'i'],
    [r'\bкровьми\b',            VA, 'i'],
    [r'\bкро(?=в(ом)?ъ)',       OX, 'i'],

    [r'кро(?=т[коц])',    OX, 'i'],
    [r'\bктомꙋ\b',        VA, 'i'],
    [r'кꙋпѣ(?=л)',        OX, 'i'],
    [r'кꙋпин[аеоꙋы]\b',   VA, 'i'],
    [r'кꙋпино\B',         OX, 'i'],
    [r'\bкꙋ(?=ю)',        OX, 'i'],

    [r'лѣ(?=стви)',   OX, 'i'],
    [r'лѣ(?=то)',     OX, 'i'],

    # ли́къ
    [r'\bли(?=к\w\b)',    OX, 'i'],
    [r'\bли(?=цъ\b)',     OX, 'i'],
    [r'\bликꙋ(?=[йеюѧ])', OX, 'i'],

    [r'літі[июѧ]',        VA, 'i'],
    [r'літꙋргі',          OX, 'i'],
    [r'\bлітꙋрги(?!к)',   OX, 'i'],

    [r'\bлиц[еоꙋ]\b',         VA, 'i'],
    [r'\bлиц[еєо](?=мъ\b)',   OX, 'i'],

    # любвѐ любы̀
    [r'люб(в[ие]|ы)\b', VA, 'i'],
    # любо̀вь
    [r'люби(?=ти)',           OX, 'i'],
    [r'люби(?=м)',            OX, 'i'],
    [r'любо(?=в([їь]ю?))',   OX, 'i'],
    [r'лю(?=бѧщ(?!ыѧ))',      OX, 'i'],

    # лю́демъ лю́ди лю́дїе лю́дѧмъ лю́дъ лю́дстїи лю́дска
    [r'лю(?=д(и|іе)\b)',      OX, 'i'],
    [r'лю(?=дѧмъ)',           OX, 'i'],
    [r'лю(?=д[еєѣ][мх]ъ)',    OX, 'i'],
    [r'лю(?=дъ\b)',           OX, 'i'],
    [r'лю(?=дс(т(іи|ѣ))\b)',  OX, 'i'],
    [r'лю(?=дска\b)',         OX, 'i'],

    # люде́й людска́ѧ людскі́ѧ людьмѝ
    [r'люде(?=й)',        OX, 'i'],
    [r'людск[аиіо]\B',    OX, 'i'],
    [r'людьми\b',         VA, 'i'],
    [r'лю(?=т(?!ѣ(йш|е)|а\b))', OX, 'i'],

    [r'\bмарі(?=[еиѧю])',     OX, 'i'],
    [r'\bмаріа(?=м)',         OX, 'i'],

    [r'''
        \b
        (бого|дѣво)?
        ма
        (?=
            т
            (
                и         # ма́ти
                |ер
                    (
                        [неісь] # богома́терїю
                        |и(?!нск) # богома́тери
                    ) 
            )
        )
        ''', OX, 'i'],

    # бг҃омт҃ери́нскїй
    [r'''
        (бого)?
        матери
        (?=нс[кт])
        ''', OX, 'i'],

    # мѣ́сто
    [r'мѣ(?=ст)',         OX, 'i'],
    [r'мѣ(?=сѧц)',        OX, 'i'],
    [r'милосе(?=рд)',     OX, 'i'],
    [r'ми(?=лост(?!ивлен))', OX, 'i'],
    [r'ми(?=лꙋющ)',       OX, 'i'],
    [r'\bмѵ(?=р\w\b)',    OX, 'i'],
    # мѷроно́сицы
    [r'\b(мѵ)(роно)',     r'\1' + dbl_grave + r'\2' + Oxia, 'i'],

    [r'\bміхаи(?=л)',   OX, 'i'],

    [r'младе(?=не?[цч])', OX, 'i'],
    [r'\b(со)?мнѣ',       OX, 'i'],
    [r'\bмнѣ\b',          VA, 'i'],
    [r'\bмене\b',         VA, 'i'],
    [r'\bменѧ\b',         VA, 'i'],
    # мно́гимъ мно́гомꙋ мно́го мно́гими
    [r'\bмно(?=г(о(м[ъꙋ])?|и[хм][иъ]|і[иеѧ])\b)', OX, 'i'],
    [r'\bмно(?=гаѧ)', OX, 'i'],
    [r'мно(?=жеств)', OX, 'i'],
    [r'\bмно(?=ю\b)', OX, 'i'],
    [r'\bмно(?=зи\b)', OX, 'i'],
    # [r'мно(?=жайш)', OX, 'i'],

    # моѐ мою̀ моѧ̀ моѝ
    [r'\bмо[еиюѧ]\b', VA, 'i'],
    [r'\bмоего\b',    VA, 'i'],
    [r'\bмоегѡ\b',    VA, 'i'],
    [r'\bмоемꙋ\b',    VA, 'i'],
    # мое́й
    [r'\bмое(?=[йю]\b)',    OX, 'i'],
    [r'\bмоеѧ\b',           VA, 'i'],
    # мои́хъ мои́мъ
    [r'\bмои(?=[мх]ъ\b)',  OX, 'i'],
    [r'\bмо(?=й\b)',       OX, 'i'],
    [r'\bмѡѵсе',            OX, 'i'],

    [r'\bмоле(?=[бн])',     OX, 'i'],
    [r'моли\b',             VA, 'i'],
    [r'моли(?=[лс])',       OX, 'i'],
    [r'моли(?=тв(?!ослов))', OX, 'i'],
    [r'молитвосло(?=в)',    OX, 'i'],
    # мо́лимъ мо́лимсѧ
    [r'мо(?=лим)', OX, 'i'],
    [r'молю\b', VA, 'i'],
    [r'молю\B', OX, 'i'],
    [r'молѧ\b', VA, 'i'],
    [r'молѧ\B(?!тсѧ)', OX, 'i'],
    [r'мо(?=лѧтсѧ)', OX, 'i'],

    [r'мона(?=[хш]\B)',   OX, 'i'],
    [r'моско(?=вс[кт])',  OX, 'i'],
    [r'мра(?=з)',         OX, 'i'],
    [r'мра(?=[кц])',      OX, 'i'],
    [r'\bмра(?=ч)',       OX, 'i'],

    # -мꙋ́др-
    [r'''
        мꙋ
        (?!
            др(
                ец
                |и(вш|[лcш])
                |[оѡ]([влт]|с(тьми|ост))
                |ѧ
                |ѣйш
            )
        )
        (?=др)
        ''', OX, 'i'],
    # мученик (! мученіе - ???)
    [r'мꙋдрова(?=н)',     OX, 'i'],
    [r'мꙋ(?=жест)',       OX, 'i'],
    [r'мꙋ(?=чен(?!і))',   OX, 'i'],
    [r'мꙋче(?=ні)',       OX, 'i'],
    [r'\bмы\b',             VA, 'i'],
    [r'мы(?=сленн)',      OX, 'i'],

    # ннн nnn

    [r'надѣ(?=[жѧю])', OX, 'i'],
    [r'наде(?=ж)',     OX, 'i'],
    [r'намѣ(?=рен)',   OX, 'i'],

    # на́мъ на́шꙋ на́шего на́съ
    [r'''
        \b
        на
        (?=
            (
                [мс]
                [иъ]
                |
                ш
                (
                    [аꙋыъѧ]
                    |е([йюѧ]|го|м[ꙋъ])?
                    |и([мх][аиъ])?
                )
            )
            \b
        )
        ''', OX, 'i'],

    [r'\bнапа(?=ст)',  OX, 'i'],
    [r'\bнапаѧ\B',     OX, 'i'],
    [r'\bнаро(?=д)',   OX, 'i'],
    [r'наслѣ(?=д)',    OX, 'i'],
    [r'\bнаста\b',     VA, 'i'],
    [r'\bнаста(?=ви)', OX, 'i'],
    [r'\bнаставлѧ\B',  OX, 'i'],
    [r'\bнастоѧ(?=щ)', OX, 'i'],
    [r'насы(?=ти)',    OX, 'i'],
    [r'насыща\B',      OX, 'i'],
    [r'\bнаꙋчи\b',     VA, 'i'],
    [r'\bнача(?=л[аоеѣꙋ]\b)', OX, 'i'],
    [r'\bнача(?=льн)', OX, 'i'],
    [r'\bначина\B',    OX, 'i'],
    # небеса̀
    [r'\bнебес[аеѣи]\b',   VA, 'i'],
    [r'\bнебесе(?=[хм]ъ)', OX, 'i'],
    # не́бо не́бꙋ
    [r'\bне(?=б\w\b)', OX, 'i'],
    [r'\bне(?=бомъ)',  OX, 'i'],
    # небе́сный небе́съ
    [r'\bнебе(?=с(н\w|ъ))', OX, 'i'],
    [r'невѣ(?=ст|щ)',  OX, 'i'],
    [r'неви(?=дим)',   OX, 'i'],
    [r'неви(?=нн)',    OX, 'i'],

    [r'нѣ(?=гдѣ\b)',    OX, 'i'],
    [r'негѡ(?=же\b)',   OX, 'i'],
    [r'нег[оѡ]\b',  VA, 'i'],
    [r'недѣ(?=л)',  OX, 'i'],
    [r'нѣ(?=др)',   OX, 'i'],
    [r'недꙋ(?=[гжз])',      OX, 'i'],
    [r'\b(все)?нѣ(?=жн)', OX, 'i'],
    [r'неизглаго(?=л)', OX, 'i'],
    [r'неизрече(?=нн)', OX, 'i'],
    [r'\bне(?=й\b)',    OX, 'i'],
    [r'не(?=йже)',      OX, 'i'],
    [r'\bне(?=кі(ими|й))', OX, 'i'],
    [r'нѣ(?=котор)', OX, 'i'],
    [r'некта(?=рі)', OX, 'i'],
    [r'\bнѣ(?=к(то|огда|ій)\b)', OX, 'i'],
    [r'\bне(?=мже\b)', OX, 'i'],
    [r'\bнемо(?=лчн)', OX, 'i'],
    [r'\bнемꙋ\b',       VA, 'i'],
    # нѣмы̑ѧ
    [r'\bнѣмы(?=ѧ)',    GKA, 'i'],  # ??? мн.ч.?
    # нѣмо́й
    [r'\bнѣм(?!ыѧ?\b|от\w)[аіоꙋы]', OX, 'i'],
    # нѣмота̀
    [r'\bнѣмот[аꙋы]\b', VA, 'i'],
    # нѣ́мы
    [r'\bнѣ(?=мы\b)', OX, 'i'],

    [r'\bнепоколеби(?=м)',  OX, 'i'],
    [r'\bнепоро(?=че?н)',   OX, 'i'],
    [r'\bнепостижи(?=м)',   OX, 'i'],

    [r'\bнепреста(?=нн)',   OX, 'i'],
    [r'\bнепристꙋ(?=п)',    OX, 'i'],

    [r'нерадѣ(?=ні)', OX, 'i'],
    [r'\bнерꙋши(?=м)', OX, 'i'],

    # нѣ́си нѣ́смь нѣ́смы нѣ́сть
    [r'\bнѣ(?=с([мт][ыь]|и)\b)', OX, 'i'],
    [r'\bнести\b',      VA, 'i'],
    [r'\bнестрое(?=н)', OX, 'i'],
    [r'\bнетва(?=рн)', OX, 'i'],
    [r'\bне(?=ю\b)',   OX, 'i'],
    [r'\bнеѧ\b',       VA, 'i'],
    [r'\bнеѧ(?=же)',   OX, 'i'],

    [r'\bниже\b',       VA, 'i'],
    [r'\bникогда\b',    VA, 'i'],
    # нїко́лае
    [r'ніко(?=лае\b)',  OX, 'i'],
    # нїкола́й
    [r'нікола(?!е\b)',  OX, 'i'],
    [r'никто(?=же)',    OX, 'i'],

    [r'\bни(?=м(ъ|и?(же)?)\b)', OX, 'i'],
    [r'\bни(?=х(же|ъ)\b)',      OX, 'i'],

    [r'ниспо[сш]ли', VA, 'i'],

    [r'нищет[аеѣꙋы]\b', VA, 'i'],
    [r'нището(?=ю)',    OX, 'i'],
    [r'\bни(?=щ[аиіꙋ])', OX, 'i'],

    # но́ваго но́вый но́вомꙋ но́выхъ
    [r'''
        \b
        но
        (?=
            в
            (
                а(г[оѡ]|ѧ)
                |ꙋю
                |о(г[оѡ]|[ейю]|м[ъꙋ])
                |ы([ейѧ]|[мх][аиъ])
            )\b
        )
        ''', OX, 'i'],

    [r'\bнога(?=м)',    OX, 'i'],
    [r'\bнога\b',       VA, 'i'],
    [r'\bно(?=г(ъ|зе)\b)', VA, 'i'],

    # но́чь но́щїю но́чи
    [r'\bно(?=[чщ](ь|ію|(?<=ч)и))', OX, 'i'],
    # нощѝ
    [r'\bнощи\b', VA, 'i'],
    [r'\bнощн[аѣоꙋы]', OX, 'i'],

    # ны́нѣ
    [r'ны(?=нѣ)', OX, 'i'],

    # ооо ooo

    [r'ѡба(?=че)', OX, 'i'],

    [r'\bѡбъе(?=м)', OX, 'i'],
    # [r'\bѡбъе(?=м(?!лите))', OX, 'i'],
    # [r'\bѡбъемли(?=те)', OX, 'i'],

    [r'ѡбѣ(?=сити)', OX, 'i'],

    [r'ѻбѣ(?=тъ)',  OX, 'i'],
    [r'ѻбѣща\b',    VA, 'i'],
    # ѻ҆бѣ́тъ ѻ҆бѣща́нїе ѻ҆бѣща́хомъ ѻ҆бѣща́въ
    [r'ѻбѣща(?=[влхшеюѧ]|ні|ти)', OX, 'i'],

    [r'ѻби(?=тел)', OX, 'i'],

    [r'\bѡбъиди\b',       VA, 'i'],
    [r'\bѡбъиди(?=те)',   OX, 'i'],
    [r'\bѡбъидо(?=ша)',   OX, 'i'],

    [r'\bѡбъи(?=ме)',   OX, 'i'],
    [r'\bѡбъи(?=мꙋт)',  OX, 'i'],
    [r'\bѡбъим[иꙋ]\b',  VA, 'i'],
    [r'\bѡбъими(?=те)', OX, 'i'],
    [r'\bѡбъима',       OX, 'i'],

    [r'\bѡбъити\b', VA, 'i'],

    [r'ѡблек[аіо]', OX, 'i'],
    [r'ѡбле(?=кл)', OX, 'i'],
    [r'ѡблече\b', VA, 'i'],
    [r'ѡблече\B', OX, 'i'],
    [r'ѡблецы\b', VA, 'i'],
    [r'ѡблецы\B', OX, 'i'],
    [r'ѡблеце\B', OX, 'i'],

    [r'ѡбнови\b', VA, 'i'],
    [r'ѡбнови\B', OX, 'i'],

    [r'ѡбожи\b',        VA, 'i'],
    [r'ѡбож[аеи]\B',    OX, 'i'],

    [r'\bѡ(?=браз(?!ꙋю))', IS, 'i'],

    [r'\bѡбъѧ\b',           VA, 'i'],
    [r'\bѡбъѧ(?=[лтш])',    OX, 'i'],
    [r'\bѡбъѧ(?=сте)',      OX, 'i'],
    [r'\bѡбъѧд[аео]',       OX, 'i'],

    # ѡбъ([еиѧ]) -> ѡб̾\1
    [r'(ѡ)бъ([еиѧ])',  r'\1б̾\2', 'i'],

    [r'ѡбрѣ(?=[лт]ъ\b|тені)', OX, 'i'],
    [r'ѡбрѧ(?=щ)', OX, 'i'],
    [r'ѡбрѣт[ао]', OX, 'i'],
    [r'ѡбрѣсти\b', VA, 'i'],
    [r'ѡбрѣл[аи]\b', VA, 'i'],

    # ѡ҆дѣ́ющагосѧ
    [r'ѡдѣ(?=ющ)',          OX, 'i'],
    [r'ѡдѣѧ\B',             OX, 'i'],
    [r'ѡдѣва(?=[еюѧ])',     OX, 'i'],

    [r'ѡживи\b',            VA, 'i'],
    [r'ѡживи\B',            OX, 'i'],
    [r'ѡживле(?!на\b)',     OX, 'i'],
    [r'ѡживлена\b',         VA, 'i'],
    [r'ѡживлѧ',             OX, 'i'],
    [r'ѡживотвор[еиѧ]\B',   OX, 'i'],
    [r'ѡживотвори\b',       VA, 'i'],

    [r'ѡжида', OX, 'i'],

    [r'ѡзари\b',        VA, 'i'],
    [r'ѡзар[еєиѧ]\B',   OX, 'i'],

    [r'ѡкропи\b', VA, 'i'],
    [r'ѡкропи\B', OX, 'i'],

    [r'\bѡ(?=крест)', IS, 'i'],

    # ѡ҆мы́й ѡ҆мы́ю
    [r'ѡмы(?!ва)', OX, 'i'],
    # ѡ҆мыва́ти
    [r'ѡмыва\B', OX, 'i'],

    [r'ѻна\b', VA, 'i'],

    # ѡ҆правди́ши
    [r'ѡправд[аи]', OX, 'i'],

    [r'ѡсѣни\b',        VA, 'i'],
    [r'ѡсѣн[еиѧ]\B',    OX, 'i'],
    # ѡ҆ста́ви
    [r'ѡста(?=в([ишья]|ль))', OX, 'i'],
    # ѡ҆ставлѧ́ти
    [r'ѡставлѧ', OX, 'i'],

    [r'(ѿ|ѻт)крове(?=ні)',  OX, 'i'],
    [r'ѿню(?=д)',           OX, 'i'],
    [r'ѿне(?=л[еєи]же)',    OX, 'i'],

    # ѻ҆тцы̀ ѻ҆те́цъ ѻ҆те́чь ѻ҆те́ческїй ѻ҆́тча ѻ҆́тчїй ѻ҆те́ческїй ѻ҆те́чество
    [r'ѻт[еєѣ](?=цъ)',  OX, 'i'],
    [r'ѻтц[аеѣꙋы]\b',   VA, 'i'],
    [r'ѻтц[аеєѣо]\B',   OX, 'i'],
    # для Ѻ҆́ч҃е - если в тексте слово Отче уже с исо и с титлом.
    [r'\bѻ(?=че\b)', IS, 'i'],
    [r'\bѻ(?=тч([еєѣіꙋ]|и(?!зн)|а(?!ѧн)))', IS, 'i'],
    [r'ѻте(?=ч(ь\b|ес[кт]))', OX, 'i'],

    [r'ѻтрокови(?=ц)', OX, 'i'],
    # ѿра́до
    [r'ѿра(?=д)', OX, 'i'],

    # отча́ѧнїе
    [r'ѿча(?=ѧн)', OX, 'i'],

    [r'ѡчи(?=с(?!титель)|щꙋ)', OX, 'i'],
    [r'ѡчища', OX, 'i'],

    [r'ѻчи(?=ма)', OX, 'i'],
    [r'\bѻ(?=чи\b)', IS, 'i'],

    # ппп ppp

    [r'па(?=ве?л)', OX, 'i'],

    [r'паде(?=ні)', OX, 'i'],
    [r'па(?=дш)',   OX, 'i'],

    [r'па(?=ки|че)',        OX, 'i'],
    [r'па(?=мѧ(?!то[вп]))', OX, 'i'],
    [r'пара(?=клис)',       OX, 'i'],
    [r'па(?=ст(?!([иꙋ]|рена)))',    OX, 'i'],
    [r'пастыренача(?=льн)',         OX, 'i'],
    [r'паст?и\b',       VA, 'i'],
    [r'патріа(?=р)',    OX, 'i'],
    [r'пасꙋ\b',         VA, 'i'],

    # пѣ́ти напѣ́въ (! терпѣнїе)
    [r'(?<!ер)пѣ(?!ва)(?=[влнт])', OX, 'i'],
    [r'\bвсепѣ(?=т)', OX, 'i'],

    # ѿпѣва́нїе
    [r'ѿпѣва', OX, 'i'],

    [r'пѣ(?=сн(?!о))', OX, 'i'],

    [r'пе(?=тр[еъ])',   OX, 'i'],
    [r'петр(?=[оѡ]в)',  OX, 'i'],
    [r'петро(гра|па)',  OX, 'i'],
    [r'петр[аѣꙋ]\b',    VA, 'i'],

    [r'печа(?=л)', OX, 'i'],

    [r'печа(?=т(?!л))', OX, 'i'],
    [r'печатлѣ', OX, 'i'],

    [r'пита(?!ва)', OX, 'i'],
    [r'питава', OX, 'i'],

    [r'пла(?=менн)', OX, 'i'],
    [r'пламени\B', OX, 'i'],
    [r'\bпла(?=мен[иь]\b)', OX, 'i'],
    [r'пла(?=мѧ)',      OX, 'i'],
    [r'пламен[еѣ](?=ю)',   OX, 'i'],

    # пла́чь пла́чꙋщаѧ
    [r'пла(?!чевн)(?=[чк])', OX, 'i'],
    # плаче́вный
    [r'плаче(?=вн)', OX, 'i'],

    [r'плѣ(?=нъ\b)', OX, 'i'],
    [r'плѣн[иꙋю]\b',    VA, 'i'],
    [r'плѣн[иѧ]\B',    OX, 'i'],
    [r'плѣн[еє](?=н)', OX, 'i'],


    [r'\bпло(?=дъ\b)',          OX, 'i'],
    [r'\bпло(?=д[аеѣꙋы]\b)',    VA, 'i'],
    [r'пло(?=д(н|ст))',         OX, 'i'],

    [r'\bпло(?=т[ьиі])', OX, 'i'],

    [r'побѣжда', OX, 'i'],
    [r'побѣди', OX, 'i'],
    [r'побѣ(?!донос)(?=д[аиноꙋы]\b)', OX, 'i'],
    [r'побѣдоно(?=сн)', OX, 'i'],

    [r'пло(?=д[нсіъ])', OX, 'i'],

    [r'погиба\B',   OX, 'i'],
    [r'поги(?=б[елнш])', OX, 'i'],
    [r'поги(?=бел)', OX, 'i'],

    [r'по(?=двиг([ъиꙋеѣ]\b|а[мх]?))', OX, 'i'],
    # подви́жникъ (! подвиженїе подвижастесѧ)
    [r'подви(?=ж(?!а(с|ти)|ені))', OX, 'i'],
    # подвиза́лсѧ
    [r'подвиза', OX, 'i'],
    # по́двизехъ
    [r'по(?=двиз[иеѣ])', OX, 'i'],

    # подоба́етъ
    [r'\bподоба', OX, 'i'],
    [r'\bподо(?=бе?н(?!оревн))', OX, 'i'],

    # пое́мъ пои́мъ пое́тъ пое́мый пое́тсѧ
    [r'\bпое(?=м)', OX, 'i'],
    [r'\bпое(?=т(?!е\b))', OX, 'i'],
    [r'\bпои(?=мъ\b)', OX, 'i'],
    [r'\bпо(?=йт?)', OX, 'i'],

    # поживѐ поживе́ши
    [r'пожи(?=в[шыъ])', OX, 'i'],
    [r'пожив[еиꙋ]\b', VA, 'i'],
    [r'поживе(?=[мт]ъ|ши\b)', OX, 'i'],
    [r'поживꙋ(?=тъ\b)', OX, 'i'],

    [r'показа\b', VA, 'i'],
    [r'показа\B', OX, 'i'],

    # покаѧ́нїе
    [r'покаѧ(?=н)', OX, 'i'],
    # пока́ѧтисѧ
    [r'пока(?=ѧ[стхш])', OX, 'i'],

    [r'покланѧ', OX, 'i'],
    [r'покло(?=нѧтсѧ)', OX, 'i'],
    [r'покло(?=на)', OX, 'i'],
    [r'поклон[еє](?=н)', OX, 'i'],
    [r'покло(?=н[ѣноѡшъыь])', OX, 'i'],
    [r'поклони(?!тсѧ)', OX, 'i'],
    [r'поклоню', OX, 'i'],
    [r'поклонѧ(?!тсѧ)', OX, 'i'],

    [r'поко(?=[йеѣюѧ]\b)', OX, 'i'],
    [r'поко(?=и(?!ваѧ))', OX, 'i'],
    [r'покоева', OX, 'i'],
    [r'покое(?=н(?!а\b))', OX, 'i'],
    [r'поко(?=ена\b)', OX, 'i'],
    [r'поко(?=емъ\b)', OX, 'i'],

    [r'покро(?!в(енн|ител))(?=в)', OX, 'i'],
    [r'покрове(?=нн)',  OX, 'i'],
    [r'покрови(?=тел)', OX, 'i'],

    [r'покры\b',        VA, 'i'],
    [r'покры(?=[ейлстхшю])',  OX, 'i'],
    [r'покрыва\B',      OX, 'i'],

    [r'по(?=лн(?!ѣйш))',    OX, 'i'],
    [r'полнѣ(?=йш)',        OX, 'i'],
    [r'полна\b',            VA, 'i'],
    [r'полнот[аеєѣꙋы]\b',   VA, 'i'],

    [r'\bполож[иꙋ]\b', VA, 'i'],
    [r'\bположи\B', OX, 'i'],

    [r'пома(?=ж)', OX, 'i'],
    [r'пома(?=за)', OX, 'i'],
    [r'помазꙋ', OX, 'i'],

    [r'поми(?=л)', OX, 'i'],

    [r'помина', OX, 'i'],

    [r'^по(?=мощ([еиь]|ію))', OX, 'i'],
    [r'^помо(?=щн)', OX, 'i'],
    [r'^помо[гз]и\b', VA, 'i'],
    [r'^помога', OX, 'i'],
    [r'^помо(?=глъ)', OX, 'i'],

    [r'^по(?=мысл[аꙋыъ]\b)', OX, 'i'],
    [r'^по(?=мысл[аеєоѡѣ])', OX, 'i'],
    [r'^помы(?=сл[еє]н)', OX, 'i'],
    [r'^помы(?=сли)', OX, 'i'],
    [r'^помы(?=слѧтъ)', OX, 'i'],
    [r'^помышл[еє](?=н)', OX, 'i'],
    [r'^помышлѧ', OX, 'i'],

    [r'помѧн[еиꙋ]\b', VA, 'i'],
    [r'помѧн[еиꙋ]\B', OX, 'i'],

    # посѣтѝ
    [r'посѣти\b', VA, 'i'],
    # посѣти́ша
    [r'посѣти\B', OX, 'i'],
    # посѣщꙋ̀
    [r'посѣщ[аꙋ]\b', VA, 'i'],
    # посѣща́еши
    [r'посѣщ[ае]\B', OX, 'i'],

    # по́слѣ
    [r'по(?=слѣ\b)', OX, 'i'],
    # послѣ́днїй
    [r'послѣ(?=д)', OX, 'i'],
    # посредѝ посредѐ
    [r'посред[еѣи]\b', VA, 'i'],
    # пою́щїй
    [r'пою(?=щ)', OX, 'i'],

    [r'пощади\b', VA, 'i'],
    [r'пощади\B', OX, 'i'],

    [r'\bпре(?=дъ)\b',  OX, 'i'],
    [r'пра(?=вед)',     OX, 'i'],
    [r'предте(?=ч)',    OX, 'i'],

    [r'предстои', OX, 'i'],
    # ??? для предстоитѐ
    # [r'предстои\B(?!те)', OX, 'i'],
    # [r'предстоите', OX, 'i'],
    [r'предстоѧ\b', VA, 'i'],
    [r'предстоѧ\B', OX, 'i'],
    [r'пре(?=жде)', OX, 'i'],

    [r'преподо(?=б(?!но[им]))', OX, 'i'],

    # преста́ти преста́й преста́ша
    [r'преста(?=[йхш]|ти)', OX, 'i'],
    [r'преста(?=вль)',      OX, 'i'],


    [r'пречи(?=ст)', OX, 'i'],

    [r'призва(?=вн)',       OX, 'i'],
    [r'призва(?=л(?!а))',   OX, 'i'],
    [r'призвала\b',         VA, 'i'],

    [r'\bпри(?=зри)', OX, 'i'],

    # прїидѝ
    [r'пріид[иꙋ]\b', VA, 'i'],
    # прїиди́те
    [r'пріид[ио]\B', OX, 'i'],
    # прїи́демъ
    [r'пріи(?=дем)', OX, 'i'],

    [r'пріими\b', VA, 'i'],

    [r'прилѣ(?=ж)', OX, 'i'],
    [r'присѣща', OX, 'i'],
    [r'при(?=снѡ\b)', OX, 'i'],
    # приста́нище
    [r'приста(?=н)', OX, 'i'],
    [r'простира', OX, 'i'],
    [r'\bпрокі(?=ме?н)', OX, 'i'],
    [r'\bпроро', OX, 'i'],


    # ѱало́мъ
    [r'ѱало(?=м)',  OX, 'i'],
    # ѱалти́рь
    [r'ѱалт[иы]',   OX, 'i'],
    # ѱалмы̀
    [r'ѱалм[аеѣы]\b', VA, 'i'],
    [r'ѱалмопѣ(?=в)', OX, 'i'],

    [r'пꙋт[еѧ](?=м[иъ])',   OX, 'i'],
    [r'пꙋ(?=т(ь|ник))',     OX, 'i'],

    # ра́бъ раба̀ рабы̀ рабѝ рабо́мъ рабе́хъ
    [r'\bра(?=бъ)',     OX, 'i'],
    [r'\bраб[аиыоꙋ]\b', VA, 'i'],
    [r'\bрабо(?=мъ)',   OX, 'i'],
    [r'\bрабе(?=хъ)',   OX, 'i'],

    # ра́ди
    [r'\bра(?=ди\b)', OX, 'i'],
    # ра́дость ра́дꙋйсѧ ра́дꙋйтесь ра́достїю
    [r'ра(?=д(ост[еиінь]|ꙋй(сѧ|тесь)))', OX, 'i'],
    [r'ра(?=звѣ)', OX, 'i'],
    [r'разꙋмѣ(?=в(?!а)|[еийлнстхшю])', OX, 'i'],

    [r'пререка', OX, 'i'],
    # рѣ́чь
    [r'\bрѣ(?=ч[иь]|ам[иъ]\b)', OX, 'i'],
    # речѐ
    [r'рече\b', VA, 'i'],
    # ре́клъ
    [r'(?<!мѧ)ре(?=кл?ъ)',  OX, 'i'],
    # рцы̀ прорцы̀ жерцы
    [r'\b(бо|же|на)?рцы\b', VA, 'i'],
    [r'\b((пр|тв)о)?рцы\b', VA, 'i'],
    # рцы́те
    [r'рцы\B',              OX, 'i'],

    [r'разрѣш[аеи]\B',  OX, 'i'],
    [r'разрѣш[иꙋ]\b',   VA, 'i'],
    # TODO:
    # [r'ѿрѣш[аеи]\B', OX, 'i'],
    # [r'ѿрѣш[иꙋ]\b', VA, 'i'],

    # ро́дъ ро́дꙋ
    [r'ро(?=д[аеѣиꙋъ]\b)', OX, 'i'],

    [r'\bри(?=з([аеоꙋы]))', OX, 'i'],

    # рѡссі́ѧ
    [r'рѡссі(?!ѧн)',    OX, 'i'],
    # рꙋ́сскїй
    [r'рꙋ(?=с(ск|ь))',  OX, 'i'],
    [r'рꙋси\b',         VA, 'i'],

    [r'рыда\B', OX, 'i'],
    [r'рыда\b', VA, 'i'],

    # [r'рꙋ(?=це)', OX, 'i'],

    # ссс sss

    [r'саваѡ(?=ѳ)', OX, 'i'],

    # свѣ́тъ свѣ́тлый свѣ́та свѣ́телъ
    [r'''
        # ! (свѣтисѧ свѣтлейш. 
        # свѣтозарн. свѣтоподат.
        # свѣтоносн. свѣтѧщійсѧ)
        \b
        свѣ
        (?!
            т
            (
                и(?!т) 
                |л
                    (
                        а\b
                        |[еѣ][ей]
                        #|о\B
                    ) 
                |о[дзлнп]
                |ѧ\B
            )

        )
        (?=т)
        ''', OX, 'i'],

    # свѣти́сѧ свѣти́льникъ свѣти́ло
    [r'(про|ѡ)свѣти\b', VA, 'i'],
    [r'(про|ѡ)свѣти\B', OX, 'i'],
    [r'(много|небо|снѣго|три)свѣ(?=т)', OX, 'i'],

    [r'свѣти(?=л[оь]|сѧ)', OX, 'i'],
    [r'свѣтода(?=в)',   OX, 'i'],
    [r'свѣтоза(?=рн)',  OX, 'i'],
    [r'свѣтоли(?=т)',   OX, 'i'],
    [r'свѣтоно(?=с)',   OX, 'i'],
    [r'свѣтопода(?=т)', OX, 'i'],
    # свѣтлѣ́е свѣтлѣ́йшꙋю
    [r'свѣтлѣ(?=[ей])', OX, 'i'],

    [r'свирѣ(?=л)', OX, 'i'],

    [r'свое(ѧ|г[оѡ])\b',    VA, 'i'],
    [r'сво[еиюѧ]\b',        VA, 'i'],
    [r'свое(?=ю)',          OX, 'i'],
    [r'\bсвои(?=[мх])',     OX, 'i'],

    # свѧ́тъ свѧ́те
    [r'свѧ(?=т[аеѣиоѡꙋъы]\b)', OX, 'i'],
    # свѧта́ѧ свѧте́й свѧтꙋ́ю свѧты́ѧ свѧти́тель
    [r'свѧт[аеѣиꙋы]\B', OX, 'i'],
    # свѧто́е
    [r'свѧто(?=[ейм])', OX, 'i'],

    # свѧще́нникъ свѧще́нїе ѻ҆свѧще́нный
    [r'''
        свѧще
        (?=
            нн?
            (
                [аиіеѣꙋы]\B
                # ! свѧщеннолѣп- свѧщеннотайн-
                |о(?![дилт]|мон)
            )
        )
        ''', OX, 'i'],

    # посвѧща̀ти
    [r'свѧща\B', OX, 'i'],
    [r'свѧщꙋ\b', VA, 'i'],

    # себе
    [r'\bсеб[еѣє]\b', VA, 'i'],
    # сего̀
    [r'\bсего\b', VA, 'i'],
    # се́й
    [r'\bсе(?=й\b)', OX, 'i'],
    # сеѧ̀ сїѐ
    [r'\bс(еѧ|іе)\b', VA, 'i'],
    # сі́и
    [r'\bсі(?=и\b)', OX, 'i'],

    [r'селе(?=ні)', OX, 'i'],

    [r'\bсе(?=мъ\b)', OX, 'i'],

    # сѣ́мо
    [r'\bсѣ(?=мо\b)', OX, 'i'],
    # сѣ́нь
    [r'''
        сѣ(?=н
            (?!
                (
                н?[оѡ](вн|писан)
                |ен
                |[иѧ]
                )
            )
        )
        ''', OX, 'i'],

    [r'серафі(?=м)',    OX, 'i'],
    [r'се(?=рг)',       OX, 'i'],

    [r'се(?=рдц([ꙋы]|[ѣе](мъ)?))', OX, 'i'],
    # [r'сердца\b',     VA, 'i'],  # от числа.
    # [r'сердца(?=м)',  GKA, 'i'],

    # сѣ́ть
    [r'\bсѣ(?=т)', OX, 'i'],

    [r'си(?=л([аеѣꙋы]|ою)\b)', OX, 'i'],
    [r'сілꙋа(?=н)', OX, 'i'],
    [r'\bсіѡ(?=н[аеѣоѡꙋъѧ]\b)', OX, 'i'],
    [r'си(?=рѣчь)', OX, 'i'],
    # си́це
    [r'\bси(?=це\b)', OX, 'i'],
    # сїѐ сїѧ̀ сїю̀
    [r'\bсі[еюѧ]\b', VA, 'i'],
    # cїѧ́нїе
    [r'\bсіѧ\B', OX, 'i'],

    [r'ски(?=тъ\b)',    OX, 'i'],
    [r'скит[аеѣꙋы]\b',  VA, 'i'],
    [r'скита\B',        OX, 'i'],
    [r'скито\B(?!н)',   OX, 'i'],

    # скорбѧ́щемъ
    [r'\bскорбѧ(?=[мщ])', OX, 'i'],
    # ско́рби (! скорбѧ́щ- )
    # [r'\bско(?=рб(?!ѧ[мщ]))', OX, 'i'],
    [r'\bско(?=рб(е[мхн]|н|и\b|ію|ь))', OX, 'i'],
    [r'\bскорбѣ(?=[влнт])', OX, 'i'],
    [r'\bскорбьми\b', VA, 'i'],

    [r'\bско(?=рѡ)', OX, 'i'],

    [r'сладча(?=йш)', OX, 'i'],

    # славле́нїе
    [r'славл[еѧ](?!нн)', OX, 'i'],
    # славосло́вїе
    [r'славосло(?=в)', OX, 'i'],
    # сла́ва сла́внаѧ (! славле́н- славосло́в-)
    [r'сла(?=в(?!ослов|л[еѧ]))', OX, 'i'],

    [r'сла(?=дост(?!раст|ьми))', OX, 'i'],

    # сле́зъ слеза̀ слеза́ми слезѧ́щи прослези́шасѧ
    [r'слез[аꙋ]\b',     VA, 'i'],
    [r'сле(?=з(([ыъ])|н([аоꙋы])))', OX, 'i'],
    [r'слеза(?=[мх])',  OX, 'i'],
    [r'слезо(?=[йю])',  OX, 'i'],
    [r'слезѧ(?=щ)',     OX, 'i'],
    [r'слези(?=[хш])',  OX, 'i'],

    [r'словес[аеиы]\b',     VA, 'i'],
    [r'словесе(?=[мх])',    OX, 'i'],
    [r'слове(?=съ\b)',      OX, 'i'],
    [r'слове(?=сн)',        OX, 'i'],
    [r'\bсло(?=в[еѣиоꙋьыъѧ]\b)', OX, 'i'],
    [r'сло(?=вомъ\b)',      OX, 'i'],

    [r'слꙋже\B', OX, 'i'],

    # смире́нїе смире́нно
    [r'смире(?=н(і|н(?!омꙋд)))', OX, 'i'],
    # смиренномꙋ́дрый
    [r'смиренномꙋ(?=д)', OX, 'i'],

    # снѣ́гъ снѣ́жный
    [r'снѣ(?!г(ам|осв)|жат)(?=[гж])', OX, 'i'],
    [r'собо(?=ю)', OX, 'i'],

    [r'согрѣ(?=всѧ|[ейстхюѧ]|ш(а\b|ш))', OX, 'i'],
    [r'согрѣва', OX, 'i'],

    [r'сокро(?=ви(?!щехр))', OX, 'i'],

    [r'со(?=лнц(?!ев|зр|[оѻѡ]б|св))', OX, 'i'],
    [r'со(?=лнеч)', OX, 'i'],

    [r'софрѡ(?=н)', OX, 'i'],

    # спа́съ спа́слъ спа́совъ спа́се спасе́нїе спасѝ спаси́тель спасо́шасѧ спаса́ти спасе́нъ спаса́ющїй
    [r'спас[иꙋ]\b',     VA, 'i'],
    [r'спа(?=с([аеѣ]|л?ъ|овъ)\b)', OX, 'i'],
    [r'спас[аеи]\B',    OX, 'i'],
    [r'спасо(?!въ)\B',  OX, 'i'],

    [r'сподо(?=би)', OX, 'i'],

    # стена́нїе стена́ньми
    [r'стена(?=н[іь])', OX, 'i'],
    [r'стенѧ(?=[йщ])',  OX, 'i'],
    [r'стенѧ\b',        VA, 'i'],
    # стѣна̀
    [r'стѣн[аеѣоꙋы]\b', VA, 'i'],
    # стѣно́ю
    [r'стѣно(?=ю)',     OX, 'i'],
    # стра́ждꙋщїй стра́ждетъ
    [r'стра(?=жд(ꙋщ|е))', OX, 'i'],

    [r'\bста(?=д[оꙋъѣ]\b)', OX, 'i'],
    [r'\bсти(?=хъ)',        OX, 'i'],
    [r'\bстіхи(?=р)',       OX, 'i'],

    [r'страда(?=[влнстхш])', OX, 'i'],
    # стра́хъ стра́шный стра́се
    [r'стра(?=(х(?!ован)|ше?н(?!і)|с[еѣ]))', OX, 'i'],

    # стра́сть стра́сти
    [r'стра(?=ст([иь]|но))', OX, 'i'],
    # страсте́мъ страстѧ́хъ
    [r'страст[еѧ](?=[ймх])', OX, 'i'],
    # страстна́ѧ
    [r'страстн[аоꙋ](?=[ейюѧ])', OX, 'i'],
    # страстоте́рпецъ
    [r'страстоте(?=рп)', OX, 'i'],

    [r'сꙋгꙋ(?=б(?!л))', OX, 'i'],

    # сы́нъ сыны̀ сы́номъ сы́не сыно́внїй сыново́мъ сыно́въ
    [r'\bсыны\b',           VA, 'i'],
    [r'\bсы(?=н([аеѣꙋъ]|омъ)\b)', OX, 'i'],
    [r'\bсын[оѡ](?=в[нъ])', OX, 'i'],
    [r'\bсыново(?=м)',      OX, 'i'],
    [r'\bсына(?=м[иъ])',    OX, 'i'],

    [r'\bсы(?=й\b)', OX, 'i'],

    # ттт tttt

    # та́къ та́коже та́кѡ та́кожде
    [r'\bта(?=к[ѡоъ](жд?е)?\b)', OX, 'i'],

    [r'\bта(?=же\b)',       OX, 'i'],
    [r'\bта(?=ѧ(же)?\b)',   OX, 'i'],
    [r'\bтꙋ(?=ю(же)?)',     OX, 'i'],
    [r'\bты(?=ѧ)',          OX, 'i'],

    # та́йна та́йнѣмъ та́йнымъ та́йномꙋ
    [r'та(?=йн([аеѣꙋыъ]|ом[ꙋъ]))', OX, 'i'],
    [r'та(?=ин(ъ|ство))',   OX, 'i'],
    [r'таи(?=нни)',         OX, 'i'],
    [r'та(?=йн[оѡ])',       OX, 'i'],

    [r'таѧ(?=щ)', OX, 'i'],

    [r'тва(?=рь)', OX, 'i'],

    [r'\bтвое\b',   VA, 'i'],
    [r'\bтвое?ѧ\b', VA, 'i'],
    [r'\bтвою\b',   VA, 'i'],
    [r'\bтвое(мꙋ|г[оѡ])\b', VA, 'i'],
    [r'\bтвое(?=[йю]|мъ)',  OX, 'i'],
    [r'\bтвои\b',           VA, 'i'],
    [r'\bтвои(?=хъ)',       OX, 'i'],
    [r'\bтвои(?=м[иъ])',    OX, 'i'],
    [r'\bтво(?=й)',         OX, 'i'],

    [r'твори\b', VA, 'i'],
    [r'твори\B', OX, 'i'],

    [r'\bтеб[еѣ]\b', VA, 'i'],
    [r'\bтѣ(?=мже)', OX, 'i'],

    # тѣ́ло тѣ́лꙋ
    [r'\bтѣ(?=л\w\b)',  OX, 'i'],
    # тѣле́сн-
    [r'\bтѣле(?=сн)',   OX, 'i'],
    # тѣлесѝ
    [r'\bтѣлес[еи]\b',      VA, 'i'],
    [r'\bтѣлесе(?=[мх])',   OX, 'i'],

    # тепло̀
    [r'\bтепло\b', VA, 'i'],
    # те́плый те́плой
    [r'\bте(?=пл([аеѣыꙋ]|о(?!хл|т|\b)))', OX, 'i'],
    # теплота̀
    [r'\bтеплот[аеѣоꙋы]\b', VA, 'i'],
    # теплото́ю
    [r'\bтеплото\B', OX, 'i'],
    # теплохла́дный
    [r'\bтеплохла(?=дн)', OX, 'i'],

    # терпѣ̀  терпѧ̀
    [r'терп[ѣиѧ]\b', VA, 'i'],
    # терпѣ́нїе
    [r'терпѣ\B(?!лив|ва)', OX, 'i'],
    # терпѣли́вый
    [r'терпѣли(?!во(д|мꙋд|нос|стра))(?=в)', OX, 'i'],
    # претерпѣва́ющи
    [r'терпѣва', OX, 'i'],

    # ти́хїй ( ! тихообразно )
    [r'\bти(?=х(?!(а\b|о[ѻѡг])))', OX, 'i'],
    [r'\bтиха\b',           VA, 'i'],
    [r'\bтишин[аѣоꙋы]\b',   VA, 'i'],
    [r'\bтишино(?=ю)',      OX, 'i'],

    # тлѣ́нъ тлѣ́нїе нетлѣ́нный тлѣ́ть
    [r'тлѣ(?=н[інъ]|т[иь])', OX, 'i'],
    # тлѝ  ! свѣ́тли  ᲂу҆ч҃тли
    [r'(?<!вѣ|уч)тли\b', VA, 'i'],
    # тобо́ю
    [r'\bтобо(?=ю)',    OX, 'i'],
    [r'\bтогда\b',      VA, 'i'],
    # то́кмѡ
    [r'то(?=кмѡ)', OX, 'i'],
    # Тро́ица
    [r'\bтро(?=[ий][цч])', OX, 'i'],

    # тропа́рь
    [r'\bтропа(?=рь)',      OX, 'i'],
    [r'\bтропар[еѣиѧ]\B',   OX, 'i'],
    [r'\bтропар[еѣиюѧ]\b',  VA, 'i'],

    # тьма̀ тьмѣ̀
    [r'\bтьм[аѣꙋы]\b', VA, 'i'],

    # ууу uuu

    # ᲂу҆́бѡ
    # [r'^[Оᲂ]у(?=бѡ\b)',      IS, 'i'],
    [r'^[Оᲂ]у(?=бѡ\b)',      IS, 'i'],
    [r'^[Оᲂ]убо(?=[гз])',    OX, 'i'],
    # ᲂу҆вы̀
    [r'^[Оᲂ]увы\b', VA, 'i'],
    [r'^[Оᲂ]угаси(?=ти)', OX, 'i'],
    [r'^[Оᲂ]угаси\b', VA, 'i'],
    [r'^[Оᲂ]у(?=гл)', IS, 'i'],
    [r'^[Оᲂ]угото(?=в(?!лѧ))', OX, 'i'],
    # ᲂу҆́дъ ᲂу҆́ды
    [r'^[Оᲂ]у(?=д[ыъ]\b)', IS, 'i'],
    [r'^[Оᲂ]уже\b', VA, 'i'],
    # ᲂу҆́зримъ
    [r'^[Оᲂ]у(?=зри([мт]ъ|тсѧ|иш|ѧтъ|ю)\b)', IS, 'i'],

    # )
    # JustForTest = (

    # ᲂу҆зрѣ
    [r'^[Оᲂ]узрѣ\b', VA, 'i'],
    # ᲂу҆зрѣша
    [r'^[Оᲂ]узрѣ\B', OX, 'i'],

    # ᲂу҆́зы
    [r'^[Оᲂ]у(?=з[ыъ]\b)', IS, 'i'],
    [r'^[Оᲂ]украша\B', OX, 'i'],

    # ᲂу҆крепле́нїе ᲂу҆крѣплѧ́ше
    [r'^[Оᲂ]укрѣпл[еѧ]',    OX, 'i'],
    [r'^[Оᲂ]укрѣпи\B',      OX, 'i'],
    [r'^[Оᲂ]укрѣпи\b',      VA, 'i'],

    # ᲂу҆миле́нїе ᲂу҆миле́нный
    [r'^[Оᲂ]умиле(?=н)',    OX, 'i'],
    [r'^[Оᲂ]уми(?=льн)',    OX, 'i'],
    [r'^[Оᲂ]умира\B',       OX, 'i'],
    # ᲂу҆́мъ ᲂу҆́мный ᲂу҆́мно ᲂу҆́ме
    [r'''
        ^[Оᲂ]у
        (?=
            м
            (
                [ъеѣ]\b # ᲂу҆́м ᲂу҆́ме
                |н
                (?!
                    [еѣ] # ! ᲂумнѣй-
                    |о\B # ! ᲂумножая
                )
            )
        )
        ''', IS, 'i'],

    # ᲂу҆мы̀ ᲂу҆мꙋ̀
    [r'^[Оᲂ]ум[аꙋы]\b', VA, 'i'],

    # ᲂу҆мно́жить ᲂу҆мно́жꙋ
    [r'^[Оᲂ]умно(?=ж[иꙋ])', OX, 'i'],
    # ᲂу҆множа́ти
    [r'^[Оᲂ]умножа(?=\w)', OX, 'i'],

    [r'^[Оᲂ]униже(?=ні)', OX, 'i'],
    [r'^[Оᲂ]уни(?=женн)', OX, 'i'],

    [r'^[Оᲂ]уны\b',             VA, 'i'],
    [r'^[Оᲂ]уны(?=[лн]|вш)',    OX, 'i'],
    [r'^[Оᲂ]уныва\B',           OX, 'i'],

    [r'^[Оᲂ]упас[иꙋ]\b',        VA, 'i'],
    [r'^[Оᲂ]упова\b',           VA, 'i'],
    [r'^[Оᲂ]упова\B',           OX, 'i'],
    [r'^[Оᲂ]уподо(?=б(?!лѧ))',  OX, 'i'],
    [r'^[Оᲂ]управлѧ\B',         OX, 'i'],

    [r'^[Оᲂ]усе(?=рд)',     OX, 'i'],
    # ᲂу҆слы́ши слы́шати
    [r'^[Оᲂ]у?слы(?=ш)',    OX, 'i'],
    [r'^[Оᲂ]успе(?=ні)',    OX, 'i'],

    # ᲂу҆ста̀ ᲂу҆сты̀ ᲂу҆стнѐ ᲂу҆ста́хъ ᲂу҆ста́ми ᲂу҆сте́нъ ᲂу҆сте́хъ
    [r'^[Оᲂ]устн?[аеы]\b',      VA, 'i'],
    [r'^[Оᲂ]устн?а(?=[мх])',    OX, 'i'],
    [r'^[Оᲂ]усте(?=[нх])',      OX, 'i'],
    [r'^[Оᲂ]у(?=стъ)',          IS, 'i'],

    # ᲂу҆твердѝ
    [r'^[Оᲂ]утверди\b', VA, 'i'],
    # ᲂу҆тверди́ша
    [r'^[Оᲂ]утверди\B', OX, 'i'],

    # ᲂу҆твержде́нный
    [r'^[Оᲂ]утвержде(?=н)',     OX, 'i'],
    # ᲂу҆твержда́еши
    [r'^[Оᲂ]утвержда(?=\w)',    OX, 'i'],
    [r'^[Оᲂ]утверже(?=ні)',     OX, 'i'],

    # ᲂу҆тѣ́ха
    [r'^[Оᲂ]утѣ(?=х\w\b)', OX, 'i'],
    # ᲂу҆тѣше́нїе
    [r'^[Оᲂ]утѣше(?=ні)', OX, 'i'],
    # ᲂу҆тѣ́ши ᲂу҆тѣ́шꙋ ᲂу҆тѣ́шитель ᲂу҆тѣ́шивъ
    [r'''
        ^[Оᲂ]утѣ
        (?=
            ш
            (
                ([иꙋ]|енъ)\b
                |и
                (
                    тел
                    # (?!ьн) #? !ᲂу҆тѣши́тельный
                    |в
                ) 
            )
        )
        ''', OX, 'i'],

    # ᲂу҆тѣша́ти
    [r'^[Оᲂ]утѣша\B', OX, 'i'],
    # ᲂу҆тѣши́тельный ???
    # [r'^[Оᲂ]утѣши(?=тельн)', OX, 'i'],

    [r'^[Оᲂ]утоли\b',       VA, 'i'],
    [r'^[Оᲂ]утоли\B',       OX, 'i'],
    [r'^[Оᲂ]утолѧ\B',       OX, 'i'],
    [r'^[Оᲂ]у(?=тренн)',    IS, 'i'],
    [r'^[Оᲂ]у(?=тро(?![бийю]))', IS, 'i'],
    [r'^[Оᲂ]утро(?=б)',     OX, 'i'],
    [r'^[Оᲂ]учи(?=т)',      OX, 'i'],

    # ᲂу҆́хо ᲂу҆́ши
    [r'^[Оᲂ]у(?=[хш][оиы]\b)', IS, 'i'],


    # ффф fff
    [r'фарісе', OX, 'i'],
    [r'\bѳѡм[аеѣоꙋы]\b', VA, 'i'],

    [r'\bхвали(?=т[ни])', OX, 'i'],

    [r'ходи(?=ша)', OX, 'i'],
    # хор хорови
    [r'\bхо(?=р([ъаꙋеѣ]|о(мъ|ви))\b)', OX, 'i'],
    [r'хлѣ(?=б)', OX, 'i'],

    [r'ѳавѡ(?=р)', OX, 'i'],

    # храм
    [r'хра(?=м)', OX, 'i'],
    # хранѝ сохрани́хомъ
    [r'(со)?храни\b', VA, 'i'],
    [r'(со)?храни\B', OX, 'i'],

    # хрїсто́съ
    [r'хрісто(?=[вмс])',    OX, 'i'],
    # хрїста̀
    [r'хріст[аеѣꙋ]\b',      VA, 'i'],

    # ца́рь ца́рскїй
    [r'ца(?=р([сь]))',  OX, 'i'],
    # царю̀
    [r'цар[иеѣюѧ]\b',   VA, 'i'],
    # царе́ви
    [r'цар[еє]\B',      OX, 'i'],
    # цари́ца
    [r'цари(?=ц)',      OX, 'i'],

    # цвѣ́тъ цвѣ́те цвѣ́лъ цвѣ́томъ
    [r'''
        цвѣ
        (?=
            (
                т
                (
                    [еѣꙋиъ]
                    |омъ
                )
            )\b
            |лъ
        )
        ''', OX, 'i'],

    # це́рковь це́ркви
    [r'це(?=рк(в(?!([аѧ]м|ей))|овь))', OX, 'i'],
    # церква́ми церквѧ́ми
    [r'церкв[аѧ](?=м)', OX, 'i'],
    # церкве́й
    [r'церкве(?=й)',    OX, 'i'],
    # церко́вный
    [r'церко(?=вн)',    OX, 'i'],

    [r'\bча(?=д(?!о[лрт]))',    OX, 'i'],
    [r'\bчадолюби(?=в)',        OX, 'i'],
    [r'\bча(?=съ\b)',           OX, 'i'],
    # ча́ѧше
    [r'ча(?=ѧ)', OX, 'i'],
    # человѣ́къ
    [r'человѣ(?=ч|к(?!олюб))', OX, 'i'],
    # человѣколю́бный
    [r'человѣколю(?=б)', OX, 'i'],

    [r'честно(?=мꙋ)',   OX, 'i'],
    [r'честн[аꙋы]\B',   OX, 'i'],
    [r'честна\b',       VA, 'i'],
    [r'честно(?!с[тл])\B',  OX, 'i'],
    [r'честнѣ(?=йш|мъ)',    OX, 'i'],
    [r'че(?=сть)',          OX, 'i'],

    # чи́стый чи́стꙋю чи́стей чи́стилъ
    [r'(?<!мра)чи(?=ст(?!от|ейш|илищ|итель))', OX, 'i'],
    # чистота̀
    [r'чистот[аеѣꙋы]\b', VA, 'i'],
    # чистото́ю
    [r'чистото(?=ю)', OX, 'i'],
    # чисте́йшаѧ
    [r'чист[еѣ](?=йш)', OX, 'i'],
    # ѡ҆чисти́тельный
    [r'чисти(?=тель)', OX, 'i'],
    [r'чте(?=ні)', OX, 'i'],
    [r'что\b', VA, 'i'],
    # чꙋ́домъ чꙋ́до
    [r'чꙋ(?=дн(?!ѣйш))',    OX, 'i'],
    [r'чꙋ(?=до(мъ)?\b)',    OX, 'i'],
    # чꙋдесѐ чꙋдесы̀ чꙋдесе́хъ чꙋдеса́ми
    [r'чꙋдес[аеиы]\b',      VA, 'i'],
    [r'чꙋдес[аеє](?=[мх][иъ])', OX, 'i'],

    [r'\bю(?=же\b)', IS, 'i'],
    # ю҆нѣ́йшїй
    [r'\bюнѣ(?=йш)', OX, 'i'],
    # ю҆́ность
    [r'\bю(?!н([еєѣ]|ц([аы]|[еєѡ])))', IS, 'i'],
    # ю҆нцы̀
    [r'\bюнц[аеѣꙋы]\b', VA, 'i'],

    [r'\bꙗви\b', VA, 'i'],
    [r'\bꙗви\B', OX, 'i'],
    # ꙗ҆́вѣ
    [r'\bꙗ(?=вѣ\b)',        IS, 'i'],
    # ꙗ҆́вно ꙗ҆́вственно ꙗ҆́вльсѧ
    [r'\bꙗ(?=в(ль|ст|н))',  IS, 'i'],

    [r'\bꙗ(?=дш)',          IS, 'i'],
    [r'\bꙗ(?=звен)',        IS, 'i'],
    [r'\bꙗ(?=р[оѡ]ст)',     IS, 'i'],
    [r'\bꙗ(?=(ко)?же\b)',   IS, 'i'],
    [r'\bꙗ(?=кѡ\b)',        IS, 'i'],

    # ПРЕДЛОГИ + ерок
    [r'\b(из|над|ѡб|под|пред)ъ\b', ER, 'i'],

    # Суффиксы, окончания и т.д. с ударением
    [r'(?<!мн[оѡ]ж)а(?=йш)', OX, 'i'],
    # -лѧющ-
    [r'лѧ(?=ющ)', OX, 'i'],
    # полага́хꙋ
    [r'[гжмнрстхцчщ]а(?=хꙋ)', OX, 'i'],
    # ѡ҆бнища́хомъ
    [r'[жзнрсчщ]а(?=хомъ)', OX, 'i'],

    # [r'', r''],
    # [r'', r''],
    # [r'', r''],

    # months
    [r'септе(?=мвріа)',  OX, 'i'],
    [r'ктѡ(?=вріа)',    OX, 'i'],
    [r'ное(?=мвріа)',    OX, 'i'],
    [r'деке(?=мвріа)',   OX, 'i'],
    [r'іаннꙋа(?=ріа)',  OX, 'i'],
    [r'еврꙋа(?=ріа)',   OX, 'i'],
    [r'ма(?=рта)',      OX, 'i'],
    [r'апрі(?=ліа)',     OX, 'i'],
    [r'\bма(?=іа)',     OX, 'i'],
    [r'іꙋ(?=[лн]іа)',   OX, 'i'],
    [r'а(?=ѵгꙋста)',    IS, 'i'],

)

# Выставить титла
# TODO: учесть 'i' в случае прописных букв
# в правиле [r'(а)посто(?=л)', r'\1п' + titlo_s, 'i'],
# в замене "п" всегда будет строчной.
# решение: брать в скобки и эту часть
# [r'(ап)осто(?=л)', r'\1' + titlo_s, 'i'],
regs_titles_set = (
    [r'(?<!ѵ)(а)нге(?=л)', r'\1гг' + titlo, 'i'],
    [r'(ап)осто(?=л)', r'\1' + titlo_s, 'i'],
    [r'(бл)а(г)ода(?=т)', r'\1\2' + titlo_d, 'i'],
    [r'(бл)а(г)осло(?=в)', r'\1\2' + titlo_s, 'i'],
    [r'(бл)а(?=[гж])', r'\1' + titlo, 'i'],
    [r'''
        \b
        (б)о(г)
        (?=
            [аеꙋъ]\b
            |а\B(?![тщ])
            |о(?!родиц|хꙋл|мерз) # ???
        )
        ''', r'\1\2' + titlo, 'i'],

    [r'(б)огороди(ц)', r'\1\2' + titlo_d, 'i'],
    [r'''
        \b
        (б)о(ж)
        (?=і|е(ств|\b))
        ''', r'\1\2' + titlo, 'i'],

    [r'\b(б)о(з)(?=ѣ)', r'\1\2' + titlo, 'i'],
    [r'(вл)ады(?=[кчц])', r'\1' + titlo_d, 'i'],
    [r'(воскр)е(?=с\w\b)', r'\1' + titlo, 'i'],
    [r'(воскр)есе?(?=\w\B)', r'\1' + titlo_s, 'i'],
    [r'\b(гл)агол', r'\1' + titlo, 'i'],
    [r'\b(гла)съ', r'\1' + titlo_s, 'i'],
    [r'\b(г)оспо(д)', r'\1' + titlo_s, 'i'],
    [r'\b(г)ос(п)о(?=ж)', r'\1' + titlo_s, 'i'],

    [r'\b(д)а(в)и(?=д)', r'\1' + titlo, 'i'],

    # дѣва
    [r'''
        \b
        (присно)?
        ( 
            д 
        )
        (?P<remove> # <- указание удалить ударение
            ѣ
        )
        (в)
        (?=[аеѣиоꙋы])
        ''',
     r'\1\2\3' + titlo, 'i'],

    [r'(д)ѣ(в)с(?=тв)', r'\1' + titlo_s, 'i'],
    [r'\b(д)е(н)(?=ь)', r'\1' + titlo, 'i'],
    [r'\b(дн)е(?=сь)', r'\1' + titlo, 'i'],
    [r'\b(д)ꙋ(х)', r'\1' + titlo, 'i'],

    # !!! два титла
    [r'''
        \b
        (б)о?(г)
        (о?д)ꙋ(х)''',
     r'\1\2' + titlo + r'\3\4' + titlo, 'i'],

    [r'\b(д)ꙋ(ш)', r'\1\2' + titlo, 'i'],
    [r'\b(д)ꙋ(с)(?=[еѣ]\b)', r'\1\2' + titlo, 'i'],
    [r'\b(єѵ)анге(?=л)', r'\1' + titlo_g, 'i'],
    [r'(іер)ꙋса(?=л)', r'\1' + titlo_s, 'i'],
    [r'(і)зра(и)(?=л)', r'\1\2' + titlo, 'i'],
    [r'(іи)сꙋ(?=с)', r'\1' + titlo, 'i'],
    [r'(им)ѧ(?=рек)', r'\1' + titlo, 'i'],
    [r'\b(кр)ес(?=т)', r'\1' + titlo_s, 'i'],
    [r'\b(м)а(р)(?=(і[аеѣиюѧ]))', r'\1\2' + titlo, 'i'],

    # ма́терь ма́ти
    [r'''
        \b
        (?P<prefix>
            (?:
                б(?:г҃|ог)о
                |д(?:ѣв|в҃)о
            )?
        )   
        (?P<m>м)а(?P<t>т)
        (?=
            и
            |ер
        )
        ''', r'\g<prefix>\g<m>\g<t>' + titlo, 'i'],
    [r'(м)ѣсѧ(ц)(?=ъ)', r'\1\2' + titlo_s, 'i'],
    [r'(м)и(л)осе(?=рд)', r'\1\2' + titlo_s, 'i'],
    [r'(м)и(л)ос(?=т)', r'\1\2' + titlo_s, 'i'],
    # [r'(м)оли(?=тв)', r'\1л' + titlo, 'i'],
    [r'(м)о(л)и(?=тв)', r'\1\2' + titlo, 'i'],
    [r'(м)ꙋд(?=р)', r'\1' + titlo_d, 'i'],
    [r'(м)ꙋ(ч)е(?=ни[кчц])', r'\1\2' + titlo, 'i'],
    [r'(мл)аде(?=не?[чц])', r'\1' + titlo_d, 'i'],
    [r'\b(н)е(б)(?=\w\b)', r'\1\2' + titlo, 'i'],
    [r'\b(н)е(б)ес(?=н)', r'\1\2' + titlo_s, 'i'],
    [r'\b(н)едѣ(л)', r'\1\2' + titlo_d, 'i'],
    [r'(н)ы(н)(?=ѣ)', r'\1\2' + titlo, 'i'],
    [r'(ѻ)те?(ц)', r'\1\2' + titlo, 'i'],  # @@@ вариат.
    [r'(ѻ)те?(ч)(?!ест|а(ѧн|йш))', r'\1\2' + titlo, 'i'],  # @@@ вариат.
    [r'(пр)а(в)ед(?=е?н)', r'\1\2' + titlo_d, 'i'],
    [r'(пр)е(п)одо(?=б(е?н))', r'\1\2' + titlo_d, 'i'],
    [r'(пр)ед(?=теч)', r'\1' + titlo_d, 'i'],
    [r'(пр)ис(?=нѡ\b)', r'\1' + titlo_s, 'i'],
    [r'(пр)о(?=ро[кч])', r'\1' + titlo_o, 'i'],
    [r'(р)о(ж)дес(?=тв)', r'\1\2' + titlo_s, 'i'],
    [r'(с)вѧ([тщ])', r'\1\2' + titlo, 'i'],
    [r'(с)е(р)де?(?=[цч])', r'\1\2' + titlo_d, 'i'],
    # FIXME: смр҃ть (??? вариант см҃рть)
    [r'(см)е(?=рт)', r'\1' + titlo, 'i'],
    [r'(сп)а(?=с)', r'\1' + titlo, 'i'],

    # страсть
    [r'''
        (?<!ладо)
        (стр)
        (?P<remove>
            а
        )
        с(?=т)
        ''', r'\1' + titlo_s, 'i'],

    [r'(с)ы(н)(?=[аеєѣоѡꙋъ])', r'\1\2' + titlo, 'i'],  # @@@ вариант.
    [r'(тр)ои(?=[цч])', r'\1' + titlo_o, 'i'],
    [r'(?<!нт[иі])(хр)іс(?=т)', r'\1' + titlo_s, 'i'],
    [r'(ч)е(л)о(?=вѣ[кч])', r'\1\2' + titlo, 'i'],
    [r'(ч)ес(?=тн)', r'\1' + titlo_s, 'i'],
    [r'(?<!мра)(ч)ис(?=т)', r'\1' + titlo_s, 'i'],
    [r'(ц)а(р)с', r'\1\2' + titlo_s, 'i'],
    [r'(ц)а(р)(?=\w)', r'\1\2' + titlo, 'i'],
    [r'(ц)е(р)(?=к)', r'\1\2' + titlo, 'i'],
)

# Раскрыть титла
# TODO: если все буквы - прописные
# убрать 'i', ввести ([Аа])
# написать правила для прописных букв
regs_titles_open = (
    [r'(а)гг' + titlo, r'\1нге', 'i'],
    [r'(а)п' + titlo_s, r'\1посто', 'i'],
    [r'(б)л' + titlo + r'([гж])', r'\1ла\2', 'i'],
    [r'(б)лг' + titlo_d, r'\1лагода', 'i'],
    [r'(б)лг' + titlo_s, r'\1лагосло', 'i'],
    [r'(б)([гжз])' + titlo, r'\1о\2', 'i'],
    [r'(б)ц' + titlo_d, r'\1огородиц', 'i'],
    [r'(в)л' + titlo_d, r'\1лады', 'i'],
    [r'\b(г)л' + titlo, r'\1лагол', 'i'],
    [r'\b(г)ла' + titlo_s, r'\1ласъ', 'i'],
    [r'\b(г)д' + titlo_s, r'\1оспод', 'i'],
    [r'\b(г)п' + titlo_s + r'ж', r'\1оспож', 'i'],
    [r'\b(д)в' + titlo + r'д', r'\1авид', 'i'],
    [r'\b(д)в' + titlo + r'(?=[аеѣиоꙋы])', r'\1ѣв', 'i'],
    [r'(д)в' + titlo_s + r'(?=тв)', r'\1ѣвс', 'i'],
    [r'\b(д)н' + titlo + r'(?=ь)', r'\1ен', 'i'],
    [r'\b(д)н' + titlo + r'(?=сь)', r'\1не', 'i'],
    [r'(д)х' + titlo, r'\1ꙋх', 'i'],
    [r'\b(д)ш' + titlo, r'\1ꙋш', 'i'],
    [r'\b(д)с' + titlo + r'(?=[еѣ]\b)', r'\1ꙋс', 'i'],
    [r'\b(є)ѵ' + titlo_g + r'(?=л)', r'\1ѵанге', 'i'],
    [r'(і)ер' + titlo_s + r'(?=л)', r'\1ерꙋса', 'i'],
    [r'(і)и' + titlo + r'(?=л)', r'\1зраи', 'i'],
    [r'(і)и' + titlo + r'(?=с)', r'\1исꙋ', 'i'],
    [r'(и)м' + titlo + r'(?=рек)', r'\1мѧ', 'i'],
    [r'\b(к)р' + titlo_s + r'(?=т)', r'\1рес', 'i'],
    [r'\b(м)р' + titlo + r'(?=(і[аеѣиюѧ]))', r'\1ар', 'i'],
    [r'(м)т' + titlo + r'(?=и|ер)', r'\1ат', 'i'],
    [r'(м)ц' + titlo_s + r'(?=ъ)', r'\1ѣсѧц', 'i'],
    [r'(м)л' + titlo_d + r'(?=не?[чц])', r'\1ладе', 'i'],
    [r'(м)л' + titlo_s + r'(?=рд)', r'\1илосе', 'i'],
    [r'(м)л' + titlo_s + r'(?=т)', r'\1илос', 'i'],
    [r'(м)л' + titlo + r'(?=тв)', r'\1оли', 'i'],
    [r'м' + titlo_d + r'(?=р)', r'мꙋд', 'i'],
    [r'(м)ч' + titlo + r'(?=н)', r'\1ꙋче', 'i'],
    [r'\b(н)б' + titlo + r'(?=\w\b)', r'\1еб', 'i'],
    [r'\b(н)б' + titlo_s + r'(?=н)', r'\1ебес', 'i'],
    [r'\b(н)л' + titlo_d, r'\1едѣл', 'i'],
    [r'(н)н' + titlo + r'(?=ѣ)', r'\1ын', 'i'],
    [r'(ѻ)ц' + titlo + r'(?=ъ)', r'\1тец', 'i'],
    [r'(ѻ)ц' + titlo + r'(?=[аеєѣоꙋы])', r'\1тц', 'i'],
    [r'(ѻ)ч' + titlo + r'(?=ес|н)', r'\1теч', 'i'],  #
    [r'(ѻ)ч' + titlo, r'\1тч', 'i'],  #
    [r'(п)рв' + titlo_d + r'(?=е?н)', r'\1равед', 'i'],
    [r'(п)рп' + titlo_d + r'(?=б(е?н))', r'\1реподо', 'i'],
    [r'(п)р' + titlo_d + r'(?=теч)', r'\1ред', 'i'],
    [r'(п)р' + titlo_s + r'(?=нѡ\b)', r'\1рис', 'i'],
    [r'(п)р' + titlo_o + r'(?=ро[кч])', r'\1ро', 'i'],
    [r'(р)ж' + titlo_s + r'(?=тв)', r'\1ождес', 'i'],
    [r'(с)([тщ])' + titlo, r'\1вѧ\2', 'i'],
    [r'(с)р' + titlo_d + r'(?=цъ\b|чн)', r'\1ерде', 'i'],
    [r'(с)р' + titlo_d + r'(?=ц)', r'\1ерд', 'i'],
    [r'(с)мр' + titlo + r'(?=т)', r'\1мер', 'i'],
    [r'(с)п' + titlo + r'(?=с)', r'\1па', 'i'],
    [r'(с)тр' + titlo_s + r'(?=т)', r'\1трас', 'i'],
    [r'(с)н' + titlo + r'(?=[аеєѣоꙋъ])', r'\1ын', 'i'],  # @@@ вариат.
    [r'(т)р' + titlo_o + r'(?=[цч])', r'\1рои', 'i'],
    [r'(х)р' + titlo_s + r'(?=т)', r'\1рїс', 'i'],
    [r'(ч)л' + titlo + r'(?=вѣ[кч])', r'\1ело', 'i'],
    [r'(ч)' + titlo_s + r'(?=тн)', r'\1ес', 'i'],
    [r'(ч)' + titlo_s + r'(?=т)', r'\1ис', 'i'],
    [r'(ц)р' + titlo_s, r'\1арс', 'i'],
    [r'(ц)р' + titlo + r'(?=\w\b)', r'\1ар', 'i'],
    [r'(ц)р' + titlo + r'(?=иц)', r'\1ар', 'i'],
    [r'(ц)р' + titlo + r'(?=к)', r'\1ер', 'i'],
)

# TODO: стат. анализ словаря
regs_acutes_morph = (
    # при анализе словаря
    # https://www.ponomar.net/files/wordlist.tsv
    # можно выбрать буквосочетания
    # с ударениями а также определить исключения, если их немного
    # например для -лѧю[щт]- одно исключение
    # 5     1     лѧ̑ющ     лѧющ (и҆спра́влѧюще )
    # 130   0     лѧ́ют     лѧют
    # 593   1     лѧ́ющ     лѧющ (и҆спра́влѧюще )
    #
    # 1 ст. - кол-во совпадений в словаре
    # выбранного фрагмента (3-й ст.)
    # 2 ст. - кол-во совпадений в словаре
    # для выбранного фрагмента, но без ударения (4-й ст.)
    # в скобках - полное слово для совпадения
    # (одно, в данном случае общее для -лѧ̑ющ- и -лѧ́ющ-)
)
