# _*_ coding: utf-8

from Letters import *

# Наборы регулярных выражений вида:
# [find, replace [, flags] ]
# компилируются перед запуском основной функции

# Буквы в словах: ѿ, ѡ, ѵ, ѣ, etc
regs_letters_in_word = (
    [  # ѿ
        r'''
        \bот
        (?!
            е?[цч]
            | да[нт]
            | враща
            | врещи
            | в[еѣ][тщ]
            | жен
            | зд[еѣ]
            | иш
            | крове
            | расль
            | реб
            | ри\b
            | ро[кч]
                  
        )
        ''',
        r'ѿ'
    ],  # или наоборот, перечислить ѿ ?

    [  # Ѿ
        r'''
        \bОт
        (?!
            е?ц
            | е?ч
            | да[нт]
            | враща
            | врещи
            | в[еѣ][тщ]
            | жен
            | зд[еѣ]
            | иш
            | крове
            | расль
            | реб
            | ри\b
            | ро[кч]
            
        )
        ''',
        r'Ѿ'
    ],  # или наоборот, перечислить ѿ ?
    [r'\b([Ѿѿ])ъ\b', r'\1'],

    [r'ейш', r'ѣйш'],


    [r'\bОу(?=[' + cu_cap_letters + r']+)', r'ОꙊ'],  # УМ -> ОꙊ҆МЪ
    [r'\bО\b', r'Ѽ'],  # как правило - обращение
    [r'\bо\b', r'ѡ'],
    [r'\bо', r'ѻ'],
    [r'\bО(?!у)', r'Ѻ'],

    [  # ᲂꙋ -> ᲂу (для исправления ошибок набора)
        # проблема: узкое о
        # на границе слова '\bᲂ' не работает
        # условно \b = не буквы (ноль или больше)
        # все не-буквы попадают в pref и post
        # и вырезаются (с сохранением) в начале,
        # поэтому можно (конкретно для этого случая) использовать
        # ^ - начало строки
        # Вариант:  cu_non_letter + '*' + unicNarrowO + '?ꙋ'
        r'^' + unicNarrowO + 'ꙋ',
        'ᲂу'
    ],
   
    
    [  # -ии- -> -їи-
        # TODO: -їѧ & -їа
        r'и(?=[аеєийоѡꙋюѧ])', r'ї'
    ],

    [r'И(?=[АЕЄИЙОѠꙊЮѦаеєийоѡꙋюѧ])', r'І'],
    [r'ᲂ+', r'ᲂ'],

    # Zvatelce for first letter of word
    [r'^([АЄИІѴѠЮꙖаєиіѻѡюꙗ]|Ѻ(?!ꙋ))', r'\1' + Zvatelce],
    
    # Исправление ошибочного парсинга
    # слово начинается с прописной У 
    # У -> Ꙋ -> Оу -> Ѻꙋ
    [r'Ѻꙋ', r'Оу'],  

    # =========================
    [r'([Аа])кафист', r'\1каѳїст'],
    [r'([Аа])нти(?=х)', r'\1нтї'],
    [r'([Аа])фо(?=н)', r'\1ѳѡ'],
    #
    [r'\bбед(?=[аеносꙋъы])', r'бѣд'],

    # -бѣг- -бѣж-
    [r'''  
        (
            \b(?:
                из|при|ѿ|на
            )?
            |^ᲂу
        )
        бе
        (?=
            (
                г
                |ж(?!д) # ! убежден-
            )
            [аеилноꙋъ]
        )
        ''',
     r'\1бѣ'
    ],

    [r'([Бб])езме(?=(р|ст)н)', r'\1езмѣ'],

    [r'(\b|^ᲂу)бел', r'\1бѣл'],
    [r'\bбес(?=[аиноѡꙋы])', r'бѣс'],
    [r'\bбе\b', r'бѣ'],
    [r'\bбесте\b', r'бѣсте'],
    [r'\bбех(?=(ом)?ъ\b)', r'бѣх'],
    [r'\bбеша\b', r'бѣша'],
    [r'\bбде(?=[нт])', r'бдѣ'],
    [r'([Бб])лагогове(?=й?н)', r'\1лагоговѣ'],
    [r'([Бб])оговеден', r'\1оговѣдѣн'],
    [r'\b([Бб])озе\b', r'\1озѣ'],
    [r'болезн', r'болѣзн'],

    # ========================
    #   вѣд вѣж вѣм вѣт вѣс вѣщ
    #   -вѣд-
    [r'''
        \b(не|из|([Зз]а|ис)?по)?
        вед
        (?=[аеиноыꙋь])
        ''',
     r'\1вѣд'
     ],
    [r'\b((не)?[Вв])ѣдені', r'\1ѣдѣнї'],
    #   -вѣж-
    [r'\b(не)?веж', r'\1вѣж'],

    #   -вѣм-
    [r'''
        \b((ис)?по)?
        вем
        (?=[ыъ])
        ''',
     r'\1вѣм'
     ],

    #   -вѣс-
    [r'\b([Нн]е|со)?вес(?=и\b|т)', r'\1вѣс'],

    #   -вѣт-
    [r''' 
        \b([Зз]а|из|ѻт|ꙋ|на|со)
        вет
        (?=[ълнаеиоѡꙋы])
        ''',
     r'\1вѣт'
     ],
    [r'веті(?=[иѧ])', r'вѣті'],

    #   -вѣщ-
    [r'''
        (?<!кле)
        вещ
        (?!
            # ! вещи, вещество
            (
                и
                |
                (
                    [еє]([ймх]|ств)
                    |ам[иъ]
                    |ь?ми
                )
            )
            # \b
        )
        ''',
     r'вѣщ'
     ],
    # ---- вѣд вѣж вѣм вѣт вѣс вѣщ ----

    # ========================
    # вѣк- вѣц- вѣч-
    [r'\bвек(?=[аеиꙋъ](ми)?\b)', r'вѣк'],
    [r'\bвековъ', r'вѣкѡвъ'],
    [r'веце(хъ)?', r'вѣцѣ\1'],
    [r'веч(?=е?н)', r'вѣч'],
    # ------------------------

    [r'вен(?=е?[чц])', r'вѣн'],
    [r'(\b(не|ѿ|в|ѕ|[Бб]лаго)?[Вв])ер(?=[аеиноꙋыѧ])', r'\1ѣр'],
    [r'ветв', r'вѣтв'],
    [r'вет(е?р)', r'вѣт\1'],

    [r'\b(нена)?видені', r'\1видѣнї'],
    [r'\bвин(?=[аеоу]\b|оград)', r'вїн'],
    [r'\bвиссон', r'вѵ́ссон'],
    [r'вменѧ', r'вмѣнѧ'],
    [r'возде(?=(ва)?ти|еши|ющ)', r'воздѣ'],
    [r'восп[еѣ]ва', r'воспѣва'],
    [r'врач[ьъ]', r'врачь'],
    [r'\b([Вв])се(?=(м[иъ]|хъ)\b)', r'\1сѣ'],
    [r'втайне', r'втайнѣ'],

    # чаще Въ чем ВЪ
    [r'\bВЪ\b', r'Въ'],

    [r'([Гг])ефсиман', r'\1еѳсїман'],
    [r'(([Гг])еѳсімані)ѧ', r'\g<1>а'],
    [r'(([Гг])еѳсіманійст)ей', r'\g<1>ѣй'],

    [r'гнев', r'гнѣв'],
    [r'горет', r'горѣт'],

    [r'([Гг])ресех', r'\1рѣсѣх'],
    [r'([Гг])ре(?=[схш])', r'\1рѣ'],

    [r'''
        \b
        ([Пп]рисно)?
        ([Дд])ев
        (?=[аеоꙋы]|ств|ическ)
        ''',
     r'\1\2ѣв'
     ],
    [r'\bдет(?!=инец)', r'дѣт'],
    [r'издетска', r'издѣтска'],
    [r'дел(?=[оаꙋ])', r'дѣл'],
    [r'деѧти', r'дѣѧти'],
    [r'([Дд])ивно', r'\1ивнѡ'],
    [r'\bдне\b', r'днѣ'],
    [r'добродетел', r'добродѣтел'],
    [r'([Дд])околе', r'\1околѣ'],
    [r'([Дд])оселе', r'\1оселѣ'],
    [r'\b([Дд])ꙋсе\b', r'\1ꙋсѣ'],

    [r'([Єє])в(?=ангел)', r'\1ѵ'],
    [r'([Єє])в(?=фрафовъ)', r'\1ѵ'],
    [r'([Єє])вхарист', r'\1ѵхарїст'],
    [r'([Єє])го\b', r'\1гѡ'],  # Род: єгѡ Вин.: єго
    [r'([Єє])лисе(?=\w)', r'\1лиссе'],  # var: єлїссей

    [r'желез', r'желѣз'],

    [r'([Зз])авес', r'\1авѣс'],
    [r'Звезд', r'Ѕвѣзд'],
    [r'звезд', r'ѕвѣзд'],
    [r'звер', r'ѕвѣр'],
    [r'\b([Зз])де(?=(сь)?\b)', r'\1дѣ'],
    [r'\b([Гг])де\b', r'\1дѣ'],
    [r'зело', r'ѕѣлѡ'],

    [r'зельне', r'ѕѣльнѣ'],
    [r'зельн', r'ѕѣльн'],

    [r'зениц', r'зѣниц'],
    [r'\b(?<!же)зл(?=[еѣіоꙋы]|а(?![зтцчщ]|га))', r'ѕл'],
    [r'зме(?=[йюѧ]\b|[еи]\w+)', r'ѕмѣ'],
    [r'(при)?зре(?=ти|ні|\b)', r'\1зрѣ'],

    [r'идеже', r'идѣже'],
    [r'И(?=зраил)', r'І'],
    [r'и(?=зраил)', r'і'],
    [r'изрѧдно', r'изрѧднѡ'],
    [r'\bикон', r'ікѡн'],
    [r'\bИкон', r'Ікѡн'],
    [r'икосъ', r'ікосъ'],
    [r'Икосъ', r'Ікосъ', 'i'],
    [r'([Іі])о(?=ан|аким|в|на|сиф|ил|ота)', r'\1ѡ'],
    [r'([Іі])ордан', r'\1ѻрдан'],
    [r'Ирмос', r'Ірмос'],
    [r'ирмос', r'ірмос'],
    [r'иссоп', r'ѵссѡп'],
    [r'исцелен', r'исцѣлен'],

    [r'\b([Кк])ако\b', r'\1акѡ'],
    [r'([Кк])олен', r'\1олѣн'],
    [r'крепк', r'крѣпк'],
    [r'крѣпко', r'крѣпкѡ'],
    [r'([Кк])репост', r'\1рѣпост'],
    [r'([Кк])ꙋпел', r'\1ꙋпѣл'],

    # лепо боголепный
    [r'''
        \b
        (
            (
                б
                (
                    (о|ла|л҃)г
                    |г҃
                )
                о 
            )?
            л
        )
        еп(?=н?[иіоы])
        ''',
        r'\1ѣп'
    ],
    [r'\bлес(?=[аъ])', r'лѣс'],
    [r'\bлестви(?=[чц])', r'лѣстви'],
    [r'\bлето', r'лѣто'],
    [r'\b(не|ѻб|раз)?лен(?=ь|ив|ост|ѧщ|ен)', r'\1лѣн'],
    [r'\b([Лл])итꙋрг', r'\1їтꙋрг'],

    [r'\b(из|от)?мер(?=[аеыу]\b|ил)', r'\1мѣр'],
    [r'мест(?=[аеѣоꙋ]\b)', r'мѣст'],
    [r'\b([Мм])е(?=сѧц)', r'\1ѣ'],
    [r'\b([Мм])не\b', r'\1нѣ'],
    [r'\b((со)?[Мм])не(?=ти\b|ні)', r'\1нѣ'],

    [r'надеѧ(?=ніе|тисѧ)', r'надѣѧ'],
    [r'надею(?=щі|с)', r'надѣю'],
    [r'намерен', r'намѣрен'],
    [r'([Нн])евест', r'\1евѣст'],
    [r'([Нн])егоже\b', r'\1егѡже'],
    
    # нѣгдѣ
    [r'\b([Нн])егде\b', r'\1ѣгдѣ'],
        
    [r'([Нн])едел', r'\1едѣл'],
    [r'недр', r'нѣдр'],
    [r'\bнежн', r'нѣжн'],

    # нѣкто нѣкогда нѣкїй
    [r'\b([Нн])е(?=к(огда|то|ій)\b)', r'\1ѣ'],
    
    # нѣ́мы
    [r'\bне(?=м([аіоꙋы]\w|ы)\b)', r'нѣ'],
    [r'\bнераде(?=ні)', r'нерадѣ'],
    [r'\b([Нн])еси\b', r'\1ѣси'],
    [r'\b([Нн])есм(?=[ыь]\b)', r'\1ѣсм'],
    [r'\b([Нн])ест(?=[еь]\b)', r'\1ѣст'],
    # нїкола́й
    [r'([Нн])икол(?!иже)', r'\1їкол'],
    [r'([Нн])ыне', r'\1ынѣ'],

    # TODO:
    # ѻ в середине слова праѻтє́цъ
    [r'оо(?!рꙋж|тв|з)', r'оѻ'],

    [r'Ѻбаче', r'Ѡбаче'],
    [r'ѻбаче', r'ѡбаче'],
    [r'ѻбесити', r'ѡбѣсити'],
    [r'ѻбет', r'ѻбѣт'],
    [r'ѻбеща', r'ѻбѣща'],
    [r'ѻбле(?=[цч])', r'ѡбле'],
    [r'Ѻбнов', r'Ѡбнов'],
    [r'ѻбнов', r'ѡбнов'],
    [r'\bѺбож', r'Ѡбож'],
    [r'\bѻбож', r'ѡбож'],
    [r'Ѻбраз', r'Ѡбраз'],
    # [r'((?<!о)[ѻо])браз', r'ѡбраз'],
    [r'[ѻо]браз', r'ѡбраз'],
    [r'оѻбра([жщ])', r'оѡбра\1'],
    [r'ѻблекоша', r'ѡблекоша'],
    [r'ѻбре(?=[лст])', r'ѡбрѣ'],
    [r'ѻбрѧщ', r'ѡбрѧщ'],

    [r'ѻб(ы|ъи)м(?=[аеиꙋ])', r'ѡбъим'],
    [r'ѻб(ы|ъи)д(?=[еиоꙋ])', r'ѡбъид'],
    [r'ѻб(ы|ъи)ти', r'ѡбъити'],

    [r'ѻбъѧ(?=[вдлстхш])', r'ѡбъѧ'],
    [r'ѻбъем', r'ѡбъем'],

    [r'ѻде(?=ва[еюѧ]|ющ|ѧ)', r'ѡдѣ'],
    [r'ѻж(?=[ежир])', r'ѡж'],
    [r'Ѻзар(?=[еєиѧ])', r'Ѡзар'],
    [r'ѻзар(?=[еєиѧ])', r'ѡзар'],
    [r'ѻкропи', r'ѡкропи'],
    [r'Ѻкрест', r'Ѡкрест'],
    [r'ѻкрест', r'ѡкрест'],
    [r'Ѻмы(?=\w)', r'Ѡмы'],  # ѡ҆мы́й
    [r'ѻмы(?=\w)', r'ѡмы'],
    [r'ѻправд', r'ѡправд'],
    [r'Ѻсен', r'Ѡсѣн'],
    [r'ѻсен', r'ѡсѣн'],
    [r'ѻтчаѧн', r'ѿчаѧн'],
    [r'Ѻчи(?=сти|щ)', r'Ѡчи'],
    [r'ѻчи(?=сти|щ)', r'ѡчи'],

    [r'\b([Пп])е(ні|сн|ти|л)', r'\1ѣ\2'],

    [r'''  
        (
            [зн]а       # напѣвъ
            |ѿ          # ѿпѣванїе
            |пр[ио]     # припѣвъ
            |[Пп]салмо  
            |р[ао]с     # распѣвъ
            |с          # спѣлъ
        )
        пе([влт])       # пѣти
    ''', r'\1пѣв'],

    [r'([Пп])лач[ьъ]\b', r'\1лачь'],
    [r'\bплен', r'плѣн'],
    [r'побе(?=ж?д)', r'побѣ'],
    [r'([Пп])онедельник', r'\1онедѣльник'],
    [r'([Пп])осе(?=[тщ])', r'\1осѣ'],
    [r'([Пп])осле', r'\1ослѣ'],
    [r'пререкан', r'прерѣкан'],
    [r'прилеж(?=а|н)', r'прилѣж'],
    [r'присещ', r'присѣщ'],
    [r'([Пп])рисно\b', r'\1риснѡ'],

    [r'Псал(?=о?м|т)', r'Ѱал'],
    [r'псал(?=о?м|т)', r'ѱал'],

    [r'([Рр])азве\b', r'\1азвѣ'],
    [r'реза', r'рѣза'],
    [r'([Рр]аз|[Ѿѿ])реш', r'\1рѣш'],
    # разумѣ-
    [r'разꙋме', r'разꙋмѣ'],
    # рѣчь
    [r'\bреч(?=[иь]|ам[иъ]\b)', r'рѣч'],
    # рѣка
    [r'\bрек(?=[аеѣиоꙋ])', r'рѣк'],
    [r'([Рр])осс', r'\1ѡсс'],

    [r'([Сс])аваоф', r'\1аваѡѳ'],
    [r'([Сс])ветле(?=[ей])', r'\1вѣтлѣ'],
    [r'([Сс])ве(?=[тщ])', r'\1вѣ'],
    [r'([Сс])вире(?=л)', r'\1вирѣ'],
    [r'([Сс])вѧтемъ', r'\1вѧтѣмъ'],
    [r'семо', r'сѣмо'],
    [r'\bсен(?=[иіь])', r'сѣн'],
    [r'\bсено', r'сѣно'],
    [r'''
        \b
        сет
        (?=([иь]|ію)\b|ѧм)
    ''', r'сѣт'],

    [r'''
        \bстен #
        (?!  # ! стенать
            а([нт][иіь]|ющ)
            |ѧ
        )
    ''', r'стѣн'],

    [r'\b([Сс])илꙋан', r'\1їлꙋан'],
    [r'\b([Сс])іон', r'\1їѡн'],
    [r'сиречь', r'сирѣчь'],

    [r'\b([Сс])корбе(?=ти|ні|л|вый)', r'\1корбѣ'],
    [r'\b([Сс])коро\b', r'\1корѡ'],

    [r'сне(?=[гж])', r'снѣ'],
    [r'совест', r'совѣст'],
    [r'([Сс])овет', r'\1овѣт'],
    [r'([Сс])огре', r'\1огрѣ'],
    [r'([Сс])офрон', r'\1офрѡн'],

    [r'([Тт])ако\b', r'\1акѡ'],
    [r'тайнемъ', r'тайнѣмъ'],
    # [r'([Тт])ебе\b', r'\1ебѣ'],  # ? в Дат. Предложн
    [r'\b([Тт])ел(?=[аоꙋ]|е(с[аеин]|х)?)', r'\1ѣл'],
    [r'([Тт])емже', r'\1ѣмже'],
    [r'([Тт])епле', r'\1еплѣ'],
    [r'([Тт])ерпе', r'\1ерпѣ'],
    [r'\b([Тт])ехъ', r'\1ѣхъ'],
    [r'([Тт])ле(?=н[інъ]|т[иь])', r'\1лѣ'],
    [r'\bтьме\b', r'тьмѣ'],
    [r'\bтокмо\b', r'токмѡ'],

    # граница слова для ᲂу :
    # (\b - для `ᲂ' не работает)
    # (?<=\W)ᲂу
    # или (?<=(\W))?ᲂу - И для начала строки
    # или ^ᲂу - только для начала строки
    # (в *этом* модуле ᲂу всегда должен оказаться
    # в начале строки, т.к.
    # - обрабатывается отдельное слово
    # без предшествующих буквам символов)
    [r'^([Оᲂ]у)б[оѡ]\b', r'\1бѡ'],
    [r'^([Оᲂ]у)зре', r'\1зрѣ'],
    [r'^([Оᲂ]у)кре', r'\1крѣ'],
    [r'^([Оᲂ]у)теш', r'\1тѣш'],

    [r'\bФавор', r'Ѳавѡр'],
    [r'\bфавор', r'ѳавѡр'],
    [r'фарисе', r'фарїсе'],
    # Ѳѡма̀
    [r'\bФом(?=\w)', r'Ѳѡм'],
    [r'\bфом(?=\w)', r'ѳѡм'],


    [r'([Хх])леб', r'\1лѣб'],
    [r'([Хх])рист', r'\1рїст'],

    [r'царск[ао]го', r'царскагѡ'],
    [r'([Цц])ве(?=[лст])', r'\1вѣ'],
    [r'цел(?=[еєиюѧ]|ьб|омꙋ)', r'цѣл'],

    [r'([Чч])елове(?=[кч])', r'\1еловѣ'],
    [r'([Чч])естнейш', r'\1естнѣйш'],

    [r'([Ꙗꙗ])ве\b', r'\1вѣ'],
    [r'([Ꙗꙗ])ко\b', r'\1кѡ'],

    [r'', r'0'],
    [r'', r'1'],
    [r'', r'2'],
    [r'', r'3'],
    [r'', r'4'],
    [r'', r'5'],
    [r'', r'6'],
    [r'', r'7'],
    [r'', r'8'],
    [r'', r'9'],

    # months
    [r'ентѧбрѧ', r'ептемврїа'],
    [r'ктѧбрѧ', r'ктѡврїа'],
    [r'оѧбрѧ', r'оемврїа'],
    [r'екабрѧ', r'екемврїа'],
    [r'ꙗнварѧ', r'іаннꙋарїа'],
    [r'Ꙗнварѧ', r'Іаннꙋарїа'],
    [r'евралѧ', r'еврꙋарїа'],
    [r'([Мм])арта\b', r'\1арта'],
    [r'прелѧ', r'прілїа'],
    [r'\b([Мм])аѧ\b', r'\1аїа'],
    [r'([Іі])ю([лн])ѧ\b', r'\1ꙋ\2їа'],
    [r'([Аа])вгꙋста', r'\1ѵгꙋста'],
)

# Ударения

regs_acutes = (
    [r'\b([Аа])(?=біе)\b', r'\1' + Iso],
    [r'\b([Аа])(?=вел)', r'\1' + Iso],
    [r'\b([Аа])(?=гне?[цч])', r'\1' + Iso],
    [r'\b([Аа])(?=д[ауѣеъ]\b)', r'\1' + Iso],
    [r'\b([Аа])да(?=м)', r'\1да' + Oxia],
    [r'\b([Аа])(?=зъ\b)', r'\1' + Iso],
    [r'([Аа])ка(?=ѳіст)', r'\1ка' + Oxia],
    [r'([Аа])(?=ки\b)', r'\1' + Iso],
    [r'([Аа])ллилꙋ(?=іѧ)', r'\1ллилꙋ' + Oxia],
    [r'([Аа])ми(?=нь)', r'\1ми' + Oxia],
    [r'\b([Аа])(?=може\b)', r'\1' + Iso],
    [r'([Аа])(?=нгел)', r'\1' + Iso],
    [r'([Аа])нті(?=хр)', r'\1нті' + Oxia],
    [r'([Аа])по(?=стол)', r'\1по' + Oxia],
    [r'([Аа])рха(?=нгел)', r'\1рха' + Oxia],
    [r'([Аа])ѳѡ(?=н)', r'\1ѳѡ' + Oxia],
    [r'\b([Аа])(?=ще\b)', r'\1' + Iso],

    # =========================
    # -бед-
    [r'\bбѣ(?=д[енс]\w|ъ\b)', r'бѣ' + Oxia],
    [r'\bбѣд([аеꙋ]\b|о(?=\w))', r'бѣд\1' + Oxia],
    [r'\bбѣд([аꙋ]\b)', r'бѣд\1' + Varia],

    # =========================
    # -бег-, -беж-
    [r''' # отбеже 
        (
            ^ᲂу
            |\b(?:
                из|при|ѿ
            )?
        )
        бѣ([гж])
        ([аеиꙋ]\b)
        ''',
     r'\1бѣ\2\3' + Varia
     ],
    [r''' # избѣглъ избѣгнꙋти
        (
            ^ᲂу
            |\b(?:
                из|при|ѿ|на
                )?
        )
        бѣ
        (?=г(л?ъ|н))
        ''',
     r'\1бѣ' + Oxia
     ],

    [r'\bбѣ(?=гати\b)', r'бѣ' + Oxia],
    [r'(^ᲂу|\b(?:из|при|ѿ)?)бѣжа(?=ти\b)', r'\1бѣжа' + Oxia],

    [r''' # избѣга́ти избѣго́х
        (   ^ᲂу
            |\b(?:
                из|при|ѿ
                )
        )
        бѣг
        ([оа])
        (?=\w+)
        ''',
     r'\1бѣг\2' + Oxia
     ],
    # ---- -бег-, -беж- ---------------

    [r'([Бб])езмѣ(?=(р|cт)н)', r'\1езмѣ' + Oxia],

    [r''' # бѣлый
        \bбѣл 
        (?=[аоꙋы]\w)
        ''',
     r'бѣ' + Oxia + r'л'
     ],

    [r'''  # убеленный 
        (\b|^ᲂу)
        бѣл
        (?![аоꙋы]\w) # ! бѣлый
        ([еиоѧ])''',
     r'\1бѣл\2' + Oxia
     ],
    # ---- -бел- -----------------

    [r'\bбѣс(?=[аиꙋыъ]\b)', r'бѣ' + Oxia + r'с'],
    [r'\bбѣ\b', r'бѣ' + Varia],

    [r''' # бесте беша бехом
        \b
        бѣ
        (?=
            сте
            |х(?=(ом)?ъ)
            |ша
        )   
        ''',
     r'бѣ' + Oxia
     ],

    [r'\bбде\b', r'бдѣ' + Varia],
    [r'\bбде(?=[нт])', r'бдѣ' + Oxia],

    # =========================
    # -благ- -блаж -
    [r'\b([Бб])ла(?=го\b)', r'\1ла' + Oxia],
    [r'([Бб])лагі(?=[йеѧ])', r'\1лагі' + Oxia],
    [r'([Бб])лаговѣ(?=щені[аеюѧ]\b)', r'\1лаговѣ' + Oxia],
    [r'([Бб])лагоговѣ(?=й?н)', r'\1лагоговѣ' + Oxia],
    [r'([Бб])лагодар([ѧю])\b', r'\1лагодар\2' + Varia],
    # благодарим
    [r'([Бб])лагодар([иеѧ])(?=\w+)', r'\1лагодар\2' + Oxia],
    # благодарно, благодать
    [r'([Бб])лагода(?=[рт](?![иеѧ]\w+|ѧ\b))', r'\1лагода' + Oxia],
    # благослове́нїе
    [r'([Бб])лагослове(?=н)', r'\1лагослове' + Oxia],
    # благослови
    [r'([Бб])лагослови\b', r'\1лагослови' + Varia],

    [r'([Бб])лагоꙋха', r'\1лагоꙋха' + Oxia],

    # -блаж-
    [r'\b([Бб])ла(?=же\b)', r'\1ла' + Oxia],
    [r''' # ᲂу҆блажа́емъ блаже́нный
        ([Бб])лаж
        (?!е\b) # ! блаже
        ([аеи])
        ''',
     r'\1лаж\2' + Oxia
     ],
    # --------------------------

    # =========================
    # -бог- -бож- -боз-
    [r''' # бо́гъ бо́гꙋ бо́гомъ  
        (^ᲂу|\b) # ᲂу҆бо́гїй вынести отдельно
        ([Бб])ог
        (?=
            (
                [аеиꙋъ]
                |ій  # вынести отдельно
                |о(мъ|ви)
            )\b
        )
        ''',
     r'\1\2о' + Oxia + r'г'
     ],
    [r'''  # бога́тый бога́тно
        богат
        (?=
            ъ
            |[аіоꙋы]\w\b # бога́тый
            |[оы]м\w?   # бога́томꙋ бога́тымъ 
            |н([аеоѡꙋы]) # бога́тно
            |ств
        )
        ''', r'бога' + Oxia + r'т'],
    [r''' # бо́же бо́жїй
        \b
        ([Бб])ож
        (?=
            (е|і[аеийюѧ])\b
        )
        ''',
     r'\1о' + Oxia + r'ж'
     ],

    [r'([Бб])оже(?=ственн)', r'\1оже' + Oxia],
    [r'\b([Бб])ожество\b', r'\1ожество' + Varia],

    [r''' # бо́зе бо́зи
        \b
        ([Бб])оз
        (?=[еѣи]\b)
        ''',
     r'\1о' + Oxia + r'з'
     ],
    # ---- -бог- -бож- -боз- -------

    [r'([Бб])оговѣ(?=дѣн)', r'\1оговѣ' + Oxia],
    [r'([Бб])огодꙋхнове(?=нн)', r'\1огодꙋхнове' + Oxia],
    [r'([Бб])огоро(?=ди[чц])', r'\1огоро' + Oxia],
    [r'([Бб])огороди(?=тельниц)', r'\1огороди' + Oxia],
    [r'болѣ(?=зн)', r'болѣ' + Oxia],

    [r'бꙋ(?=д(етъ|и))', r'бꙋ' + Oxia],
    [r'([Бб])ы(?=(ли|ти|сть|ша)\b)', r'\1ы' + Oxia],

    [r'([Вв])алаа(?=м)', r'\1алаа' + Oxia],

    # ========================
    #   вѣд вѣж вѣм вѣт вѣс вѣщ
    #   -вѣд-
    [r'''
        \b
        (
            (не)?(из)?
            |(ис)?по
        )?
        вѣд
        (?=
             а [елнтхюѧ]?
            |[еѣ] [нтхш]
            |и [хш]
            |о [м]
            |ꙋ [еюѧ]
            |ы й
            |ѧ т
            |н 
        )
        ''',
     r'\1вѣ' + Oxia + r'д'
     ],

    #   -вѣж-
    [r'\b(не)?вѣ(?=ж)', r'\1вѣ' + Oxia],

    #   -вѣм-
    [r'''    
        \b
        ((ис)?по)?
        вѣм
        (?=[ыъ])
        ''',
     r'вѣ' + Oxia + r'м'
     ],

    #   -вѣс-
    [r'\b([Нн]е)?вѣ(?=с(и\b|т))', r'\1вѣ' + Oxia],
    # со́вѣсть
    [r'\bсо(?=вѣст)', r'со' + Oxia],

    #   -вѣт- (! цвѣ́тъ свѣт вѣтіи, вѣтвѧми)
    [r'(?<![сц])вѣт(?!(і[иѧ]|вѧм))', r'вѣ' + Oxia + r'т'],
    # вѣтіи
    [r'\bвѣті(?=[иѧ])', r'вѣті' + Oxia],

    #   -вѣщ-
    [r'вѣ(?=щій\b)', r'вѣ' + Oxia],
    [r'вѣща', r'вѣща' + Oxia],
    [r'вѣ(?=щенск)', r'вѣ' + Oxia],
    # [r'вѣще(?=н(ск|і[еюѧ]|наѧ))', r'вѣще' + Oxia],
    [r'веще(?=ственн)', r'веще' + Oxia],
    [r'вѣщꙋ\b', r'вѣщꙋ' + Varia],

    # ---- вѣд вѣж вѣм вѣт вѣс вѣщ ----

    # ========================
    # век- вец- веч-
    [r'\bвѣк(?![оѡ]в|ам)', r'вѣ' + Oxia + r'к'],
    [r'''
        \b
        вѣк
        ([аоѡ])(?=[мвх][иъ])
        ''',
     r'вѣк\1' + Oxia
     ],

    [r'вѣ(?=цѣ(хъ)?)', r'вѣ' + Oxia],
    [r'вѣ(?=че?н)', r'вѣ' + Oxia],
    # ---- век- вец- веч- ----------

    # ========================
    #   венц- венч-
    [r'\bвѣне(?=цъ\b)', r'вѣне' + Oxia],
    [r'\bвѣнц([аеѣꙋы])\b', r'вѣнц\1' + Varia],
    # вѣнца́ми
    [r''' 
        \b
        вѣнц
        (?!
            [аеѣꙋы]\b   # ! вѣнцꙋ̀
            |ецъ\b      # ! вѣне́цъ   
        )
        (?P<acut>[аеєоѡ])
        (?=\w+)
        ''',
     r'вѣнц\g<acut>' + Oxia
     ],

    # вѣнча̀
    [r'(^ᲂу|\b(?:[ѻѡ]б)?)вѣнча\b', r'\1вѣнча' + Varia],

    # вѣ́нче вѣ́нчанъ
    [r'''    
        (
            ^ᲂу
            |\b(?:
                раз 
                |[ѻѡ]б
            )?
        )
        вѣнч
        (?=(е|анъ)\b)
        ''',
     r'\1вѣ' + Oxia + r'нч'
     ],
    # вѣнча́еши
    [r'''
        (
            ^ᲂу
            |\b(?:[ѻѡ]б)?
        )
        вѣнч
        (?! 
            # ! вѣнча̀ вѣ́нче вѣ́нчанъ 
            ([ае]|анъ)\b
        )
        а   # ударн.
        ''',
     r'\1вѣнча' + Oxia
     ],
    # ----  венц- венч- --------------

    [r'вѣ(?=р[аеиноꙋыѧ])', r'вѣ' + Oxia],
    [r'вѣтвѧ(?=м)', r'вѣтвѧ' + Oxia],
    [r'взыва', r'взыва' + Oxia],
    [r'він([аеоу])\b', r'вїн\1' + Varia],
    [r'\b(нена)?видѣ(?=ні)', r'\1видѣ' + Oxia],
    [r'віногра', r'вїногра' + Oxia],
    [r'([Вв])лады(?=[кчц])', r'\1лады' + Oxia],

    [r'\bвмѣнѧ', r'вмѣнѧ' + Oxia],
    [r'\bвмѣни\B', r'вмѣни' + Oxia],
    [r'\bвмѣни\b', r'вмѣни' + Varia],

    [r'воздѣва', r'воздѣва' + Oxia],
    [r'воздѣ(?=ти|еши|ющ)', r'воздѣ' + Oxia],

    [r'([Вв])озлюблю\b', r'\1озлюблю' + Varia],

    # возсїѧ̀
    [r'([Вв])озсіѧ\b', r'\1озсїѧ' + Varia],
    # возсїѧ́й
    [r'([Вв])озсіѧ(?!\b|ва)', r'\1озсїѧ' + Oxia],
    [r'([Вв])озсїѧва', r'\1озсїѧва' + Oxia],

    [r'воспѣва', r'воспѣва' + Oxia],
    [r'воспою', r'воспою' + Varia],

    # вра́гъ вра́жїй вражд-
    [r'''
        \b
        вра
        (?=
            гъ
            |ж(?!д) # ! вражда
        )
        ''',
     r'вра' + Oxia
     ],
    [r'\bвра([гз])([аеиꙋ])\b', r'вра\1\2' + Varia],
    [r'\bвражд([аеꙋы])\b', r'вражд\1' + Varia],
    [r'\bвражд([еоꙋ])\B', r'вражд\1' + Oxia],

    [r'([Вв])ра(?=чь)', r'\1ра' + Oxia],
    [r'([Вв])рачꙋ', r'\1рачꙋ' + Varia],
    [r'всегда', r'всегда' + Varia],
    [r'([Вв])сѣ(?=м[иъ]|хъ)', r'\1сѣ' + Oxia],
    [r'([Вв]с[еѣ])(?=ю\b)', r'\1' + Oxia],
    [r'\b([Вв])селе(?=н(ск|н))', r'\1селе' + Oxia],
    [r'всемꙋ', r'всемꙋ' + Varia],
    [r'всеѧ', r'всеѧ' + Varia],
    [r'\bвс([ию])\b', r'вс\1' + Varia],
    [r'\bвсѧ\b', r'всѧ' + Kamora],
    [r'\bвсѧ(?=[кцч])', r'всѧ' + Oxia],
    [r'вта(?=йне)', r'вта' + Oxia],

    [r'([Вв])ы(?=нꙋ\b)', r'\1ы' + Oxia],

    # гдѣ̀
    [r'\b([Гг])дѣ\b', r'\1дѣ' + Varia],
    # геѳсїма́нїа
    [r'([Гг])еѳсіма(?!нійс)', r'\1еѳсїма' + Oxia],
    # геѳсїмані́йстѣй
    [r'([Гг])еѳсімані(?=йс)', r'\1еѳсїмані' + Oxia],

    # Глаго́лъ
    [r'\b([Гг])лаго(?=л)', r'\1лаго' + Oxia],
    # гла́съ
    [r'\b([Гг])ла(?=с[аноеꙋыъ])', r'\1ла' + Oxia],
    # глаша́ти ѻ҆глаше́нный
    [r'([Гг])лаш([ае])', r'\1лаш\2' + Oxia],
    # ѻ҆гласѝ
    [r'(воз|[ѻѡ])гласи\b', r'\1гласи' + Varia],

    [r'гнѣ(?=в)', r'гнѣ' + Oxia],
    # годи́на
    [r'\bгоди(?=н[аеѣоꙋы])', r'годи' + Oxia],
    [r'горѣ(?=т)', r'горѣ' + Oxia],
    [r'\bгорѣ\b', r'горѣ' + Varia],
    # го́ре
    [r'\bго(?=ре\b)', r'го' + Oxia],

    # Го́споди
    [r'([Гг])о(?=спод([аеиꙋ]|омъ)\b)', r'\1о' + Oxia],
    # Госпо́дне
    [r'([Гг])оспо(?=д([нь]|ств))', r'\1оспо' + Oxia],
    # Госпожа̀
    [r'([Гг])оспож([аеиѣꙋ])\b', r'\1оспож\2' + Varia],

    # ==============================
    # грѣ́хъ грѣ́шникъ грѣ́шенъ грѣшны̀ согрѣшѝ прегрѣше́нїѧ грѣсѝ грѣсѣ́хъ

    # грѣх (ѣ - ударн.)
    [r'''
        \b
        ([Гг])рѣ
        (?=
            хъ
            |шенъ
            |шн(?!\w\b)) # ! гръшны
        ''',
     r'\1рѣ' + Oxia
     ],

    [r'(со)?грѣш([иꙋ]|н[аоѡы])\b', r'\1грѣш\2' + Varia],
    [r'грѣси\b', r'грѣси' + Varia],
    [r'грѣсѣ(?=хъ\b)', r'грѣсѣ' + Oxia],
    # прегрѣше́нїѧ
    [r'''
        грѣш
        (?P<acut>
            [аи]
            |е(?!нъ) # ! грѣ́шенъ
        )\B
        ''',
     r'грѣш\g<acut>' + Oxia
     ],
    # -------------------------------

    [r'([Гг])рѧд([еиꙋыѧ])\B', r'\1рѧд\2' + Oxia],
    [r'грѧд([иꙋ])\b', r'грѧд\1' + Varia],

    [r'да(?=бы|же)', r'да' + Oxia],
    [r'([Дд])а(?=ждь)', r'\1а' + Oxia],

    [r'\bда(?=р([аеѣꙋъ]\b|ꙋ\B))', r'да' + Oxia],
    [r'\bдары\b', r'дары' + Varia],
    [r'\bдарова\B', r'дарова' + Oxia],
    [r'\bдарова\b', r'дарова' + Varia],

    # дѣ́ва
    [r'''
        \b
        ([Пп]рисно)?
        ([Дд])ѣ(?=в(?!омати))
        ''',
     r'\1\2ѣ' + Oxia
     ],

    [r'\bде(?=нь)', r'де' + Oxia],
    [r'\bднѣ\b', r'днѣ' + Varia],
    [r'дне(?=сь)', r'дне' + Oxia],

    [r'\bдѣ(?!то[вр]од|т[еєѣ]й)(?=т)', r'дѣ' + Oxia],
    [r'\bдѣто([вр]од)([иѧ])', r'дѣто\1\2' + Oxia],
    [r'издѣ(?=тска)', r'издѣ' + Oxia],

    # дѣ́ло
    [r'\bдѣ(?=л[оаꙋ]\b)', r'дѣ' + Oxia],
    [r'дѣ(?=ѧти)', r'дѣ' + Oxia],

    # дивный
    [r'((пре|неиж|много(иж)?|досто|все)?[Дд])и(?=вн)', r'\1и' + Oxia],

    # длѧ
    [r'\bдлѧ\b', r'bдлѧ' + Varia],
    [r'добродѣ(?=тел)', r'добродѣ' + Oxia],
    # доколе
    [r'([Дд])око(?=лѣ)', r'\1око' + Oxia],
    # дондеже
    [r'([Дд])о(?=ндеже)', r'\1о' + Oxia],
    [r'([Дд])осе(?=лѣ)', r'\1осе' + Oxia],

    # дꙋша̀
    # TODO: ?
    #  дꙋша̀: дꙋшѣ̀ - предл. дꙋшѐ - зват.
    #  дꙋ́хъ: дꙋ́сѣ - предл. дꙋ́ше - зват.
    #
    [r'([Дд])ꙋш([аѣ])\b', r'\1ꙋш\2' + Varia],
    # дꙋше́внꙋю
    [r'([Дд])ꙋше(?=вн|ю)', r'\1ꙋше' + Oxia],
    # дꙋ́шꙋ
    [r'([Дд])ꙋ(?=ш[ꙋъ]\b)', r'\1ꙋ' + Oxia],
    # дꙋ́сѣ - предл.п. дꙋ́ше - зват.п
    [r'\b([Дд])ꙋ(?=сѣ\b)', r'\1ꙋ' + Oxia],

    # є҆̀ ю҆̀ ꙗ҆̀
    [r'\b([ЄєЮюꙖꙗ])\b', r'\1' + Apostrof],

    [r'([Єє])ѵа(?=нгел)', r'\1ѵа' + Oxia],

    [r'([Єє])вфра(?=фовъ)', r'\1вфра' + Oxia],
    [r'([Єє])ѵхарі(?=сті)', r'\1ѵхарі' + Oxia],
    [r'([Єє])ѵхарісти(?=ч)', r'\1ѵхарїсти' + Oxia],
    # є҆гда̀ є҆да̀
    [r'([Єє]г?)да\b', r'\1да' + Varia],
    # є҆гѡ̀ є҆го̀
    [r'([Єє])г([оѡ])\b', r'\1г\2' + Varia],
    # є҆го́же
    [r'([Єє])го(?=же\b)', r'\1го' + Oxia],
    # є҆́же є҆́й є҆́сть є҆́смь є҆́юже
    [r'([Єє])(?=же|й|с[тм]ь|юже\b)', r'\1' + Iso],
    # є҆ли́ко є҆ли́цы є҆ли́жды
    [r'єли(?=жды|ко|цы)', r'єли' + Oxia],
    # є҆мꙋ̀ є҆сѝ є҆щѐ є҆стѐ
    [r'\b([Єє])(мꙋ|си|сте|ще)\b', r'\1\2' + Varia],
    [r'\b([Єє])ѧ\b', r'\1ѧ' + Varia],

    # жела́нїе
    [r'([Жж])ела(?=ні)', r'\1ела' + Oxia],
    # желѣ́зо
    [r'желѣ(?=з)', r'желѣ' + Oxia],
    # же́но
    [r'\b([Жж])е(?=но\b)', r'\1е' + Oxia],
    # жена̀ женѐ
    [r'\b([Жж])ен([аеѣꙋы])\b', r'\1ен\2' + Varia],
    # же́ртва
    [r'([Жж])е(?=ртв(?!оположн))', r'\1е' + Oxia],
    # живꙋ́щїй
    [r'живꙋ(?=щ\w+)', r'живꙋ' + Oxia],
    # жива̀
    [r'жив([аꙋ])\b', r'жив\1' + Varia],
    # жи́знь жи́зненный
    [r'([Жж])и(?=зн([иь]|енн))', r'\1и' + Oxia],

    # завѣ́са
    [r'\b([Зз])авѣ(?=с)', r'\1авѣ' + Oxia],

    # за́повѣдь (??? заповѣ́дети)
    [r'([Зз])а(?=повѣд[еиь](?!ти))', r'\1а' + Oxia],
    # заповѣ́далъ (! за́повѣдь)
    [r'([Зз])аповѣ(?=д)(?!д([иь]|ей))', r'\1аповѣ' + Oxia],

    # зва́ти
    [r'\b(при|воз|на)?зва(?=[нтхш]|л(?!а))', r'\1зва' + Oxia],
    # воззва̀
    [r'\b(при|воз|на)?зва\b', r'\1зва' + Varia],

    # ѕвѣ́зды ѕвѣ́здный
    [r'([Ѕѕ])вѣ(?=зд(ы\b|н))', r'\1вѣ' + Oxia],
    # ѕвѣзда̀
    [r'([Ѕѕ])вѣзд([аеѣоꙋ])\b', r'\1вѣзд\2' + Varia],
    # ѕвѣздо́ю
    [r'([Ѕѕ])вѣзд([ао])\B', r'\1вѣзд\2' + Oxia],

    [r'ѕвѣ(?=р[иеѣ]|рь(?!ми))', r'ѕвѣ' + Oxia],
    [r'ѕвѣ(?=р[иеѧѣ]\b|ь(?!ми))', r'ѕвѣ' + Oxia],
    [r'ѕвѣрѧ(?=ми)', r'ѕвѣрѧ' + Oxia],
    [r'ѕвѣрьми\b', r'ѕвѣрьми' + Varia],
    # [r'ѕдѣрьми\b', r'ѕвѣрьми' + Varia],
    [r'\b([Зз])дѣ\b', r'\1дѣ' + Varia],
    [r'\b([Зз])дѣ(?=сь\b)', r'\1дѣ' + Oxia],
    [r'ѕѣлѡ\b', r'ѕѣлѡ' + Varia],
    [r'ѕѣ(?=льн)', r'ѕѣ' + Oxia],

    [r'([Зз])емл([иѧ])\b', r'\1емл\2' + Varia],
    [r'([Зз])е(?=млю\b)', r'\1е' + Oxia],

    [r'зѣ(?=ниц)', r'зѣ' + Oxia],

    [r'ѕл([аеіѣоꙋы])\b', r'ѕл\1' + Varia],
    # ѕло
    [r'''
        ѕл
        (
            [аеѣіы]
            |о(?=
                [бм]
                |ст(н|ь\b)
            )
        )
        \B
        ''', 
        r'ѕл\1' + Oxia
    ],

    [r'\bѕмі(?=й)\b', r'bѕмі' + Oxia],
    [r'\bзра(?=к|ц)', r'зра' + Oxia],

    # зрѣ́ти ᲂу҆зрѣ́ти
    [r'(^ᲂу|\b(?:при)?)зрѣ(?=[лнтхш])', r'\1зрѣ' + Oxia],
    # зрю̀  призрѣ̀
    [r'\b((?:при)?[Зз])р([еѣюѧ])\b', r'\1р\2' + Varia],
    [r'\b([Зз])ри\b', r'\1ри' + Varia],
    [r'\b([Пп])ри(?=зри)', r'\1ри' + Varia],

    [r'([Іі])а(?=ков)', r'\1а' + Oxia],
    [r'([Іі])езекі(?=ил)', r'\1езекі' + Oxia],
    # іерей
    [r'([Іі])ере(?!м)', r'\1ере' + Oxia],
    [r'([Іі])еремі', r'\1еремі' + Oxia],
    [r'([Іі])ерꙋсали(?=м)', r'\1ерꙋсали' + Oxia],
    [r'([Іі])зра(?=ил)', r'\1зра' + Oxia],
    [r'([Іі])исꙋ(?=с)', r'\1исꙋ' + Oxia],
    [r'([Ии])(?=мам[ыъ])', r'\1' + Iso],
    [r'([Ии])мꙋ(?=щ)', r'\1мꙋ' + Oxia],
    [r'([Ии])(?=мѧрекъ)', r'\1' + Iso],
    [r'([Іі])ѻрда(?=н)', r'\1ѻрда' + Oxia],
    [r'([Іі])ꙋ(?=д(\w\b|о))', r'\1ꙋ' + Oxia],
    [r'([Іі])ꙋде(?=\w)', r'\1ꙋде' + Oxia],
    # і҆ѡа́ннъ
    [r'([Іі])ѡа(?=нн(?![іи]к))', r'\1ѡа' + Oxia],
    # і҆ѡанни́кїй
    [r'([Іі])ѡа(нн?[іи])(?=к)', r'\1ѡа\2' + Oxia],
    # і҆́ѡвъ
    [r'([Іі])(?=ѡв)', r'\1' + Iso],
    [r'([Іі])ѡ(?=сиф)', r'\1ѡ' + Oxia],

    [r'\bидѣ(?=же\b)', r'идѣ' + Oxia],
    [r'изба(?=ви)', r'изба' + Oxia],
    [r'изрѧ(?=дн)', r'изрѧ' + Oxia],
    # і҆́косъ
    [r'([Іі])(?=кос)', r'\1' + Iso],
    [r'([Іі])рм(?=ос)', r'\1' + Oxia],
    [r'\b([Іі])кѡ(?=н)', r'\1кѡ' + Oxia],
    [r'\b([Ии])ли\b', r'\1ли' + Varia],
    [r'\b([Ии])(?=(ми?|х)?же\b)', r'\1' + Iso],
    [r'\b([Ии])(?=[мх]ъ\b)', r'\1' + Iso],
    [r'([Ии])(?=мѧ)', r'\1' + Iso],
    [r'испещре(?=н)', r'испещре' + Oxia],
    [r'([Ии])спо(?=лнь\b)', r'\1спо' + Oxia],
    [r'([Ии])(?=сповѣд(ь|и\b))', r'\1' + Iso],
    [r'\b([Ии])(?=стин)', r'\1' + Iso],
    [r'ѵссѡ(?=п)', r'ѵссѡ' + Oxia],

    [r'исцѣле(?=н)', r'исцѣле' + Oxia],
    [r'неисцѣ(?=льн)', r'неисцѣ' + Oxia],
    [r'исцѣле\b', r'исцѣле' + Varia],

    [r'(о?л)ѣ(?=п)', r'\1ѣ' + Oxia],

    [r'\b([Кк])а(?=ѧ)', r'\1а' + Oxia],
    [r'([Кк])а(?=кѡ)', r'\1а' + Oxia],
    [r'([Нн])ика(?=коже)', r'\1ика' + Oxia],
    [r'\b(([Нн]е)?[Кк])і(?=ими|й)', r'\1і' + Oxia],
    [r'\b([Кк])о(?=е\b)', r'\1о' + Oxia],
    [r'\b([Кк])оего(?=жд)', r'\1оего' + Oxia],
    [r'([Кк])оли(?=ко)', r'\1оли' + Oxia],

    [r'([Кк])онда(?=къ)', r'\1онда' + Oxia],
    [r'колѣ(?=н[ао](?!прекл))', r'колѣ' + Oxia],

    # прекра́снаѧ
    [r'прекра(?=с)', r'прекра' + Oxia],
    # кра́снаѧ
    [r'\bкра(?=сн[аоіꙋы]\B)', r'кра' + Oxia],
    # красны̀ красна̀
    [r'\bкрасн([аы])\b', r'красн\1' + Varia],
    # красе́нъ
    [r'\bкрасе(?=нъ\b)', r'красе' + Oxia],

    [r'красот([аеѣоꙋы])\b', r'красот\1' + Varia],
    [r'красото(?=ю)', r'красото' + Oxia],
    [r'красото\b', r'красото' + Varia],
    [r'крѣ(?=пк)', r'крѣ' + Oxia],
    [r'([Кк])ре(?=стн)', r'\1ре' + Oxia],
    [r'кро(?=т[коц])', r'кро' + Oxia],
    [r'([Кк])ꙋпѣ(?=л)', r'\1ꙋпѣ' + Oxia],
    [r'([Кк])ꙋпин([аеоꙋы])\b', r'\1ꙋпин\2' + Varia],
    [r'([Кк])ꙋпино\B', r'\1ꙋпино' + Oxia],
    [r'\b([Кк])ꙋ(?=ю)', r'\1ꙋ' + Oxia],

    [r'([Лл])ѣ(?=стви)', r'\1ѣ' + Oxia],
    [r'лѣ(?=то)', r'лѣ' + Oxia],
    # ли́къ
    [r'\b([Лл])и(?=к\w\b)', r'\1и' + Oxia],
    [r'([Лл])ітꙋргі', r'\1їтꙋргі' + Oxia],
    [r'\b([Лл])ітꙋрги(?!к)', r'\1їтꙋрги' + Oxia],

    # любвѐ любы̀
    [r'([Лл])юб(в[ие]|ы)\b', r'\g<0>' + Varia],
    # любо̀вь
    [r'([Лл])юбо(?=в([їь]ю?))', r'\1юбо' + Oxia],

    [r'\b([Мм])арі(?=[еиѧю])', r'\1арі' + Oxia],
    [r'\b([Мм])аріа(?=м)', r'\1аріа' + Oxia],

    [r'''
        \b
        ([Бб]ого|[Дд]ѣво)?
        ([Мм])а
        (?=
            т
            (
                и         # ма́ти
                |ер[нісь] # богома́терїю
            )
        )
        ''',
     r'\1\2а' + Oxia
     ],

    # бг҃омт҃ери́нскїй
    [r'''
        (
            ([Бб]ого)?
            [Мм]
        )
        атери(?=нск)
        ''', r'\1атери' + Oxia
    ],

    # мѣ́сто
    [r'мѣ(?=ст)', r'мѣ' + Oxia],
    [r'([Мм])ѣ(?=сѧц)', r'\1ѣ' + Oxia],
    [r'([Мм])илосе(?=рд)', r'\1илосе' + Oxia],
    [r'([Мм])и(?=лост(?!ивлен))', r'\1и' + Oxia],
    [r'([Мм])ладе(?=не?[цч])', r'\1ладе' + Oxia],
    [r'\b([Мм])ѵ(?=р\w\b)', r'\1ѵ' + Oxia],
    [r'\b([Мм])ѵ(?=роно)', r'\1ѵ' + dbl_grave],
    [r'\b((со)?[Мм])нѣ', r'\1нѣ' + Oxia],
    [r'\b([Мм])нѣ\b', r'\1нѣ' + Varia],
    # моѐ мою̀ моѧ̀ моѝ
    [r'\b([Мм])о([еиюѧ])\b', r'\1о\2' + Varia],
    [r'\b([Мм])оемꙋ\b', r'\1оемꙋ' + Varia],
    # мое́й
    [r'\b([Мм])ое(?=й\b)', r'\1ое' + Oxia],
    # мои́хъ мои́мъ
    [r'\b([Мм])ои(?=[мх]ъ\b)', r'\1ои' + Oxia],
    [r'\b([Мм])о(?=й\b)', r'\1о' + Oxia],
    [r'моли\b', r'моли' + Varia],
    [r'моли(?=тв(?!ослов))', r'моли' + Oxia],
    # -мꙋ́др-
    [r'''
        ([Мм])ꙋ
        (?!
            др(
                ец
                |и(вш|[лcш])
                |[оѡ]([влт]|с(тьми|ост))
                |ѧ
                |ѣйш
            )
        )
        (?=др)
        ''', r'\1ꙋ' + Oxia],
    # мученик (! мученіе - ???)
    [r'([Мм])ꙋдрова(?=н)', r'\1ꙋдрова' + Oxia],
    [r'([Мм])ꙋ(?=чен(?!і))', r'\1ꙋ' + Oxia],
    [r'([Мм])ꙋче(?=ні)', r'\1ꙋче' + Oxia],

    [r'надѣ(?=[жѧю])', r'надѣ' + Oxia],
    [r'намѣ(?=рен)', r'намѣ' + Oxia],

    # на́мъ на́шꙋ на́шего на́съ
    [r'''
        \b
        на
        (?=
            (
                [мс]
                [иъ]
                |
                ш
                (
                    [аꙋыъѧ]
                    |е([йюѧ]|го|м[уъ])?
                    |и([мх]ъ)?
                )
            )
            \b
        )
        ''',
     r'на' + Oxia
     ],

    [r'\b([Нн])аꙋчи\b', r'\1аꙋчи' + Varia],
    # небеса̀
    [r'\b([Нн])ебес([аеѣи])\b', r'\g<0>' + Varia],
    # не́бо не́бꙋ
    [r'\b([Нн])е(?=б\w\b)', r'\1е' + Oxia],
    # небе́сный небе́съ
    [r'\b([Нн])ебе(?=с(н\w|ъ))', r'\1ебе' + Oxia],
    [r'([Нн])евѣ(?=ст|щ)', r'\1евѣ' + Oxia],

    [r'([Нн])ѣ(?=гдѣ\b)', r'\1ѣ' + Oxia],
    [r'([Нн])егѡ(?=же\b)', r'\1егѡ' + Oxia],
    [r'([Нн])едѣ(?=л)', r'\1едѣ' + Oxia],
    [r'нѣ(?=др)', r'нѣ' + Oxia],
    [r'\b([Нн])емꙋ\b', r'\1емꙋ' + Varia],
    [r'\bнѣ(?=жн)', r'нѣ' + Oxia],

    [r'неизрече(?=нн)', r'неизрече' + Oxia],
    [r'([Нн])е(?=йже)', r'\1е' + Oxia],
    
    [r'\b([Нн])ѣ(?=к(то|огда|ій)\b)', r'\1ѣ' + Oxia],

    # нѣмы̑ѧ
    [r'\bнѣмы(?=ѧ)', r'нѣмы' + Kamora],
    # нѣмо́й
    [r'\bнѣм(?!ыѧ?\b|от\w)([аіоꙋы])', r'нѣм\1' + Oxia],
    # нѣмота̀
    [r'\bнѣмот[аꙋы]\b', r'\g<0>' + Varia],
    # нѣ́мы
    [r'\bнѣ(?=мы\b)', r'нѣ' + Oxia],

    [r'непоро(?=че?н)', r'непоро' + Oxia],

    [r'нерадѣ(?=ні)', r'нерадѣ' + Oxia],

    # нѣ́си нѣ́смь нѣ́смы нѣ́сть
    [r'\b([Нн])ѣ(?=с([мт][ыь]|и)\b)', r'\1ѣ' + Oxia],

    # нїко́лае
    [r'([Нн])іко(?=лае\b)', r'\1їко' + Oxia],
    # нїкола́й
    [r'([Нн])ікола(?!е\b)', r'\1їкола' + Oxia],

    [r'ни(?=хже\b)', r'ни' + Oxia],

    # но́ваго но́вый но́вомꙋ но́выхъ
    [r'''
        \b
        ([Нн])о
        (?=
            в
            (
                а(г[оѡ]|ѧ)
                |ꙋю
                |о(г[оѡ]|[ейю]|м[ъꙋ])
                |ы([ейѧ]|[мх][аиъ])
            )\b
        )
        ''',
     r'\1о' + Oxia
     ],

    # но́чь но́щїю но́чи
    [r'\bно(?=[чщ](ь|ію|(?<=ч)и))', r'но' + Oxia],
    # нощѝ
    [r'\bнощи\b', r'нощи' + Varia],

    # ны́нѣ
    [r'([Нн])ы(?=нѣ)', r'\1ы' + Oxia],

    [r'([Ѡѡ])ба(?=че)', r'\1ба' + Oxia],

    [r'\b([Ѡѡ])бъе(?=м(?!лите))', r'\1б̾е' + Oxia],
    [r'\b([Ѡѡ])бъемли(?=те)', r'\1б̾емли' + Oxia],

    [r'ѡбѣ(?=сити)', r'ѡбѣ' + Oxia],

    [r'ѻбѣ(?=тъ)', r'ѻбѣ' + Oxia],
    [r'ѻбѣща\b', r'ѻбѣща' + Varia],
    # ѻ҆бѣ́тъ ѻ҆бѣща́нїе ѻ҆бѣща́хомъ ѻ҆бѣща́въ
    [r'ѻбѣща(?=[влхшеюѧ]|ні|ти)', r'ѻбѣща' + Oxia],

    [r'([Ѻѻ])би(?=тел)', r'\1би' + Oxia],

    [r'\b([Ѡѡ])бъиди\b', r'\1б̾иди' + Varia],
    [r'\b([Ѡѡ])бъиди(?=те)', r'\1б̾иди' + Oxia],
    [r'\b([Ѡѡ])бъидо(?=ша)', r'\1б̾идо' + Oxia],

    [r'\b([Ѡѡ])бъи(?=ме)', r'\1б̾и' + Oxia],
    [r'\b([Ѡѡ])бъи(?=мꙋт)', r'\1б̾и' + Oxia],
    [r'\b([Ѡѡ])бъим([иꙋ])\b', r'\1б̾им\2' + Varia],
    [r'\b([Ѡѡ])бъими(?=те)', r'\1б̾ими' + Oxia],
    [r'\b([Ѡѡ])бъима', r'\1б̾има' + Oxia],

    [r'\b([Ѡѡ])бъити\b', r'\1б̾ити' + Varia],

    [r'ѡблек([аіо])', r'ѡблек\1' + Oxia],
    [r'ѡбле(?=кл)', r'ѡбле' + Oxia],
    [r'ѡбле(?=кл)', r'ѡбле' + Oxia],
    [r'ѡблече\b', r'ѡблече' + Varia],
    [r'ѡблече\B', r'ѡблече' + Oxia],
    [r'ѡблецы\b', r'ѡблецы' + Varia],
    [r'ѡблецы\B', r'ѡблецы' + Oxia],
    [r'ѡблеце\B', r'ѡблеце' + Oxia],

    [r'([Ѡѡ])бнови\b', r'\1бнови' + Varia],
    [r'([Ѡѡ])бнови\B', r'\1бнови' + Oxia],
    
    [r'([Ѡѡ])божи\b', r'\1божи' + Varia],
    [r'([Ѡѡ])бож([аеи])\B', r'\1бож\2' + Oxia],
    
    [r'\b([Ѡѡ])(?=браз(?!ꙋю))', r'\1' + Iso],

    [r'\b([Ѡѡ])бъѧ\b', r'\1б̾ѧ' + Varia],
    [r'\b([Ѡѡ])бъѧ(?=[лтш])', r'\1б̾ѧ' + Oxia],
    [r'\b([Ѡѡ])бъѧ(?=сте)', r'\1б̾ѧ' + Oxia],
    [r'\b([Ѡѡ])бъѧд([аео])', r'\1б̾ѧд\2' + Oxia],

    [r'ѡбрѣ(?=[лт]ъ\b|тені)', r'ѡбрѣ' + Oxia],
    [r'ѡбрѧ(?=щ)', r'ѡбрѧ' + Oxia],
    [r'ѡбрѣт([ао])', r'ѡбрѣт\1' + Oxia],
    [r'ѡбрѣсти\b', r'ѡбрѣсти' + Varia],
    [r'ѡбрѣл([аи])\b', r'ѡбрѣл\1' + Varia],

    # ѡ҆дѣ́ющагосѧ
    [r'ѡдѣ(?=ющ)', r'ѡдѣ' + Oxia],
    [r'ѡдѣѧ\B', r'ѡдѣѧ' + Oxia],
    [r'ѡдѣва(?=[еюѧ])', r'ѡдѣва' + Oxia],

    [r'([Ѡѡ])живи\b', r'\1живи' + Varia],
    [r'([Ѡѡ])живи\B', r'\1живи' + Oxia],
    [r'([Ѡѡ])живле(?!на\b)', r'\1живле' + Oxia],
    [r'([Ѡѡ])живлена\b', r'\1живлена' + Varia],
    [r'([Ѡѡ])живлѧ', r'\1живлѧ' + Oxia],
    [r'([Ѡѡ])животвор([еиѧ])\B', r'\1животвор\2' + Oxia],
    [r'([Ѡѡ])животвори\b', r'\1животвори' + Varia],
    [r'([Ѡѡ])жида', r'\1жида' + Oxia],

    [r'([Ѡѡ])зари\b', r'\1зари' + Varia],
    [r'([Ѡѡ])зар([еєиѧ])\B', r'\1зар\2' + Oxia],

    [r'([Ѡѡ])кропи\b', r'\1кропи' + Varia],
    [r'([Ѡѡ])кропи\B', r'\1кропи' + Oxia],

    [r'([Ѡѡ])(?=крест)', r'\1' + Iso],

    # ѡ҆мы́й ѡ҆мы́ю
    [r'([Ѡѡ])мы(?!ва)', r'\1мы' + Oxia],
    # ѡ҆мыва́ти
    [r'([Ѡѡ])мыва\B', r'\1мыва' + Oxia],

    [r'([Ѻѻ])на\b', r'\1на' + Varia],

    [r'ѡправд(?P<a>[аи])', r'ѡправд\g<a>' + Oxia],

    [r'([Ѡѡ])сѣни\b', r'\1сѣни' + Varia],
    [r'([Ѡѡ])сѣн([еиѧ]\B)', r'\1сѣн\2' + Oxia],

    [r'([Ѿѿ]|([Ѻѻ]т))крове(?=ні)', r'\1крове' + Oxia],
    [r'([Ѿѿ])ню(?=д)', r'\1ню' + Oxia],
    [r'([Ѿѿ])не(?=л[еєи]же)', r'\1не' + Oxia],

    # ѻ҆тцы̀ ѻ҆те́цъ ѻ҆те́чь ѻ҆те́ческїй ѻ҆́тча ѻ҆́тчїй ѻ҆те́ческїй ѻ҆те́чество
    [r'([Ѻѻ])т([еєѣ])(?=цъ)', r'\1т\2' + Oxia],
    [r'([Ѻѻ])тц([аеѣꙋы])\b', r'\1тц\2' + Varia],
    [r'([Ѻѻ])тц([аеєѣо])\B', r'\1тц\2' + Oxia],
    [r'([Ѻѻ])(?=тч([еєѣіꙋ]|и(?!зн)|а(?!ѧн)))', r'\1' + Iso],
    [r'([Ѻѻ])те(?=ч(ь\b|ес[кт]))', r'\1те' + Oxia],

    # отча́ѧнїе
    [r'([Ѿѿ])ча(?=ѧн)', r'\1ча' + Oxia],

    [r'([Ѡѡ])чи(?=с(?!титель)|щꙋ)', r'\1чи' + Oxia],
    [r'([Ѡѡ])чища', r'\1чища' + Oxia],

    [r'([Ѻѻ])чи(?=ма)', r'\1чи' + Oxia],
    [r'([Ѻѻ])(?=чи\b)', r'\1' + Iso],

    [r'([Пп])а(?=ки|че)', r'\1а' + Oxia],

    # пѣ́ти напѣ́въ (! терпѣнїе)
    [r'((?<!ер)[Пп])ѣ(?!ва)(?=[влнт])', r'\1ѣ' + Oxia],
    # ѿпѣва́нїе
    [r'([Ѿѿ])пѣва', r'\1пѣва' + Oxia],

    [r'([Пп])ѣ(?=сн(?!о))', r'\1ѣ' + Oxia],

    [r'печа(?=л)', r'печа' + Oxia],

    # пла́чь пла́чꙋщаѧ
    [r'([Пп])ла(?!чевн)(?=[чк])', r'\1ла' + Oxia],
    # плаче́вный
    [r'([Пп])лаче(?=вн)', r'\1лаче' + Oxia],

    [r'побѣжда', r'побѣжда' + Oxia],
    [r'побѣди', r'побѣди' + Oxia],
    [r'побѣ(?!донос)(?=д[аиноꙋы]\b)', r'побѣ' + Oxia],
    [r'побѣдоно(?=сн)', r'побѣдоно' + Oxia],

    [r'([Пп])оказа\b', r'\1оказа' + Varia],
    [r'([Пп])оказа\B', r'\1оказа' + Oxia],

    # покаѧ́нїе
    [r'([Пп])окаѧ(?=н)', r'\1окаѧ' + Oxia],
    # пока́ѧтисѧ
    [r'([Пп])ока(?=ѧ[стхш])', r'\1ока' + Oxia],

    [r'([Пп])окро(?!в(енн|ител))(?=в)', r'\1окро' + Oxia],
    [r'([Пп])окрове(?=нн)', r'\1окрове' + Oxia],
    [r'([Пп])окрови(?=тел)', r'\1окрови' + Oxia],

    [r'([Пп])окры\b', r'\1окры' + Varia],
    [r'([Пп])окры(?=[ей])', r'\1окры' + Oxia],
    [r'([Пп])окрыва\B', r'\1окрыва' + Oxia],

    [r'([Пп])оми(?=л)', r'\1оми' + Oxia],

    [r'([Пп])омѧн([еиꙋ])\b', r'\1омѧн\2' + Varia],
    [r'([Пп])омѧн([еиꙋ])\B', r'\1омѧн\2' + Oxia],

    # посѣтѝ
    [r'([Пп])осѣти\b', r'\g<0>' + Varia],
    # посѣти́ша
    [r'([Пп])осѣти\B', r'\g<0>' + Oxia],
    # посѣщꙋ̀
    [r'([Пп])осѣщ([аꙋ])\b', r'\1осѣщ\2' + Varia],
    # посѣща́еши
    [r'([Пп])осѣщ([ае])\B', r'\1осѣщ\2' + Oxia],

    # по́слѣ
    [r'([Пп])о(?=слѣ\b)', r'\1о' + Oxia],
    # послѣ́днїй
    [r'([Пп])ослѣ(?=д)', r'\1ослѣ' + Oxia],

    [r'\bпре(?=дъ)\b', r'пре' + Oxia],
    [r'([Пп])ра(?=вед)', r'\1ра' + Oxia],
    [r'([Пп])редте(?=ч)', r'\1редте' + Oxia],

    [r'([Пп])редстои', r'\1редстои' + Oxia],
    # ??? для предстоитѐ
    # [r'([Пп])редстои\B(?!те)', r'\1редстои' + Oxia],
    # [r'([Пп])редстоите', r'\1редстои' + Oxia],
    [r'([Пп])редстоѧ\b', r'\1редстоѧ' + Varia],
    [r'([Пп])редстоѧ\B', r'\1редстоѧ' + Oxia],
    [r'([Пп])ре(?=жде)', r'\1ре' + Oxia],

    [r'([Пп])реподо(?=б)', r'\1реподо' + Oxia],
    [r'([Пп])речи(?=ст)', r'\1речи' + Oxia],

    [r'([Пп])ризва(?=вн)', r'\1ризва' + Oxia],
    [r'([Пп])ризва(?=л(?!а))', r'\1ризва' + Oxia],
    [r'([Пп])ризвала\b', r'\1ризвала' + Varia],

    # прїидѝ
    [r'([Пп])ріид([иꙋ])\b', r'\1рїид\2' + Varia],
    # прїиди́те
    [r'([Пп])ріид([ио])\B', r'\1рїид\2' + Oxia],
    # прїи́демъ
    [r'([Пп])ріи(?=дем)', r'\1рїи' + Oxia],

    [r'([Пп])ріими', r'\1рїими' + Varia],

    [r'прилѣ(?=ж)', r'прилѣ' + Oxia],
    [r'присѣща', r'присѣща' + Oxia],
    [r'([Пп])ри(?=снѡ\b)', r'\1ри' + Oxia],
    [r'простира', r'простира' + Oxia],
    [r'\b([Пп])роро', r'\1роро' + Oxia],

    # ѱало́мъ
    [r'([Ѱѱ])ало(?=м)', r'\1ало' + Oxia],
    # ѱалти́рь
    [r'([Ѱѱ])алт([иы])', r'\1алт\2' + Oxia],
    # ѱалмы̀
    [r'([Ѱѱ])алм([аеѣы])\b', r'\1алм\2' + Varia],
    [r'([Ѱѱ])алмопѣ(?=в)', r'\1алмопѣ' + Oxia],

    [r'пꙋт([еѧ])(?=м[иъ])', r'пꙋт\1' + Oxia],
    [r'пꙋ(?=т(ь|ник))', r'пꙋ' + Oxia],

    # ра́ди
    [r'\b([Рр])а(?=ди\b)', r'\1а' + Oxia],
    # ра́дость ра́дꙋйсѧ ра́дꙋйтесь
    [r'([Рр])а(?=д(ост[ень]|ꙋй(сѧ|тесь)))', r'\1а' + Oxia],
    [r'([Рр])а(?=звѣ)', r'\1а' + Oxia],
    [r'([Рр])азꙋмѣ(?=в(?!а)|[еийлнстхшю])', r'\1азꙋмѣ' + Oxia],

    [r'пререка', r'пререка' + Oxia],
    # рѣ́чь
    [r'\bрѣ(?=ч[иь]|ам[иъ]\b)', r'рѣ' + Oxia],
    # речѐ
    [r'рече\b', r'рече' + Varia],
    # ре́клъ
    [r'(?<!мѧ)ре(?=кл?ъ)', r'ре' + Oxia],
    # рцы̀
    [r'рцы\b', r'рцы' + Varia],
    # рцы́те
    [r'рцы\B', r'рцы' + Oxia],

    [r'([Рр])азрѣш([аеи])\B', r'\1азрѣш\2' + Oxia],
    [r'([Рр])азрѣш([иꙋ])\b', r'\1азрѣш\2' + Varia],
    # TODO:
    # [r'([Ѿѿ])рѣш([аеи])\B', r'\1рѣш\2' + Oxia],
    # [r'([Ѿѿ])рѣш([иꙋ])\b', r'\1рѣш\2' + Varia],

    # ро́дъ ро́дꙋ
    [r'ро(?=д[аеѣиꙋъ]\b)', r'ро' + Oxia],

    [r'\bри(?=з([аеоꙋы]))', r'ри' + Oxia],

    # рꙋ́сскїй
    [r'([Рр])ꙋ(?=сск)', r'\1ꙋ' + Oxia],
    # рѡссі́ѧ
    [r'([Рр])ѡссі(?!ѧн)', r'\1ѡссі' + Oxia],

    # [r'([Сс])вѣ(?=т)', r'\1вѣ' + Oxia],
    # [r'([Сс])вѣт([ъаꙋеѣ]|омъ|л(аѧ|о([еѣй]|мꙋ)|ꙋю|ый))\b', r''],

    [r'([Сс])аваѡ(?=ѳ)', r'\1аваѡ' + Oxia],

    # свѣ́тъ свѣ́тлый свѣ́та свѣ́телъ
    [r'''
        # ! (свѣтисѧ свѣтлейш. 
        # свѣтозарн. свѣтоподат.
        # свѣтоносн. свѣтѧщійсѧ)
        ([Сс])вѣ
        (?!
            т
            (
                и 
                |л
                    (
                        а\b
                        |[еѣ][ей]
                        #|о\B
                    ) 
                |о[дзлнп]
                |ѧ\B
            )

        )
        (?=т)
        ''',
     r'\1вѣ' + Oxia
     ],
    # свѣти́сѧ свѣти́льникъ свѣти́ло
    [r'([Сс])вѣти(?=л[оь]|сѧ)', r'\1вѣти' + Oxia],
    [r'([Сс])вѣтода(?=в)', r'\1вѣтода' + Oxia],
    [r'([Сс])вѣтоза(?=рн)', r'\1вѣтоза' + Oxia],
    [r'([Сс])вѣтоли(?=т)', r'\1вѣтоли' + Oxia],
    [r'([Сс])вѣтоно(?=с)', r'\1вѣтоно' + Oxia],
    [r'([Сс])вѣтопода(?=т)', r'\1вѣтопода' + Oxia],
    # свѣтлѣ́е свѣтлѣ́йшꙋю
    [r'([Сс])вѣтлѣ(?=[ей])', r'\1вѣтлѣ' + Oxia],

    [r'([Сс])вирѣ(?=л)', r'\1вирѣ' + Oxia],
    [r'([Сс])вое(ѧ|г[оѡ])', r'\1вое\2' + Varia],
    [r'([Сс])во([еиюѧ])\b', r'\1во\2' + Varia],
    [r'([Сс])вое(?=ю)', r'\1вое' + Oxia],
    [r'\b([Сс])вои(?=[мх])', r'\1вои' + Oxia],

    # свѧ́тъ свѧ́те
    [r'([Сс])вѧ(?=т[аеѣиоѡꙋъы]\b)',
     r'\1вѧ' + Oxia],
    # свѧта́ѧ свѧте́й свѧтꙋ́ю свѧты́ѧ свѧти́тель
    [r'([Сс])вѧт(?P<ac>[аеѣиꙋы]\B)',
     r'\1вѧт\g<ac>' + Oxia],
    # свѧто́е
    [r'([Сс])вѧт(?P<ac>о)(?=[ейм])',
     r'\1вѧт\g<ac>' + Oxia],

    # свѧще́нникъ свѧще́нїе ѻ҆свѧще́нный
    [r'''
        ([Сс])вѧще
        (?=
            нн?
            (
                [аиіеѣꙋы]\B
                # ! свѧщеннолѣп- свѧщеннотайн-
                |о(?![дилт]|мон)
            )
        )
        ''',
     r'\1вѧще' + Oxia],
    # посвѧща̀ти
    [r'свѧща\B', r'свѧща' + Varia],
    [r'([Сс])вѧщꙋ\b', r'\1вѧщꙋ' + Varia],

    # сего̀
    [r'\b([Сс])его\b', r'\1его' + Varia],
    # се́й
    [r'\b([Сс])е(?=й\b)', r'\1е' + Oxia],
    # сеѧ̀ сїѐ
    [r'\b([Сс])(еѧ|іе)\b', r'\g<0>' + Varia],
    # сі́и
    [r'\b([Сс])і(?=и\b)', r'\1і' + Oxia],

    [r'селе(?=ні)', r'селе' + Oxia],

    [r'\bсе(?=мъ\b)', r'се' + Oxia],

    # сѣ́мо
    [r'\bсѣ(?=мо\b)', r'сѣ' + Oxia],
    # сѣ́нь
    [r'''
        сѣ(?=н
            (?!
                (
                н?[оѡ](вн|писан)
                |ен
                |[иѧ]
                )
            )
        )
        ''', r'сѣ' + Oxia],

    [r'([Сс])ераф(?=ім)', r'\1ераф' + Oxia],

    [r'([Сс])е(?=рдц([ꙋы]|[ѣе](мъ)?))', r'\1е' + Oxia],
    # [r'([Сс])ердца\b', r'\1ердца' + Varia],  # от числа.
    [r'([Сс])ердца(?=м)', r'\1ердца' + Kamora],

    # сѣ́ть
    [r'\bсѣ(?=т)', r'сѣ' + Oxia],

    [r'([Сс])и(?=л[аеѣоꙋы]\b)', r'\1и' + Oxia],
    [r'([Сс])ілꙋа(?=н)', r'\1їлꙋа' + Oxia],
    [r'\b([Сс])іѡ(?=н[аеѣоѡꙋъѧ]\b)', r'\1їѡ' + Oxia],
    [r'си(?=рѣчь)', r'си' + Oxia],
    # си́це
    [r'([Сс])и(?=це\b)', r'\1и' + Oxia],
    # сїѐ сїѧ̀ сїю̀
    [r'\b([Сс])і([еюѧ])\b', r'\1ї\2' + Varia],
    # cїѧ́нїе
    [r'\b([Сс])іѧ\B', r'\1їѧ' + Oxia],

    [r'([Сс])кит([аеѣꙋы])\b', r'\1кит\2' + Varia],
    [r'([Сс])кита\B', r'\1кита' + Oxia],
    [r'([Сс])кито\B(?!н)', r'\1кито' + Oxia],

    # скорбѧ́щемъ
    [r'\bскорбѧ(?=[мщ])', r'скорбѧ' + Oxia],
    # ско́рби (! скорбѧ́щ- )
    # [r'\bско(?=рб(?!ѧ[мщ]))', r'ско' + Oxia],
    [r'\b([Сс])ко(?=рб(е[мхн]|н|и\b|ію|ь))', r'\1ко' + Oxia],
    [r'\b([Сс])корбѣ(?=[влнт])', r'\1корбѣ' + Oxia],
    [r'\b([Сс])корбьми\b', r'\1корбьми' + Varia],

    [r'\b([Сс])ко(?=рѡ)', r'\1ко' + Oxia],

    [r'([Сс])ладча(?=йш)', r'\1ладча' + Oxia],

    # славле́нїе
    [r'([Сс])лавл([еѧ])', r'\1лавл\2' + Oxia],
    # славосло́вїе
    [r'([Сс])лавосло(?=в)', r'\1лавосло' + Oxia],
    # сла́ва сла́внаѧ (! славле́н- славосло́в-)
    [r'([Сс])ла(?=в(?!ослов|л[еѧ]))',
     r'\1ла' + Oxia],

    # сле́зъ слеза̀ слеза́ми слезѧ́щи прослези́шасѧ
    [r'слез([аꙋ])\b', r'слез\1' + Varia],
    [r'сле(?=з(([ыъ])|н([аоꙋы])))', r'сле' + Oxia],
    [r'слеза(?=[мх])', r'слеза' + Oxia],
    [r'слезо(?=[йю])', r'слезо' + Oxia],
    [r'слезѧ(?=щ)', r'слезѧ' + Oxia],
    [r'слези(?=[хш])', r'слези' + Oxia],

    [r'([Сс])ловес([аеиы])\b', r'\1ловес\2' + Varia],
    [r'([Сс])лове(?=съ\b)', r'\1лове' + Oxia],

    # смире́нїе смире́нно
    [r'смире(?=н(і|н(?!омꙋд)))', r'смире' + Oxia],
    # смиренномꙋ́дрый
    [r'смиренномꙋ(?=д)', r'смиренномꙋ' + Oxia],

    # снѣ́гъ снѣ́жный
    [r'снѣ(?!гам|жат)(?=[гж])', r'снѣ' + Oxia],
    [r'([Сс])обо(?=ю)', r'\1обо' + Oxia],

    [r'([Сс])огрѣ(?=всѧ|[ейстхюѧ]|ш(а\b|ш))', r'\1огрѣ' + Oxia],
    [r'([Сс])огрѣва', r'\1огрѣва' + Oxia],

    [r'([Сс])офрѡ(?=н)', r'\1офрѡ' + Oxia],

    # стена́нїе стена́ньми
    [r'стена(?=н[іь])', r'стена' + Oxia],
    [r'стенѧ(?=[йщ])', r'стенѧ' + Oxia],
    [r'стенѧ\b', r'стенѧ' + Varia],
    # стѣна̀
    [r'стѣн([аеѣоꙋы])\b', r'стѣн\1' + Varia],
    # стѣно́ю
    [r'стѣно(?=ю)', r'стѣно' + Oxia],
    # стра́ждꙋщїй стра́ждетъ
    [r'стра(?=жд(ꙋщ|е))', r'стра' + Oxia],

    [r'страда(?=[влнстхш])', r'страда' + Oxia],
    # стра́хъ стра́шный стра́се
    [r'стра(?=(х(?!ован)|ше?н|с[еѣ]))',
     r'стра' + Oxia],

    # стра́сть стра́сти
    [r'([Сс])тра(?=ст([иь]|но))', r'стра' + Oxia],
    # страсте́мъ страстѧ́хъ
    [r'([Сс])траст(?P<ac>[еѧ])(?=[ймх])',
     r'страст\g<ac>' + Oxia],
    # страстна́ѧ
    [r'([Сс])трастн(?P<ac>[аоꙋы])(?=[ейюѧ])',
     r'страстн\g<ac>' + Oxia],
    # страстоте́рпецъ
    [r'([Сс])трастоте(?=рп)', r'страстоте' + Oxia],

    # спа́съ спа́слъ спа́совъ спа́се спасе́нїе спасѝ спаси́тель спасо́шасѧ спаса́ти спасе́нъ спаса́ющїй
    [r'([Сс])пас[иꙋ]\b', r'\g<0>' + Varia],
    [r'([Сс])па(?=с([аеѣ]|л?ъ|овъ)\b)', r'\1па' + Oxia],
    [r'([Сс])пас([аеи])\B', r'\1пас\2' + Oxia],
    [r'([Сс])пасо(?!въ)\B', r'\1пасо' + Oxia],

    [r'([Сс])подо(?=би)', r'\1подо' + Oxia],

    # сы́нъ сыны̀ сы́номъ сы́не сыно́внїй сыново́мъ сыно́въ
    [r'\b([Сс])ыны\b', r'\1ыны' + Varia],
    [r'\b([Сс])ы(?=н([аеѣꙋъ]|омъ)\b)', r'\1ы' + Oxia],
    [r'\b([Сс])ыно(?=в[нъ])', r'\1ыно' + Oxia],
    [r'\b([Сс])ыново(?=м)', r'\1ыново' + Oxia],
    [r'\b([Сс])ына(?=м[иъ])', r'\1ына' + Oxia],

    [r'\b([Сс])ы(?=й\b)', r'\1ы' + Oxia],

    # та́къ та́коже та́кѡ та́кожде
    [r'\b([Тт])а(?=к[ѡоъ](жд?е)?\b)', r'\1а' + Oxia],

    [r'\b([Тт])а(?=же\b)', r'\1а' + Oxia],
    [r'\b([Тт])а(?=ѧ(же)?\b)', r'\1а' + Oxia],
    [r'\b([Тт])ꙋ(?=ю(же)?)', r'\1ꙋ' + Oxia],
    [r'\b([Тт])ы(?=ѧ)', r'\1ы' + Oxia],

    # та́йна та́йнѣмъ та́йнымъ та́йномꙋ
    [r'та(?=йн([аеѣꙋы]|ом[ꙋъ]))', r'та' + Oxia],
    [r'та(?=ин(ъ|ство))', r'та' + Oxia],
    [r'таи(?=нни)', r'таи' + Oxia],

    [r'таѧ(?=щ)', r'таѧ' + Oxia],

    [r'тва(?=рь)', r'тва' + Oxia],

    [r'\b([Тт])вое\b', r'\1вое' + Varia],
    [r'\b([Тт])во(е?ѧ)', r'\g<0>' + Varia],
    [r'\b([Тт])вою', r'\1вою' + Varia],
    [r'\b([Тт])вое(мꙋ|г[оѡ])', r'\g<0>' + Varia],
    [r'\b([Тт])вое(?=[ймю])', r'\1вое' + Oxia],
    [r'\b([Тт])вои(?=([мх])ъ)', r'\1вои' + Oxia],
    [r'\b([Тт])во(?=й)', r'\1во' + Oxia],
    [r'\b([Тт])еб([еѣ])', r'\1еб\2' + Varia],
    [r'\b([Тт])ѣ(?=мже)', r'\1ѣ' + Oxia],

    # тѣ́ло тѣ́лꙋ
    [r'\b([Тт])ѣ(?=л\w\b)', r'\1ѣ' + Oxia],
    # тѣле́сн-
    [r'\b([Тт])ѣле(?=сн)', r'\1ѣле' + Oxia],
    # тѣлесѝ
    [r'\b([Тт])ѣлеси\b', r'\1ѣлеси' + Varia],

    # тепло̀
    [r'\bтепло\b', r'тепло' + Varia],
    # те́плый те́плой
    [r'\bте(?=пл([аеѣыꙋ]|о(?!хл|т|\b)))', r'те' + Oxia],
    # теплота̀
    [r'\bтеплот[аеѣоꙋы]\b', r'\g<0>' + Varia],
    # теплото́ю
    [r'\bтеплото\B', r'теплото' + Oxia],
    # теплохла́дный
    [r'\bтеплохла(?=дн)', r'теплохла' + Oxia],

    # терпѣ̀  терпѧ̀
    [r'([Тт])ерп([ѣиѧ])\b', r'\1ерп\2' + Varia],
    # терпѣ́нїе
    [r'([Тт])ерпѣ\B(?!лив|ва)', r'\1ерпѣ' + Oxia],
    # терпѣли́вый
    [r'([Тт])ерпѣли(?!во(д|мꙋд|нос|стра))(?=в)', r'\1ерпѣли' + Oxia],
    # претерпѣва́ющи
    [r'([Тт])ерпѣва', r'\1ерпѣва' + Oxia],

    # ти́хїй ( ! тихообразно )
    [r'\b([Тт])и(?!х(а\b|о[ѻѡг]))', r'\1и' + Oxia],
    [r'\b([Тт])иха\b', r'\1иха' + Varia],

    # тлѣ́нъ тлѣ́нїе нетлѣ́нный тлѣ́ть
    [r'тлѣ(?=н[інъ]|т[иь])', r'тлѣ' + Oxia],
    # тобо́ю
    [r'\b([Тт])обо(?=ю)', r'\1обо' + Oxia],
    # то́кмѡ
    [r'то(?=кмѡ)', r'то' + Oxia],
    # Тро́ица
    [r'\b([Тт])ро(?=[ий][цч])', r'\1ро' + Oxia],

    # тропа́рь
    [r'\b([Тт])ропа(?=рь)', r'\1ропа' + Oxia],
    [r'\b([Тт])ропар([еѣиѧ])\B', r'\1ропар\2' + Oxia],
    [r'\b([Тт])ропар([еѣиюѧ])\b', r'\1ропар\2' + Varia],

    # тьма̀ тьмѣ̀
    [r'\bтьм([аѣꙋы]\b)', r'тьм\1' + Varia],

    # ᲂу҆́бѡ
    [r'^([Оᲂ]у)(?=бѡ\b)', r'\1' + Iso],
    # ᲂу҆вы̀
    [r'^([Оᲂ]у)вы\b', r'\1вы' + Varia],
    # ᲂу҆́дъ ᲂу҆́ды
    [r'^([Оᲂ]у)(?=д[ыъ]\b)', r'\1' + Iso],
    # ᲂу҆́зримъ
    [r'^([Оᲂ]у)(?=зри[[мт]ъ|тсѧ|иш|ѧтъ|ю]\b)', r'\1' + Iso],
    # ᲂу҆зрѣ
    [r'^([Оᲂ]у)зрѣ\b', r'\1зрѣ' + Varia],
    # ᲂу҆зрѣша
    [r'^([Оᲂ]у)зрѣ\B', r'\1зрѣ' + Oxia],

    # ᲂу҆́зы
    [r'^([Оᲂ]у)(?=з[ыъ]\b)', r'\1' + Iso],
    # ᲂу҆крепле́нїе ᲂу҆крѣплѧ́ше
    [r'^([Оᲂ]у)крѣпл([еѧ])', r'\1крѣпл\2' + Oxia],
    [r'^([Оᲂ]у)крѣпи\B', r'\1крѣпи' + Oxia],
    [r'^([Оᲂ]у)крѣпи\b', r'\1крѣпи' + Varia],

    # ᲂу҆миле́нїе ᲂу҆миле́ннный
    [r'^([Оᲂ]у)миле(?=н)', r'\1миле' + Oxia],
    # ᲂу҆́мъ ᲂу҆́мный ᲂу҆́мно ᲂу҆́ме
    [r'''
        ^
        ([Оᲂ]у)
        (?=
            м
            (
                [ъеѣ]\b # ᲂу҆́м ᲂу҆́ме
                |н
                (?!
                    [еѣ] # ! ᲂумнѣй-
                    |о\B # ! ᲂумножая
                )
            )
        )
        ''',
     r'\1' + Iso
     ],
    # ᲂу҆мы̀ ᲂу҆мꙋ̀
    [r'^([Оᲂ]у)м([аꙋы])\b', r'\1м\2' + Varia],

    # ᲂу҆мно́жить ᲂу҆мно́жꙋ
    [r'^([Оᲂ]у)мно(?=ж[иꙋ])', r'\1мно' + Oxia],
    # ᲂу҆множа́ти
    [r'^([Оᲂ]у)множа(?=\w)', r'\1множа' + Oxia],
    # ᲂу҆твердѝ
    [r'^([Оᲂ]у)тверди\b', r'\1тверди' + Varia],
    # ᲂу҆тверди́ша
    [r'^([Оᲂ]у)тверди\B', r'\1тверди' + Oxia],

    # ᲂу҆твержде́нный
    [r'^([Оᲂ]у)твержде(?=н)', r'\1твержде' + Oxia],
    # ᲂу҆твержда́еши
    [r'^([Оᲂ]у)твержда(?=\w)', r'\1твержда' + Oxia],

    # ᲂу҆тѣше́нїе
    [r'^([Оᲂ]у)тѣше(?=ні)', r'\1тѣше' + Oxia],
    # ᲂу҆тѣ́ши ᲂу҆тѣ́шꙋ ᲂу҆тѣ́шитель ᲂу҆тѣ́шивъ
    [r'''
        ^([Оᲂ]у)тѣ
        (?=
            ш
            (
                ([иꙋ]|енъ)\b
                |и
                (
                    тел
                    # ! ᲂу҆тѣши́тельный
                    (?!ьн) # ???  
                    |в
                ) 
            )
        )
        ''',
     r'\1тѣ' + Oxia
     ],

    # ᲂу҆тѣша́ти
    [r'^([Оᲂ]у)тѣша\B', r'\1тѣша' + Oxia],
    # ᲂу҆тѣши́тельный ???
    [r'^([Оᲂ]у)тѣши(?=тельн)', r'\1тѣши' + Oxia],

    [r'^([Оᲂ]у)(?=[хш][оиы]\b)', r'\1' + Iso],

    [r'фарісе', r'фарїсе' + Oxia],
    [r'\b([Ѳѳ])ѡм([аеѣоꙋы]\b)', r'\1ѡм\2' + Varia],

    [r'ходи(?=ша)', r'ходи' + Oxia],
    [r'([Хх])лѣ(?=б)', r'\1лѣ' + Oxia],

    [r'([Ѳѳ])авѡ(?=р)', r'\1авѡ' + Oxia],

    # хрїсто́съ
    [r'([Хх])рісто(?=[вмс])', r'\1рїсто' + Oxia],
    # хрїста̀
    [r'([Хх])ріст([аеѣꙋ])\b', r'\1рїст\2' + Varia],

    # ца́рь ца́рскїй
    [r'([Цц])а(?=р([сь]))', r'\1а' + Oxia],
    # царю̀
    [r'([Цц])ар([иеѣюѧ])\b', r'\1ар\2' + Varia],
    # царе́ви
    [r'([Цц])ар([еє])\B', r'\1ар\2' + Oxia],
    # цари́ца
    [r'([Цц])ари(?=ц)', r'\1ари' + Oxia],

    # цвѣ́тъ цвѣ́те цвѣ́лъ цвѣ́томъ
    [r'''
        ([Цц])вѣ
        (?=
            (
                т
                (
                    [еѣꙋиъ]
                    |омъ
                )
            )\b
            |лъ
        )''',
     r'\1вѣ' + Oxia
     ],

    # це́рковь це́ркви
    [r'([Цц])е(?=рк(в(?!([аѧ]м|ей))|овь))', r'\1е' + Oxia],
    # церква́ми церквѧ́ми
    [r'([Цц])еркв([аѧ])(?=м)', r'\1еркв\2' + Oxia],
    # церкве́й
    [r'([Цц])еркве(?=й)', r'\1еркве' + Oxia],
    # церко́вный
    [r'([Цц])ерко(?=вн)', r'\1ерко' + Oxia],

    # ча́ѧше
    [r'([Чч])а(?=ѧ)', r'\1а' + Oxia],
    # человѣ́къ
    [r'([Чч])еловѣ(?=ч|к(?!олюб))', r'\1еловѣ' + Oxia],
    # человѣколю́бный
    [r'([Чч])еловѣколю(?=б)', r'\1еловѣколю' + Oxia],

    [r'([Чч])естнѣ(?=йш)', r'\1естнѣ' + Oxia],

    # чи́стый чи́стꙋю чи́стей чи́стилъ
    [r'([Чч])и(?=ст(?!от|ейш|илищ|итель))', r'\1и' + Oxia],
    # чистота̀
    [r'([Чч])истот([аеѣꙋы])\b', r'\1истот\2' + Varia],
    # чистото́ю
    [r'([Чч])истото(?=ю)', r'\1истото' + Oxia],
    # чисте́йшаѧ
    [r'([Чч])ист([еѣ])(?=йш)', r'\1ист\2' + Oxia],
    # ѡ҆чисти́тельный
    [r'([Чч])исти(?=тель)', r'\1исти' + Oxia],

    [r'\b([Юю])(?=же\b)', r'\1' + Iso],
    # ю҆́ность
    [r'\b([Юю])(?!н([еєѣ]|ц([аы]|[еєѡ])))', r'\1' + Iso],
    # ю҆нцы̀
    [r'\b([Юю])нц([аеѣꙋы])\b', r'\1нц\2' + Varia],

    [r'\b([Ꙗꙗ])ви\b', r'\1ви' + Varia],
    [r'\b([Ꙗꙗ])ви\B', r'\1ви' + Oxia],
    # ꙗ҆́вѣ
    [r'\b([Ꙗꙗ])(?=вѣ\b)', r'\1' + Iso],
    # ꙗ҆́вно ꙗ҆́вственно ꙗ҆́вльсѧ
    [r'\b([Ꙗꙗ])(?=в(ль|ст|н))', r'\1' + Iso],
    [r'', r''],
    [r'', r''],
    [r'', r''],
    [r'', r''],

    [r'\b([Ꙗꙗ])(?=(ко)?же\b)', r'\1' + Iso],
    [r'\b([Ꙗꙗ])(?=кѡ\b)', r'\1' + Iso],

    # months
    [r'епте(?=мвріа)', r'епте' + Oxia],
    [r'ктѡ(?=вріа)', r'ктѡ' + Oxia],
    [r'ое(?=мвріа)', r'ое' + Oxia],
    [r'еке(?=мвріа)', r'еке' + Oxia],
    [r'([Іі])аннꙋа(?=ріа)', r'\1аннꙋа' + Oxia],
    [r'еврꙋа(?=ріа)', r'еврꙋа' + Oxia],
    [r'([Мм])а(?=рта)', r'\1а' + Oxia],
    [r'прі(?=ліа)', r'прі' + Oxia],
    [r'\b([Мм])а(?=іа)', r'\1а' + Oxia],
    [r'([Іі])ꙋ(?=[лн]іа)', r'\1ꙋ' + Oxia],
    [r'([Аа])(?=ѵгꙋста)', r'\1' + Iso],
)
# Выставить титла
regs_titles_set = (
    [r'(?<!ѵ)([Аа])нге(?=л)', r'\1гг' + titlo],
    [r'([Аа])посто(?=л)', r'\1п' + titlo_s],
    [r'([Бб])лагода(?=т)', r'\1лг' + titlo_d],
    [r'([Бб])лагосло(?=в)', r'\1лг' + titlo_s],
    [r'([Бб])ла(?=[гж])', r'\1л' + titlo],
    [r'''
        \b
        ([Бб])ог
        (?=
            [аеꙋъ]\b
            |а\B(?![тщ])
            |о(?!родиц|хꙋл|мерз) # ???
        )
        ''',
     r'\1г' + titlo
     ],
    [r'([Бб])огородиц', r'\1ц' + titlo_d],
    [r'''
        \b
        ([Бб])ож
        (?=і|е(ств|\b))
        ''',
     r'\1ж' + titlo
     ],
    [r'\b([Бб])оз(?=ѣ)', r'\1з' + titlo],
    [r'([Вв])лады(?=[кчц])', r'\1л' + titlo_d],
    [r'([Вв])оскре(?=с\w\b)', r'\1оскр' + titlo],
    [r'([Вв])оскресе?(?=\w\B)', r'\1оскр' + titlo_s],
    [r'\b([Гг])лагол', r'\1л' + titlo],
    [r'\b([Гг])ласъ', r'\1ла' + titlo_s],
    [r'\b([Гг])оспод', r'\1д' + titlo_s],
    [r'\b([Гг])оспо(?=ж)', r'\1п' + titlo_s],

    [r'\b([Дд])ави(?=д)', r'\1в' + titlo],

    # дѣва
    [r'''
        \b
        ([Пп]рисно)?
        ( 
            [Дд] 
        )
        (?P<remove> # <- указание удалить ударение
            ѣ
        )
        в
        (?=[аеѣиоꙋы])
        ''',
     r'\1\2в' + titlo
     ],

    [r'([Дд])ѣвс(?=тв)', r'\1в' + titlo_s],
    [r'\b([Дд])ен(?=ь)', r'\1н' + titlo],
    [r'\b([Дд])не(?=сь)', r'\1н' + titlo],
    [r'\b([Дд])ꙋх', r'\1х' + titlo],

    # !!! два титла
    [r'''
        \b
        ([Бб])о?г
        о?дꙋх''',
     r'\1г' + titlo + r'одх' + titlo
     ],

    [r'\b([Дд])ꙋш', r'\1ш' + titlo],
    [r'\b([Дд])ꙋс(?=[еѣ]\b)', r'\1с' + titlo],
    [r'\b([Єє])ѵанге(?=л)', r'\1ѵ' + titlo_g],
    [r'([Іі])ерꙋса(?=л)', r'\1ер' + titlo_s],
    [r'([Іі])зраи(?=л)', r'\1и' + titlo],
    [r'([Іі])исꙋ(?=с)', r'\1и' + titlo],
    [r'([Ии])мѧ(?=рек)', r'\1м' + titlo],
    [r'\b([Кк])рес(?=т)', r'\1р' + titlo_s],
    [r'\b([Мм])ар(?=(і[аеѣиюѧ]))',
     r'\1р' + titlo],

    # ма́терь ма́ти
    [r'''
        \b
        (?P<prefix>
            (?:
                [Бб](?:г҃|ог)о
                |[Дд](?:ѣв|в҃)о
            )?
        )   
        (?P<m>[Мм])ат
        (?=
            и
            |ер
        )
        ''', r'\g<prefix>\g<m>т' + titlo
     ],
    [r'([Мм])ѣсѧц(?=ъ)', r'\1ц' + titlo_s],
    [r'([Мм])илосе(?=рд)', r'\1л' + titlo_s],
    [r'([Мм])илос(?=т)', r'\1л' + titlo_s],
    [r'([Мм])оли(?=тв)', r'\1л' + titlo],
    [r'мꙋд(?=р)', r'м' + titlo_d],
    [r'([Мм])ꙋче(?=ни[кчц])', r'\1ч' + titlo],
    [r'([Мм])ладе(?=не?[чц])', r'\1л' + titlo_d],
    [r'\b([Нн])еб(?=\w\b)', r'\1б' + titlo],
    [r'\b([Нн])ебес(?=н)', r'\1б' + titlo_s],
    [r'\b([Нн])едѣл', r'\1л' + titlo_d],
    [r'([Нн])ын(?=ѣ)', r'\1н' + titlo],
    [r'([Ѻѻ])те?ц', r'\1ц' + titlo],  # @@@ вариат.
    [r'([Ѻѻ])те?ч(?!ест|а(ѧн|йш))', r'\1ч' + titlo],  # @@@ вариат.
    [r'([Пп])равед(?=е?н)', r'\1рв' + titlo_d],
    [r'([Пп])реподо(?=б(е?н))', r'\1рп' + titlo_d],
    [r'([Пп])ред(?=теч)', r'\1р' + titlo_d],
    [r'([Пп])рис(?=нѡ\b)', r'\1р' + titlo_s],
    [r'([Пп])ро(?=ро[кч])', r'\1р' + titlo_o],
    [r'([Рр])ождес(?=тв)', r'\1ж' + titlo_s],
    [r'([Сс])вѧ([тщ])', r'\1\2' + titlo],
    [r'([Сс])ерде?(?=[цч])', r'\1р' + titlo_d],
    # FIXME: смр҃ть (??? вариант см҃рть)
    [r'([Сс])ме(?=рт)', r'\1м' + titlo],
    [r'([Сс])па(?=с)', r'\1п' + titlo],

    # страсть
    [r'''
        ([Сс])тр
        (?P<remove>
            а
        )
        с(?=т)
        ''', r'\1тр' + titlo_s
     ],
    [r'([Сс])ын(?=[аеєѣоꙋъ])', r'\1н' + titlo],  # @@@ вариат.
    [r'([Тт])рои(?=[цч])', r'\1р' + titlo_o],
    [r'(?<!нт[иі])([Хх])ріс(?=т)', r'\1р' + titlo_s],
    [r'([Чч])ело(?=вѣ[кч])', r'\1л' + titlo],
    [r'([Чч])ес(?=тн)', r'\1' + titlo_s],
    [r'([Чч])ис(?=т)', r'\1' + titlo_s],
    [r'([Цц])арс', r'\1р' + titlo_s],
    [r'([Цц])ар(?=\w)', r'\1р' + titlo],
    [r'([Цц])ер(?=к)', r'\1р' + titlo],
)

# Раскрыть титла
regs_titles_open = (
    [r'([Аа])гг' + titlo, r'\1нге'],
    [r'([Аа])п' + titlo_s, r'\1посто'],
    [r'([Бб])л' + titlo + r'([гж])', r'\1ла\2'],
    [r'([Бб])лг' + titlo_d, r'\1лагода'],
    [r'([Бб])лг' + titlo_s, r'\1лагосло'],
    [r'([Бб])([гжз])' + titlo, r'\1о\2'],
    [r'([Бб])ц' + titlo_d, r'\1огородиц'],
    [r'([Вв])л' + titlo_d, r'\1лады'],
    [r'\b([Гг])л' + titlo, r'\1лагол'],
    [r'\b([Гг])ла' + titlo_s, r'\1ласъ'],
    [r'\b([Гг])д' + titlo_s, r'\1оспод'],
    [r'\b([Гг])п' + titlo_s + r'ж', r'\1оспож'],
    [r'\b([Дд])в' + titlo + r'д', r'\1авид'],
    [r'\b([Дд])в' + titlo + r'(?=[аеѣиоꙋы])', r'\1ѣв'],
    [r'([Дд])в' + titlo_s + r'(?=тв)', r'\1ѣвс'],
    [r'\b([Дд])н' + titlo + r'(?=ь)', r'\1ен'],
    [r'\b([Дд])н' + titlo + r'(?=сь)', r'\1не'],
    [r'([Дд])х' + titlo, r'\1ꙋх'],
    [r'\b([Дд])ш' + titlo, r'\1ꙋш'],
    [r'\b([Дд])с' + titlo + r'(?=[еѣ]\b)', r'\1ꙋс'],
    [r'\b([Єє])ѵ' + titlo_g + r'(?=л)', r'\1ѵанге'],
    [r'([Іі])ер' + titlo_s + r'(?=л)', r'\1ерꙋса'],
    [r'([Іі])и' + titlo + r'(?=л)', r'\1зраи'],
    [r'([Іі])и' + titlo + r'(?=с)', r'\1исꙋ'],
    [r'([Ии])м' + titlo + r'(?=рек)', r'\1мѧ'],
    [r'\b([Кк])р' + titlo_s + r'(?=т)', r'\1рес'],
    [r'\b([Мм])р' + titlo + r'(?=(і[аеѣиюѧ]))', r'\1ар'],
    [r'([Мм])т' + titlo + r'(?=и|ер)', r'\1ат'],
    [r'([Мм])ц' + titlo_s + r'(?=ъ)', r'\1ѣсѧц'],
    [r'([Мм])л' + titlo_d + r'(?=не?[чц])', r'\1ладе'],
    [r'([Мм])л' + titlo_s + r'(?=рд)', r'\1илосе'],
    [r'([Мм])л' + titlo_s + r'(?=т)', r'\1илос'],
    [r'([Мм])л' + titlo + r'(?=тв)', r'\1оли'],
    [r'м' + titlo_d + r'(?=р)', r'мꙋд'],
    [r'([Мм])ч' + titlo + r'(?=н)', r'\1ꙋче'],
    [r'\b([Нн])б' + titlo + r'(?=\w\b)', r'\1еб'],
    [r'\b([Нн])б' + titlo_s + r'(?=н)', r'\1ебес'],
    [r'\b([Нн])л' + titlo_d, r'\1едѣл'],
    [r'([Нн])н' + titlo + r'(?=ѣ)', r'\1ын'],
    [r'([Ѻѻ])ц' + titlo + r'(?=ъ)', r'\1тец'],
    [r'([Ѻѻ])ц' + titlo + r'(?=[аеєѣоꙋы])', r'\1тц'],
    [r'([Ѻѻ])ч' + titlo + r'(?=ес|н)', r'\1теч'],  #
    [r'([Ѻѻ])ч' + titlo, r'\1тч'],  #
    [r'([Пп])рв' + titlo_d + r'(?=е?н)', r'\1равед'],
    [r'([Пп])рп' + titlo_d + r'(?=б(е?н))', r'\1реподо'],
    [r'([Пп])р' + titlo_d + r'(?=теч)', r'\1ред'],
    [r'([Пп])р' + titlo_s + r'(?=нѡ\b)', r'\1рис'],
    [r'([Пп])р' + titlo_o + r'(?=ро[кч])', r'\1ро'],
    [r'([Рр])ж' + titlo_s + r'(?=тв)', r'\1ождес'],
    [r'([Сс])([тщ])' + titlo, r'\1вѧ\2'],
    [r'([Сс])р' + titlo_d + r'(?=цъ\b|чн)', r'\1ерде'],
    [r'([Сс])р' + titlo_d + r'(?=ц)', r'\1ерд'],
    [r'([Сс])мр' + titlo + r'(?=т)', r'\1мер'],
    [r'([Сс])п' + titlo + r'(?=с)', r'\1па'],
    [r'([Сс])тр' + titlo_s + r'(?=т)', r'\1трас'],
    [r'([Сс])н' + titlo + r'(?=[аеєѣоꙋъ])', r'\1ын'],  # @@@ вариат.
    [r'([Тт])р' + titlo_o + r'(?=[цч])', r'\1рои'],
    [r'([Хх])р' + titlo_s + r'(?=т)', r'\1ріс'],
    [r'([Чч])л' + titlo + r'(?=вѣ[кч])', r'\1ело'],
    [r'([Чч])' + titlo_s + r'(?=тн)', r'\1ес'],
    [r'([Чч])' + titlo_s + r'(?=т)', r'\1ис'],
    [r'([Цц])р' + titlo_s, r'\1арс'],
    [r'([Цц])р' + titlo + r'(?=\w\b)', r'\1ар'],
    [r'([Цц])р' + titlo + r'(?=иц)', r'\1ар'],
    [r'([Цц])р' + titlo + r'(?=к)', r'\1ер'],
)

# TODO: стат. анализ словаря
regs_acutes_morph = (
    # при анализе словаря
    # https://www.ponomar.net/files/wordlist.tsv
    # можно выбрать буквосочетания
    # с ударениями а также определить исключения, если их немного
    # например для -лѧю[щт]- одно исключение
    # 5     1     лѧ̑ющ     лѧющ (и҆спра́влѧюще )
    # 130   0     лѧ́ют     лѧют
    # 593   1     лѧ́ющ     лѧющ (и҆спра́влѧюще )
    #
    # 1 ст. - кол-во совпадений в словаре
    # выбранного фрагмента (3-й ст.)
    # 2 ст. - кол-во совпадений в словаре
    # для выбранного фрагмента, но без ударения (4-й ст.)
    # в скобках - полное слово для совпадения
    # (одно, в данном случае общее для -лѧ̑ющ- и -лѧ́ющ-)
)
