# _*_ coding: utf-8

from Letters import *

# Наборы регулярных выражений вида:
# [find, replace [, flags] ]
# компилируются перед запуском основной функции

# Буквы в словах: ѿ, ѡ, ѵ, ѣ, etc

OX = r'\1' + Oxia  #
VA = r'\1' + Varia  #
GO = r'\g<0>' + Oxia
GV = r'\g<0>' + Varia
GVA = GV
GOX = GO
GKA = r'\g<0>' + Kamora

IS = r'\1' + Oxia  #
GIS = r'\g<0>' + Iso
# va = VA + 'i'


regs_letters_in_word = (
    [  # ѿ
        r'''
        \bот
        (?!
            е?ц
            | е?ч(?!аѧн)
            | да[нт]
            | враща
            | врещи
            | в[еѣ][тщ]
            | жен
            | зд[еѣ]
            | иш
            #| крове # ѿкрове́нїе
            | расль
            | реб
            | ри\b
            | ро[кч]
                  
        )
        ''',
        r'ѿ'],  # или наоборот, перечислить ѿ ?

    [  # Ѿ
        r'''
        \bОт
        (?!
            е?ц
            | е?ч
            | да[нт]
            | враща
            | врещи
            | в[еѣ][тщ]
            | жен
            | зд[еѣ]
            | иш
            #| крове # ѿкрове́нїе
            | расль
            | реб
            | ри\b
            | ро[кч]
            
        )
        ''',
        r'Ѿ'],  # или наоборот, перечислить ѿ ?
    [r'\b([Ѿѿ])ъ\b', r'\1'],

    [r'ейш', r'ѣйш'],


    [r'\bОу(?=[' + cu_cap_letters + r']+)', r'ОꙊ'],  # УМ -> ОꙊ҆МЪ
    [r'\bО\b', r'Ѽ'],  # как правило - обращение
    [r'\bо\b', r'ѡ'],
    [r'\bо', r'ѻ'],
    [r'\bО(?!у)', r'Ѻ'],

    [  # ᲂꙋ -> ᲂу (для исправления ошибок набора)
        # проблема: узкое о
        # на границе слова '\bᲂ' не работает
        # условно \b = не буквы (ноль или больше)
        # все не-буквы попадают в pref и post
        # и вырезаются (с сохранением) в начале,
        # поэтому можно (конкретно для этого случая) использовать
        # ^ - начало строки
        # Вариант:  cu_non_letter + '*' + unicNarrowO + '?ꙋ'
        r'^' + unicNarrowO + 'ꙋ',
        'ᲂу'],


    [  # -ии- -> -їи-
        # TODO: -їѧ & -їа
        r'и(?=[аеєийоѡꙋюѧ])', r'ї'],

    [r'И(?=[АЕЄИЙОѠꙊЮѦаеєийоѡꙋюѧ])', r'І'],
    [r'ᲂ+', r'ᲂ'],

    # Zvatelce for first letter of word
    [r'^([АЄИІѴѠЮꙖаєиіѻѡюꙗ]|Ѻ(?!ꙋ))', r'\1' + Zvatelce],

    # Исправление ошибочного парсинга
    # слово начинается с прописной У
    # У -> Ꙋ -> Оу -> Ѻꙋ
    [r'Ѻꙋ', r'Оу'],

    # =========================
    [r'([Аа])кафист', r'\1каѳїст'],
    [r'([Аа])нти(?=х)', r'\1нтї'],
    [r'([Аа])ф(?=анас)', r'\1ѳ'],
    [r'([Аа])фо(?=н)', r'\1ѳѡ'],
    #
    [r'\bбед(?=[аеносꙋъы])', r'бѣд'],

    # -бѣг- -бѣж-
    [r'''  
        (
            \b(?:
                из|при|ѿ|на
            )?
            |^ᲂу
        )
        бе
        (?=
            (
                г
                |ж(?!д) # ! убежден-
            )
            [аеилноꙋъ]
        )
        ''',
        r'\1бѣ'],

    [r'([Бб])езме(?=(р|ст)н)', r'\1езмѣ'],

    [r'(\b|^ᲂу)бел', r'\1бѣл'],
    [r'\bбес(?=[аиноѡꙋы])', r'бѣс'],
    [r'\bбе\b', r'бѣ'],
    [r'\bбесте\b', r'бѣсте'],
    [r'\bбех(?=(ом)?ъ\b)', r'бѣх'],
    [r'\bбеша\b', r'бѣша'],
    [r'\bбде(?=[нт])', r'бдѣ'],
    [r'([Бб]лагогов)е(?=й?н)', r'\1ѣ'],
    [r'([Бб]лагодарн)о', r'\1ѡ'],
    [r'([Бб]лагод)е(?=тел)', r'\1ѣ'],
    [r'([Бб])оговеден', r'\1оговѣдѣн'],
    [r'\b([Бб])озе\b', r'\1озѣ'],
    [r'болезн', r'болѣзн'],

    # ========================
    #   вѣд вѣж вѣм вѣт вѣс вѣщ
    #   -вѣд-
    [r'''
        \b(не|из|([Зз]а|ис)?по)?
        вед
        (?=[аеиноыꙋь])
        ''',
        r'\1вѣд'],
    [r'\b((не)?[Вв])ѣдені', r'\1ѣдѣнї'],
    #   -вѣж-
    [r'\b(не)?веж', r'\1вѣж'],

    #   -вѣм-
    [r'''
        \b((ис)?по)?
        вем
        (?=[ыъ])
        ''',
        r'\1вѣм'],

    #   -вѣс-
    [r'\b([Нн]е|[Сс]о|[Бб]лаго)?вес(?=и\b|т)', r'\1вѣс'],

    #   -вѣт-
    [r''' 
        \b([Зз]а|из|ѻт|ꙋ|на|со)
        вет
        (?=[ълнаеиоѡꙋы])
        ''',
        r'\1вѣт'],
    [r'веті(?=[иѧ])', r'вѣті'],

    #   -вѣщ-
    [r'''
        (?<!кле)
        вещ
        (?!
            # ! вещи, вещество
            (
                и
                |
                (
                    [еє]([ймх]|ств)
                    |ам[иъ]
                    |ь?ми
                )
            )
            # \b
        )
        ''',
     r'вѣщ'],
    # ---- вѣд вѣж вѣм вѣт вѣс вѣщ ----

    # ========================
    # вѣк- вѣц- вѣч-
    [r'\bвек(?=[аеиꙋъ](ми)?\b)', r'вѣк'],
    [r'\bвековъ', r'вѣкѡвъ'],
    [r'веце(хъ)?', r'вѣцѣ\1'],
    [r'веч(?=е?н)', r'вѣч'],
    # ------------------------

    [r'(?<![Пп]ер)([Вв])ен(?=е?[чц])', r'\1ѣн'],
    [r'(\b([Нн]е|[Ѿѿ]|[Вв]|[Ѕѕ]|[Бб]лаго)?[Вв])ер(?=[аеиноꙋыѧ])', r'\1ѣр'],
    [r'ветв', r'вѣтв'],
    [r'вет(е?р)', r'вѣт\1'],

    [r'\b((?:[Нн]ена)?[Вв])идені', r'\1идѣнї'],
    [r'\b([Вв])ин(?=[аеоꙋ]\b|оград)', r'\1їн'],
    [r'\bвиссон', r'вѵ́ссон'],
    [r'([Вв])ладими(?=р)', r'\1ладимї'],
    [r'вменѧ', r'вмѣнѧ'],
    [r'возде(?=(ва)?ти|еши|ющ)', r'воздѣ'],
    [r'([Вв])осп[еѣ]ва', r'\1оспѣва'],
    [r'врач[ьъ]', r'врачь'],
    [r'\b([Вв])се(?=(м[иъ]|хъ)\b)', r'\1сѣ'],
    [r'\b([Вв])сепе(?=т)', r'\1сепеѣ'],
    [r'втайне', r'втайнѣ'],

    # чаще Въ чем ВЪ
    [r'\bВЪ\b', r'Въ'],

    [r'([Гг])ефсиман', r'\1еѳсїман'],
    [r'(([Гг])еѳсімані)ѧ', r'\g<1>а'],
    [r'(([Гг])еѳсіманійст)ей', r'\g<1>ѣй'],
    [r'([Гг])олгоф', r'\1олгоѳ'],

    [r'([Гг])нев', r'\1нѣв'],
    [r'горет', r'горѣт'],

    [r'([Гг])ресех', r'\1рѣсѣх'],
    [r'([Гг])ре(?=[схш])', r'\1рѣ'],

    [r'''
        \b
        ([Пп]рисно)?
        ([Дд])ев
        (?=[аеоꙋы]|ств|ическ)
        ''',
     r'\1\2ѣв'],
    [r'\bдет(?!=инец)', r'дѣт'],
    [r'издетска', r'издѣтска'],
    [r'дел(?=[оаꙋ])', r'дѣл'],

    # дѣѧнїѧ ! ѳаддеѧ і҆ꙋдеѧ
    [r'(?<!дд|іꙋ)([Дд])еѧ', r'\1ѣѧ'],
    # дѣю ! надеждею і҆ꙋдею
    [r'(?<![аеꙋ]ж|іꙋ)([Дд])ею', r'\1ѣю'],

    [r'([Дд])иве(?=ев)', r'\1ивѣ'],
    [r'([Дд])ивно\b', r'\1ивнѡ'],
    [r'\bдне\b', r'днѣ'],
    [r'добродетел', r'добродѣтел'],
    [r'([Дд])околе', r'\1околѣ'],
    [r'([Дд])оселе', r'\1оселѣ'],
    [r'\b([Дд])ꙋсе\b', r'\1ꙋсѣ'],

    [r'(є)в(?=ангел)', r'\1ѵ'],
    [r'(є)в(?=фрафовъ)', r'\1ѵ'],
    [r'(є)вхарист', r'\1ѵхарїст'],
    [r'(є)го\b', r'\1гѡ'],  # Род: єгѡ Вин.: єго
    [r'(є)ги(?=пе?т)', r'\1гѵ'],  # Род: єгѡ Вин.: єго
    [r'(є)лисе(?=\w)', r'\1лиссе'],  # var: єлїссей

    [r'желез', r'желѣз'],

    [r'([Зз])авес', r'\1авѣс'],
    [r'Звезд', r'Ѕвѣзд'],
    [r'звезд', r'ѕвѣзд'],
    [r'звер(?!ж)', r'ѕвѣр'],
    [r'\b([Зз])де(?=(сь)?\b)', r'\1дѣ'],
    [r'\b([Гг])де\b', r'\1дѣ'],
    [r'зело', r'ѕѣлѡ'],

    [r'зельне', r'ѕѣльнѣ'],
    [r'зельн', r'ѕѣльн'],

    [r'зениц', r'зѣниц'],
    [r'(?<!же)зл(?=об)', r'ѕл'],
    [r'\bЗолъ\b', r'Ѕолъ'],
    [r'\bзолъ\b', r'ѕолъ'],
    [r'\b(?<!же)зл(?=[еѣіоꙋы]|а(?![зтцчщ]|га))', r'ѕл'],
    [r'зме(?=[йюѧ]\b|[еи]\w+)', r'ѕмѣ'],
    [r'(при)?зре(?=ти|ні|\b)', r'\1зрѣ'],

    [r'идеже', r'идѣже'],
    [r'И(?=зраил)', r'І'],
    [r'и(?=зраил)', r'і'],
    [r'изрѧдно', r'изрѧднѡ'],
    [r'\bикон', r'ікѡн'],
    [r'\bИкон', r'Ікѡн'],
    [r'икосъ', r'ікосъ'],
    [r'Икосъ', r'Ікосъ', 'i'],
    [r'\b([Ии])ме(?![нт])', r'\1мѣ'],
    [r'([Іі])о(?=ан|аким|в|на|сиф|ил|ота)', r'\1ѡ'],
    [r'([Іі])ордан', r'\1ѻрдан'],
    [r'Ирмос', r'Ірмос'],
    [r'ирмос', r'ірмос'],
    [r'иссоп', r'ѵссѡп'],
    [r'исцелен', r'исцѣлен'],

    [r'\b([Кк])ако\b', r'\1акѡ'],
    [r'([Кк])ано(?=н(?!ар))', r'\1анѡ'],
    [r'([Кк])оле(?=н)', r'\1олѣ'],
    [r'крепк', r'крѣпк'],
    [r'крѣпко', r'крѣпкѡ'],
    [r'([Кк])репост', r'\1рѣпост'],
    [r'([Кк])ꙋпел', r'\1ꙋпѣл'],

    # лепо боголепный великолѣ́пїе
    [r'''
        \b
        (
            (
                [Бб]
                (
                    (о|ла|л҃)г
                    |г҃
                )о
                |[Вв]елико 
            )?
            л
        )
        еп(?=н?[иіоы])
        ''',
        r'\1ѣп'],
    [r'\bлес(?=[аъ])', r'лѣс'],
    [r'\bлестви(?=[чц])', r'лѣстви'],
    [r'\bлето', r'лѣто'],
    [r'\b(не|ѻб|раз)?лен(?=ь|ив|ост|ѧщ|ен)', r'\1лѣн'],
    [r'\b([Лл])итꙋрг', r'\1їтꙋрг'],
    [r'\b([Лл])иті', r'\1їтї'],

    [r'\b(из|от)?мер(?=[аеыꙋ]\b|ил)', r'\1мѣр'],
    [r'мест(?=[аеѣоꙋ]\b)', r'мѣст'],
    [r'\b([Мм])е(?=сѧц)', r'\1ѣ'],
    # всемїрный надмїрный
    [r'\b(([Вв]се|[Нн]ад)м)и(?=рн)', r'\1ї'],
    [r'\b([Мм])и(?=хаил)', r'\1ї'],
    [r'\b([Мм])не\b', r'\1нѣ'],
    [r'\b((со)?[Мм])не(?=ти\b|ні)', r'\1нѣ'],
    [r'\b([Мм])оисе', r'\1ѡѷсе'],

    [r'надеѧ(?=ніе|тисѧ)', r'надѣѧ'],
    [r'надею(?=щі|с)', r'надѣю'],
    [r'намерен', r'намѣрен'],
    [r'([Нн])евест', r'\1евѣст'],
    [r'([Нн])егоже\b', r'\1егѡже'],

    # нѣгдѣ
    [r'\b([Нн])егде\b', r'\1ѣгдѣ'],

    [r'([Нн])едел', r'\1едѣл'],
    [r'недр', r'нѣдр'],
    [r'\b((?:[Вв]се)?[Нн])е(?=жн)', r'\1ѣ'],
    [r'([Нн])ѣжно', r'\1ѣжнѡ'],

    # нѣкто нѣкогда нѣкїй
    [r'\b([Нн])е(?=к(огда|то|ій)\b)', r'\1ѣ'],
    [r'\b([Нн])е(?=котор)', r'\1ѣ'],

    # нѣ́мы
    [r'\bне(?=м([аіоꙋы]\w|ы)\b)', r'нѣ'],
    [r'\bнераде(?=ні)', r'нерадѣ'],
    [r'\b([Нн])еси\b', r'\1ѣси'],
    [r'\b([Нн])есм(?=[ыь]\b)', r'\1ѣсм'],
    [r'\b([Нн])ест(?=[еь]\b)', r'\1ѣст'],
    [r'\b([Нн]епрестанн)о', r'\1ѡ'],
    # нїкола́й
    [r'([Нн])икол(?!иже)', r'\1їкол'],
    [r'([Нн])ыне', r'\1ынѣ'],

    # TODO:
    # ѻ в середине слова праѻтє́цъ
    [r'оо(?!рꙋж|тв|з)', r'оѻ'],

    [r'Ѻбаче', r'Ѡбаче'],
    [r'ѻбаче', r'ѡбаче'],
    [r'ѻбесити', r'ѡбѣсити'],
    [r'ѻбет', r'ѻбѣт'],
    [r'ѻбеща', r'ѻбѣща'],
    [r'ѻбле(?=[цч])', r'ѡбле'],
    [r'Ѻбнов', r'Ѡбнов'],
    [r'ѻбнов', r'ѡбнов'],
    [r'\bѺбож', r'Ѡбож'],
    [r'\bѻбож', r'ѡбож'],
    [r'Ѻбраз', r'Ѡбраз'],
    # [r'((?<!о)[ѻо])браз', r'ѡбраз'],
    # [r'(из)?[ѻо]браз', r'\1ѡбраз'],
    # [r'оѻбра([зжщ])', r'оѡбра\1'],
    [r'[ѻо]бра([зжщ])', r'ѡбра\1'],
    [r'ѻблекоша', r'ѡблекоша'],
    [r'ѻбре(?=[лст])', r'ѡбрѣ'],
    [r'ѻбрѧщ', r'ѡбрѧщ'],

    [r'ѻб(ы|ъи)м(?=[аеиꙋ])', r'ѡбъим'],
    [r'ѻб(ы|ъи)д(?=[еиоꙋ])', r'ѡбъид'],
    [r'ѻб(ы|ъи)ти', r'ѡбъити'],

    [r'ѻбъѧ(?=[вдлстхш])', r'ѡбъѧ'],
    [r'ѻбъем', r'ѡбъем'],
    [r'Ѻбъем', r'Ѡбъем'],

    [r'ѻде(?=ва[еюѧ]|ющ|ѧ)', r'ѡдѣ'],
    [r'ѻж(?=[ежир])', r'ѡж'],
    [r'Ѻзар(?=[еєиѧ])', r'Ѡзар'],
    [r'ѻзар(?=[еєиѧ])', r'ѡзар'],
    [r'ѻкропи', r'ѡкропи'],
    [r'Ѻкрест', r'Ѡкрест'],
    [r'ѻкрест', r'ѡкрест'],
    [r'Ѻмы(?=\w)', r'Ѡмы'],  # ѡ҆мы́й
    [r'ѻмы(?=\w)', r'ѡмы'],
    [r'ѻправд', r'ѡправд'],
    [r'Ѻсен', r'Ѡсѣн'],
    [r'ѻсен', r'ѡсѣн'],
    [r'Ѻстав', r'Ѡстав'],
    [r'ѻстав', r'ѡстав'],
    [r'ѻтчаѧн', r'ѿчаѧн'],
    [r'([Ѻѻ])тцевъ', r'\1тцєвъ'],
    [r'Ѻчи(?=сти|щ)', r'Ѡчи'],
    [r'ѻчи(?=сти|щ)', r'ѡчи'],

    [r'\b([Пп])е(ні|сн|ти|л)', r'\1ѣ\2'],

    [r'''  
        (
            [зн]а       # напѣвъ
            |ѿ          # ѿпѣванїе
            |[Пп]р[ио]     # припѣвъ
            |[Пп]салмо  
            |р[ао]с     # распѣвъ
            |с          # спѣлъ
        )
        пе([влт])       # пѣти
    ''', r'\1пѣв'],

    [r'([Пп])лач[ьъ]\b', r'\1лачь'],
    [r'\bплен', r'плѣн'],
    [r'побе(?=ж?д)', r'побѣ'],
    [r'([Пп])онедельник', r'\1онедѣльник'],
    [r'([Пп])осе(?=[тщ])', r'\1осѣ'],
    [r'([Пп])осле', r'\1ослѣ'],
    [r'пререкан', r'прерѣкан'],
    [r'прилеж(?=а|н)', r'прилѣж'],
    [r'присещ', r'присѣщ'],
    [r'([Пп])рисно\b', r'\1риснѡ'],
    [r'([Пп])роки(?=м)', r'\1рокї'],

    [r'Псал(?=о?м|т)', r'Ѱал'],
    [r'псал(?=о?м|т)', r'ѱал'],

    [r'([Рр])азве\b', r'\1азвѣ'],
    [r'реза', r'рѣза'],
    [r'([Рр]аз|[Ѿѿ])реш', r'\1рѣш'],
    # разумѣ-
    [r'разꙋме', r'разꙋмѣ'],
    # рѣчь
    [r'\bреч(?=[иь]|ам[иъ]\b)', r'рѣч'],
    # рѣка
    [r'\bрек(?=[аеѣиоꙋ])', r'рѣк'],
    [r'([Рр])осс', r'\1ѡсс'],

    [r'([Сс])аваоф', r'\1аваѡѳ'],
    [r'([Сс])ветле(?=[ей])', r'\1вѣтлѣ'],
    [r'([Сс])ве(?=[тщ])', r'\1вѣ'],
    [r'([Сс])вире(?=л)', r'\1вирѣ'],
    [r'([Сс])вѧтемъ', r'\1вѧтѣмъ'],
    [r'семо', r'сѣмо'],
    [r'\bсен(?=[иіь])', r'сѣн'],
    [r'\bсено', r'сѣно'],
    [r'([Сс])ерафи', r'\1ерафі'],
    [r'''
        \b
        сет
        (?=([иь]|ію)\b|ѧм)
    ''', r'сѣт'],
    [r'([Сс])лаве', r'\1славѣ'],
    [r'([Сс])лед', r'\1лѣд'],

    [r'''
        \bстен #
        (?!  # ! стенать
            а([нт][иіь]|ющ)
            |ѧ
        )
    ''', r'стѣн'],

    [r'\b([Сс])илꙋан', r'\1їлꙋан'],
    [r'\b([Сс])іон', r'\1їѡн'],
    [r'сиречь', r'сирѣчь'],

    [r'\b([Сс])корбе(?=ти|ні|л|вый)', r'\1корбѣ'],
    [r'\b([Сс])коро\b', r'\1корѡ'],

    [r'сне(?=[гж])', r'снѣ'],
    [r'совест', r'совѣст'],
    [r'([Сс])овет', r'\1овѣт'],
    [r'([Сс])огре', r'\1огрѣ'],
    [r'([Сс])офрон', r'\1офрѡн'],
    [r'([Сс])тихир', r'\1тїхир'],
    [r'([Сс])ыновъ', r'\1ынѡвъ'],

    [r'([Тт])ако\b', r'\1акѡ'],
    [r'тайнемъ', r'тайнѣмъ'],
    # [r'([Тт])ебе\b', r'\1ебѣ'],  # ? в Дат. Предложн
    [r'\b([Тт])ел(?=[аоꙋ]|е(с[аеин]|х)?)', r'\1ѣл'],
    [r'([Тт])емже', r'\1ѣмже'],
    [r'([Тт])епле', r'\1еплѣ'],
    [r'([Тт])ерпе', r'\1ерпѣ'],
    [r'\b([Тт])ехъ', r'\1ѣхъ'],
    [r'([Тт])ле(?=н[інъ]|т[иь])', r'\1лѣ'],
    [r'\bтьме\b', r'тьмѣ'],
    [r'\bтокмо\b', r'токмѡ'],

    # граница слова для ᲂу :
    # (\b - для `ᲂ' не работает)
    # (?<=\W)ᲂу
    # или (?<=(\W))?ᲂу - И для начала строки
    # или ^ᲂу - только для начала строки
    # (в *этом* модуле ᲂу всегда должен оказаться
    # в начале строки, т.к.
    # - обрабатывается отдельное слово
    # без предшествующих буквам символов)
    [r'^([Оᲂ]у)б[оѡ]\b', r'\1бѡ'],
    [r'^([Оᲂ]у)зре', r'\1зрѣ'],
    [r'^([Оᲂ]у)кре', r'\1крѣ'],
    [r'^([Оᲂ]у)те(?=[хш])', r'\1тѣ'],

    [r'\bФавор', r'Ѳавѡр'],
    [r'\bфавор', r'ѳавѡр'],
    [r'фарисе', r'фарїсе'],
    # Ѳѡма̀
    [r'\bФом(?=\w)', r'Ѳѡм'],
    [r'\bфом(?=\w)', r'ѳѡм'],


    [r'([Хх])леб', r'\1лѣб'],
    [r'([Хх])рист', r'\1рїст'],

    [r'царск[ао]го', r'царскагѡ'],
    [r'([Цц])ве(?=[лст])', r'\1вѣ'],
    [r'цел(?=[еєиюѧ]|ьб|омꙋ)', r'цѣл'],

    [r'([Чч])елове(?=[кч])', r'\1еловѣ'],
    [r'([Чч])естнейш', r'\1естнѣйш'],

    [r'([Ꙗꙗ])ве\b', r'\1вѣ'],
    [r'([Ꙗꙗ])ко\b', r'\1кѡ'],

    [r'', r'0'],
    [r'', r'1'],
    [r'', r'2'],
    [r'', r'3'],
    [r'', r'4'],
    [r'', r'5'],
    [r'', r'6'],
    [r'', r'7'],
    [r'', r'8'],
    [r'', r'9'],

    # months
    [r'ентѧбрѧ', r'ептемврїа'],
    [r'ктѧбрѧ', r'ктѡврїа'],
    [r'оѧбрѧ', r'оемврїа'],
    [r'екабрѧ', r'екемврїа'],
    [r'ꙗнварѧ', r'іаннꙋарїа'],
    [r'Ꙗнварѧ', r'Іаннꙋарїа'],
    [r'евралѧ', r'еврꙋарїа'],
    [r'([Мм])арта\b', r'\1арта'],
    [r'прелѧ', r'прілїа'],
    [r'\b([Мм])аѧ\b', r'\1аїа'],
    [r'([Іі])ю([лн])ѧ\b', r'\1ꙋ\2їа'],
    [r'([Аа])вгꙋста', r'\1ѵгꙋста'],
)
# Ударения
regs_acutes = (
    [r'\bа(?=біе\b)', GIS, 'i'],
    [r'\bа(?=вел)',   GIS, 'i'],
    [r'\bа(?=гне?[цч])',  GIS, 'i'],
    [r'\bа(?=д[аꙋѣеъ]\b)', GIS, 'i'],
    [r'\bада(?=м)', GO, 'i'],
    [r'\bа(?=зъ\b)',  GIS, 'i'],
    [r'ака(?=ѳіст)',  GO, 'i'],
    [r'\bа(?=ки\b)',  GIS, 'i'],
    [r'аллилꙋ(?=і[ѧа])',  GO, 'i'],
    [r'а(?=лчꙋ)', GIS, 'i'],
    [r'ами(?=нь)',        OX, 'i'],
    [r'\bа(?=може\b)',    GIS, 'i'],
    [r'а(?=нгел)',    GIS, 'i'],
    [r'анті(?=хр)',   GO, 'i'],
    [r'анат[оѡ]',   GO, 'i'],
    [r'апо(?=стол)',  GO, 'i'],
    [r'арха(?=нгел)', GO, 'i'],
    [r'архистрати',   GO, 'i'],
    [r'аѳана',        GO, 'i'],
    [r'аѳѡ(?=н)',     GO, 'i'],
    [r'\bа(?=ще\b)',  GIS, 'i'],

    # =========================
    # -бед-
    [r'\bбѣ(?=д([енс]\w|ъ)\b)',   GO, 'i'],
    [r'\b(бѣд([аеꙋ]\b|о(?=\w)))',   OX, 'i'],
    [r'\bбѣд[аꙋ]\b',              GV, 'i'],

    # =========================
    # -бег-, -беж-
    # отбеже
    [r'''  
        (
            (^ᲂу|\b(из|при|ѿ)?)
            бѣ
            [гж]
            [аеиꙋ]
        )\b
        ''',
        VA, 'i'],
    # избѣглъ избѣгнꙋти
    [r'((^ᲂу|\b(из|при|ѿ|на)?)бѣ)(?=г(л?ъ|н))', OX, 'i'],

    [r'\bбѣ(?=гати\b)', GO, 'i'],
    [r'((^ᲂу|\b(из|при|ѿ)?)бѣжа)(?=ти\b)', OX, 'i'],

    # избѣга́ти избѣго́х
    [r'((^ᲂу|\b(из|при|ѿ))бѣг[оа])(?=\w+)', OX, 'i'],
    # ---- -бег-, -беж- ---------------

    [r'безмѣ(?=(р|cт)н)', GO, 'i'],
    [r'безбо(?=ж)',   GO, 'i'],
    [r'безгла(?=с)',  GO, 'i'],
    [r'беззако(?=н)', GO, 'i'],
    [r'безмо(?=л)',   GO, 'i'],
    [r'безпло(?=т)',  GO, 'i'],
    [r'безꙋ(?=м)',    GO, 'i'],
    [r'безчи(?=с)',   GO, 'i'],

    [r''' # бѣлый
        \b(бѣ) 
        (?=л[аꙋы]\w)
        ''',
        OX, 'i'],
    [r'\bбѣ(?=ло(м[ꙋъ]|[ею]))', GO, 'i'],
    [r'\bбѣло\b', GV, 'i'],
    [r'\bбѣлоза', GO, 'i'],
    [r'\bбѣлока', GO, 'i'],
    [r'\bбѣлопе', GO, 'i'],
    [r'\bбѣлори', GO, 'i'],
    [r'\bбѣлостѣ', GO, 'i'],

    [r'''  # убеленный 
        (
            (\b|^ᲂу)
            бѣл
            (?![аоꙋы]\w) # ! бѣлый
            [еиоѧ]
        )''',
        OX, 'i'],
    # ---- -бел- -----------------

    [r'\bбѣ(?=с[аиꙋыъ]\b)', GO, 'i'],
    [r'\bбѣ(?=сомъ\b)',     GO, 'i'],
    [r'\bбѣсо(?=вск)',      GO, 'i'],
    [r'\bбѣ\b',             GV, 'i'],

    # бесте беша бехом
    [r''' 
        \b
        бѣ
        (?=
            сте
            |х(?=(ом)?ъ)
            |ша
        )   
        ''',
        GO, 'i'],

    [r'\bбде\b',          GV, 'i'],
    [r'\bбде(?=[нт])',    GO, 'i'],
    [r'\bби(?=сер)',      GO, 'i'],

    # =========================
    # -благ- -блаж -
    [r'бла(?=г[ѣиоѡꙋъ]\b)',   GO, 'i'],
    [r'блага\B',              GO, 'i'],
    [r'благі(?=[йеѧ])',       GO, 'i'],
    [r'благи(?=[мх][иъ]\b)',  GO, 'i'],

    [r'благовѣ(?=щені[аеюѧ]\b)', GO, 'i'],
    [r'благовѣ(?=ст[ін])', GO, 'i'],  # @@@ ѣ
    [r'благовѣсти\b',     GV, 'i'],  # @@@ ѣ
    [r'благовѣсти\B',     GO, 'i'],  # @@@ ѣ
    [r'благовѣствꙋ',      GO, 'i'],  # @@@ ѣ
    [r'благовѣствова\B',  GO, 'i'],  # @@@ ѣ
    [r'благовѣствова\b',  GV, 'i'],  # @@@ ѣ

    [r'благоговѣ(?=й?н)', GO, 'i'],

    [r'благово(?=н)',     GO, 'i'],
    [r'благоволе(?=н)',   GO, 'i'],
    [r'благоволи\b',      GV, 'i'],
    [r'благоволи\B',      GO, 'i'],
    [r'благоволѧ\B',      GO, 'i'],

    [r'благодар[ѧю]\b', GV, 'i'],
    # благодарим
    [r'благодар[иеѧ](?=\w+)', GO, 'i'],
    # благодарно, благодать
    [r'благода(?=[рт](?![иеѧ]\w+|ѧ\b))', GO, 'i'],
    [r'благодѣ(?!ѧні\B)',     GO, 'i'],
    [r'благодѣѧ(?=ні\B)',     GO, 'i'],
    [r'благо(?=[йе]|м[ꙋъ])',  GO, 'i'],
    [r'благоѡбра(?=з)',       GO, 'i'],
    [r'благоро(?=д)',         GO, 'i'],
    [r'благосе(?=рд)',        GO, 'i'],
    # благослове́нїе
    [r'благослове(?=н)', GO, 'i'],
    # благослови
    [r'благослов([иѧ]|лю)\b', GV, 'i'],
    [r'благослов([иѧ]|лѧ)\B', GO, 'i'],

    [r'благоꙋтро',        GO, 'i'],
    [r'благоꙋха',         GO, 'i'],
    [r'благочести(?=в)',  GO, 'i'],
    [r'благоче(?=сті)',   GO, 'i'],
    [r'бла(?=гꙋ\b)',      GO, 'i'],
    [r'благꙋ(?=ю)',       GO, 'i'],

    # -блаж-
    [r'\bбла(?=же\b)', GO, 'i'],
    # ᲂу҆блажа́емъ блаже́нный # ! блаже
    [r'блаж(?!е\b)[аеи]', GO, 'i'],
    # --------------------------

    [r'блꙋ(?=д([шъ]|имъ|н(?!и[кц])))', GO, 'i'],
    [r'блꙋди\b',        GV, 'i'],
    [r'блꙋди\B(?!мъ)',  GO, 'i'],
    [r'блꙋдни(?=[цч])', GO, 'i'],
    [r'блꙋдник[аи]\b',  GV, 'i'],
    [r'блꙋжд[аеє]',     GO, 'i'],


    # =========================
    # -бог- -бож- -боз-
    [r''' # бо́гъ бо́гꙋ бо́гомъ  
        
        (^ᲂу|\b) # ᲂу҆бо́гїй вынести отдельно
        бо
        (?=г
            (
                [аеиꙋъ]
                |ій  # вынести отдельно
                |о(мъ|ви)
            )\b
        )
        ''', GO, 'i'],
    [r'''  # бога́тый бога́тно
        бога
        (?=т(
            ъ
            |[аіоꙋы]\w\b # бога́тый
            |[оы]м\w?   # бога́томꙋ бога́тымъ 
            |н([аеоѡꙋы]) # бога́тно
            |ств
            )
        )
        ''', GO, 'i'],
    # бо́же бо́жїй
    [r''' 
        \b
        бо
        (?=
            ж
            (е|і[аеийюѧ])\b
        )
        ''', GO, 'i'],

    [r'боже(?=ственн)',     GO, 'i'],
    [r'\bбожеств[аѣоꙋ]\b',  GV, 'i'],
    # бо́зе бо́зи
    [r'\bбо(?=з[еѣи]\b)', GO, 'i'],
    # ---- -бог- -бож- -боз- -------

    [r'боговѣ(?=дѣн)',        GO, 'i'],
    [r'богодꙋхнове(?=нн)',    GO, 'i'],
    [r'богоно(?=с)',          GO, 'i'],
    [r'богоразꙋ',             GO, 'i'],
    [r'богоро(?=ди[чц])',     GO, 'i'],
    [r'богороди(?=тельниц)',  GO, 'i'],
    [r'богосло',              GO, 'i'],
    [r'болѣ(?=зн)',           GO, 'i'],

    # бо́ль бо́ли споболѝ боли́тъ бо́лїю
    [r'\bбо(?=л([иь]|ію)\b)', GO, 'i'],
    [r'\Bболи\b',     GV, 'i'],
    [r'боли\B',       GO, 'i'],
    [r'болѧ(?=[йщ])', GO, 'i'],

    # бо́льше бо́льшимъ
    [r'бо(?=льш[еиꙋ])', GO, 'i'],


    [r'бра(?=т[еѣінсꙋъ])', GO, 'i'],

    # бꙋ́дꙋ
    [r'(?<!оз|по)бꙋ(?=д(е[тм]ъ|[иꙋ]))', GO, 'i'],
    # [r'(?<!по)бꙋ(?=ди)', r'бꙋ' + Oxia, 'i'],

    [r'бы(?=(л[иоъ]|ти|сть|ша)\b)', GO, 'i'],
    [r'была\b',           GV, 'i'],
    # быва́етъ бы́вшїй
    [r'бы(?=в[сшъы])',    GO, 'i'],
    [r'быва',             GO, 'i'],
    # бытїѐ бытїе́мъ
    [r'\b((?:не|паки)?быті[еиюѧ])\b',   VA, 'i'],
    [r'\b((не|паки)?бытіе)(?=мъ\b)',    OX, 'i'],
    [r'(?<!одо)бѧ(?=ш)',      GO, 'i'],
    [r'(?<!орб)бѧ(?=хꙋ\b)',   GO, 'i'],

    # бꙋ́рѧ бꙋ́рный
    [r'(?<!ѻ)бꙋ(?=р)', GO, 'i'],

    [r'вавило(?=н)',  GO, 'i'],
    [r'валаа(?=м)',   GO, 'i'],

    [r'\bва(?=м[ъи]\b)',  GO, 'i'],
    [r'\bва(?=съ\b)',     GO, 'i'],
    [r'\bва(?=ш)',        GO, 'i'],

    [r'\bвдохнове(?=н)',  GO, 'i'],
    [r'\bвдохнови\b',     GV, 'i'],
    [r'\bвдохнови\B',     GO, 'i'],
    [r'\bвдохновлѧ',      GO, 'i'],
    [r'\bвдохновѧ',       GO, 'i'],


    # ========================
    #   вѣд вѣж вѣм вѣт вѣс вѣщ
    #   -вѣд-
    [r'''
        \b
        (
            (не)?(из)?
            |испо
            |(?<!за)по
        )?
        вѣ
        (?=д(
            а [елнтхюѧ]?
            |[еѣ] [нтхш]
            |и [хш]
            |о [м]
            |ꙋ [еюѧ]
            |ы й
            |ѧ т
            |н 
        ))
        ''',
        GO, 'i'],

    #   -вѣж-
    [r'\b(не)?вѣ(?=ж)', GO, 'i'],

    #   -вѣм-
    [r'''    
        \b
        ((ис)?по)?
        вѣ
        (?=м[ыъ])
        ''',
        GO, 'i'],

    #   -вѣс-
    [r'\b(не)?вѣ(?=с(и\b|т))', GO, 'i'],
    # со́вѣсть
    [r'\bсо(?=вѣст)', GO, 'i'],

    #   -вѣт- (! цвѣ́тъ свѣт вѣтіи, вѣтвѧми)
    [r'(?<![сц])вѣ(?=т(?!і[иѧ]|вѧм))', GO, 'i'],
    # вѣтіи
    [r'\bвѣті(?=[иѧ])', GO, 'i'],

    #   -вѣщ-
    [r'вѣ(?=щій\b)',      GO, 'i'],
    [r'вѣща',             GO, 'i'],
    [r'вѣ(?=щенск)',      GO, 'i'],
    [r'веще(?=ственн)',   GO, 'i'],
    [r'вѣщꙋ\b',           GV, 'i'],
    # [r'(вѣще)(?=н(ск|і[еюѧ]|наѧ))', OX, 'i'],

    # ---- вѣд вѣж вѣм вѣт вѣс вѣщ ----

    # ========================
    # век- вец- веч-
    [r'\bвѣ(?=к(?![оѡ]в|ам))', GO, 'i'],
    [r'''
        \b
        вѣк[аоѡ]
        (?=[мвх][иъ])
        ''', GO, 'i'],

    [r'вѣ(?=цѣ(хъ)?)',  GO, 'i'],
    [r'вѣ(?=че?н)',     GO, 'i'],
    # ---- век- вец- веч- ----------

    # ве́лїй
    [r'(пре)?ве(?=лі(?!ар))', GO, 'i'],
    [r'вели(?=к(?!о(мꙋч|л[ѣе]п)))', GO, 'i'],
    [r'вели(?=ц)',        GO, 'i'],
    [r'великолѣ(?=п)',    GO, 'i'],
    [r'велича\B',         GO, 'i'],
    [r'вели(?=ч[иі])',    GO, 'i'],

    [r'велегла', GO, 'i'],

    # ========================
    #   венц- венч-
    [r'\bвѣне(?=цъ\b)',   GO, 'i'],
    [r'\bвѣнц[аеѣꙋы]\b',  GV, 'i'],

    # вѣнца́ми
    [r''' 
        \b
        вѣнц
        (?!
            [аеѣꙋы]\b   # ! вѣнцꙋ̀
            |ецъ\b      # ! вѣне́цъ   
        )
        [аеєоѡ]
        (?=\w+)
        ''', GO, 'i'],

    # вѣнча̀
    [r'(^ᲂу|\b([ѻѡ]б)?)вѣнча\b', GV, 'i'],

    # вѣ́нче вѣ́нчанъ
    [r'''    
        (^ᲂу|\b(раз|[ѻѡ]б)?)
        вѣ
        (?=нч(е|анъ)\b)
        ''', GO, 'i'],
    # вѣнча́еши
    [r'''
        (
            ^ᲂу
            |\b(?:[ѻѡ]б)?
        )
        вѣнч
        (?!  # ! вѣнча̀ вѣ́нче вѣ́нчанъ
            ([ае]|анъ)\b 
        )
        а   # ударн.
        ''', GO, 'i'],
    # ----  венц- венч- --------------

    [r'вѣ(?=р[аеиноꙋыѧ])', GO, 'i'],
    [r'ве(?=сь\b)',   GO, 'i'],
    [r'весе(?=лі)',   GO, 'i'],
    [r'весьма\b',     GVA, 'i'],
    [r'вѣтвѧ(?=м)',   GOX, 'i'],

    [r'взира',    GO, 'i'],
    [r'взыва',    GO, 'i'],
    [r'взыгра',   GO, 'i'],
    [r'взыска\b', GV, 'i'],
    [r'взыска\B', GOX, 'i'],

    # ви́ждь
    [r'ви(?=жд)',     GOX, 'i'],
    [r'ви(?=дѧ)',     GOX, 'i'],
    [r'ви(?=жꙋ\b)',   GOX, 'i'],

    [r'\b(?:нена)?видѣ(?=ні)', GOX, 'i'],

    [r'він[аеоꙋ]\b',      GVA, 'i'],
    [r'віногра',          GOX, 'i'],

    [r'влади(?=мір)',     GOX, 'i'],
    [r'влады(?=[кчц])',   GOX, 'i'],

    [r'вложи\b', GVA, 'i'],
    [r'вложи\B', GOX, 'i'],

    [r'\bвмѣнѧ',    GOX, 'i'],
    [r'\bвмѣни\B',  GOX, 'i'],
    [r'\bвмѣни\b',  GVA, 'i'],

    [r'внегда\b', GVA, 'i'],

    [r'внꙋ(?=тр(?!и\b|ь[ꙋю]д))', GOX, 'i'],
    [r'внꙋтри\b', GVA, 'i'],

    [r'\bвод[аеѣо]\b',    GVA, 'i'],
    [r'\bвода\B',         GOX, 'i'],
    [r'\bводо(?=[йю])',   GOX, 'i'],
    [r'\bво(?=д[ꙋъ])',    GOX, 'i'],

    [r'\bводвор[еиюѧ]\B', GOX, 'i'],
    [r'\bводвор[ию]\b',   GVA, 'i'],

    [r'воздѣва',              GOX, 'i'],
    [r'воздѣ(?=ти|еши|ющ)',   GOX, 'i'],

    [r'возвед[еиꙋ]\b',    GVA, 'i'],
    [r'возврати\b',       GVA, 'i'],
    [r'возврати\B',       GOX, 'i'],

    [r'возда[юѧ]\b',          GVA, 'i'],
    [r'возда[юѧ]\B',          GOX, 'i'],
    [r'возда(?=[мнстхш])\B',  GOX, 'i'],
    [r'возда(?=в(?!а))',      GOX, 'i'],
    [r'воздава',              GOX, 'i'],
    [r'возда(?=й)',           GOX, 'i'],
    [r'возда(?=л(?!а\b))',    GOX, 'i'],
    [r'воздала\b',            GVA, 'i'],

    [r'воздвиг[ао]',  GOX, 'i'],
    [r'воздви(?=ж|г(?![ао]))', GOX, 'i'],
    [r'воздвиза',     GOX, 'i'],
    [r'воздыха',      GOX, 'i'],

    [r'возло(?=жен)', GOX, 'i'],

    [r'возлюблю\b',               GVA, 'i'],
    [r'возлю(?=бл([еє]н|ь))',     GOX, 'i'],
    [r'возлюби\b',                GVA, 'i'],
    [r'возлюби(?=[влсх]|ти|ша)',  GOX, 'i'],
    [r'возлю(?=би(мъ|ши))',       GOX, 'i'],

    [r'возмо(?=ж)', GOX, 'i'],

    # возопѝ возопи́ша
    [r'возопи\b', GVA, 'i'],
    [r'возопи\B', GOX, 'i'],

    [r'возра(?=д)', GOX, 'i'],

    # возсїѧ̀
    [r'возсіѧ\b', GVA, 'i'],
    # возсїѧ́й
    [r'возсіѧ(?!\b|ва)', GOX, 'i'],
    [r'возсіѧва', GOX, 'i'],

    [r'\bво(?=и\b)', GOX, 'i'],
    [r'\bво(?=ин(?!(ств)?(онач|ослов)))', GOX, 'i'],

    [r'вои(?=стин)', GOX, 'i'],

    [r'вонми\b',      GVA, 'i'],
    [r'во(?=нмемъ)',  GOX, 'i'],

    [r'вон[юѧ]\b', GVA, 'i'],

    [r'вопі[еєюѧ]', GOX, 'i'],
    [r'вопі[юѧ]\b', GVA, 'i'],

    [r'воспѣва\B',       GOX, 'i'],
    [r'воспою\b',         GVA, 'i'],
    [r'воспо[еи](?=м)',   GOX, 'i'],
    [r'восходѧ\b',        GVA, 'i'],
    [r'восходѧ\B',        GOX, 'i'],
    [r'восхожде\B',       GOX, 'i'],
    [r'восхожда\B',       GOX, 'i'],

    # вра́гъ вра́жїй вражд-
    [r'''
        \b
        вра
        (?=
            гъ
            |ж(?!д) # ! вражда
        )
        ''', GOX, 'i'],
    [r'\bвра[гз][аеѣиꙋ]\b', GV, 'i'],
    [r'\bвразе(?=х)',     GOX, 'i'],
    [r'\bврага(?=[мх])',  GOX, 'i'],
    [r'\bвраго(?=[вм])',  GOX, 'i'],
    [r'\bвражд[аеꙋы]\b',  GVA, 'i'],
    [r'\bвражд[еоꙋ]\B',   GOX, 'i'],

    [r'врата\b',      GVA, 'i'],
    [r'враты\b',      GVA, 'i'],
    [r'врата(?=[мх])', GOX, 'i'],
    [r'вратѣ(?=х)',   GOX, 'i'],
    [r'вра(?=тъ)',    GOX, 'i'],

    [r'вра(?=чь)',    GOX, 'i'],
    [r'врачꙋ\b',      GVA, 'i'],

    [r'вре(?=м(?!ен[аъы]))', GOX, 'i'],
    [r'времена\b', GVA, 'i'],

    [r'всегда\b', GVA, 'i'],
    [r'всего\b',  GVA, 'i'],

    [r'всѣ(?=м[иъ]|хъ)',          GOX, 'i'],
    [r'вс[еѣ](?=ю\b)',            GOX, 'i'],
    [r'\bвселе(?=н(с[кт]|н))',    GOX, 'i'],

    [r'\bвсели\B', GOX, 'i'],
    [r'\bвсели\b', GVA, 'i'],

    [r'\b(все|над)мі(?=рн)', GOX, 'i'],
    [r'\bвсепѣ(?=т)', GOX, 'i'],

    [r'всемꙋ\b',          GVA, 'i'],
    [r'всеѧ\b',           GVA, 'i'],
    [r'\bвс[еию]\b',      GVA, 'i'],
    [r'\bвско(?=ре)',     GOX, 'i'],
    [r'\bвсѧ\b',          GKA, 'i'],
    [r'\bвсѧ(?=[кцч])',   GOX, 'i'],

    [r'вта(?=йне)', GOX, 'i'],

    [r'вы(?=нꙋ\b)',   GOX, 'i'],
    [r'\bвы\b',       GVA, 'i'],
    [r'вы(?=шн)',     GOX, 'i'],
    [r'вы(?=[сш]ш)',  GOX, 'i'],

    [r'\bгавріи(?=л)', GOX, 'i'],
    # гдѣ̀
    [r'\b(гдѣ)\b', VA, 'i'],
    [r'(ге)(?=рман(?![іс]))', OX, 'i'],
    # геѳсїма́нїа
    [r'(геѳсіма)(?!нійс)', OX, 'i'],
    # геѳсїмані́йстѣй
    [r'(геѳсімані)(?=йс)', OX, 'i'],

    # Глаго́лъ
    [r'\b(глаго)(?=л)', OX, 'i'],
    [r'\b(гла)(?=д)',   OX, 'i'],
    # гла́съ
    [r'\b(гла)(?=с[аноеꙋыъ])', OX, 'i'],
    # глаша́ти ѻ҆глаше́нный
    [r'(глаш[ае])', OX, 'i'],
    # ѻ҆гласѝ
    [r'((воз|[ѻѡ])гласи)\b',    VA, 'i'],
    [r'\b(глꙋбин[аеоꙋѣы])\b',   VA, 'i'],
    [r'\b(глꙋбино)(?=ю)',       OX, 'i'],
    [r'\b(глꙋбоча)(?=йш)',      OX, 'i'],

    [r'(гнѣ)(?=в)', OX, 'i'],
    # годи́на
    [r'\b(годи)(?=н[аеѣоꙋы])', OX, 'i'],
    [r'\b(голго)(?=ѳ)', OX, 'i'],
    [r'\b(гоне)(?=ні)', OX, 'i'],
    [r'\b(гора)(?=хъ)', OX, 'i'],
    [r'(горѣ)(?=т)',    OX, 'i'],
    [r'\b(горѣ)\b',     VA, 'i'],
    # го́ре
    [r'\b(го)(?=ре\b)',         OX, 'i'],
    [r'\b(го)(?=рьк(?!а\b))',   OX, 'i'],
    [r'\b(горѧ)(?=щ)',          OX, 'i'],

    # Го́споди
    [r'(го)(?=спод([аеиꙋ]|омъ)\b)', OX, 'i'],
    # Госпо́дне
    [r'(госпо)(?=д([нь]|ств))', OX, 'i'],
    # Госпожа̀
    [r'(госпож[аеиѣꙋ])\b', VA, 'i'],

    [r'\b(гра)(?=д[аеиѣꙋъ]\b)', OX, 'i'],

    # ==============================
    # грѣ́хъ грѣ́шникъ грѣ́шенъ грѣшны̀ согрѣшѝ прегрѣше́нїѧ грѣсѝ грѣсѣ́хъ

    # грѣх (ѣ - ударн.)
    [r'''
        \b
        (грѣ)
        (?=
            хъ
            |шенъ
            |шн(?!\w\b)) # ! гръшны
        ''',
        OX, 'i'],

    [r'((?:со)?грѣш([иꙋ]|н[аоѡы]))\b', VA, 'i'],
    [r'(грѣси)\b',          VA, 'i'],
    [r'(грѣх[аеѣиꙋ])\b',    VA, 'i'],
    [r'(грѣхми)\b',         VA, 'i'],
    [r'(грѣха)(?=[мх])',    OX, 'i'],

    [r'(грѣх[оѡ])(?!лю|па)',    OX, 'i'],
    [r'(грѣхолюби)',            OX, 'i'],
    [r'(грѣхолю)(?=бн)',        OX, 'i'],
    [r'(грѣхопад[еє])',         OX, 'i'],
    [r'(грѣсѣ)(?=хъ\b)',        OX, 'i'],
    # прегрѣше́нїѧ
    [r'''
        (
            грѣш
            (
                [аи]
                |е(?!нъ) # ! грѣ́шенъ
            )
        )\B
        ''',
        OX, 'i'],
    # -------------------------------

    [r'(грѧд[еиꙋыѧ])\B',    OX, 'i'],
    [r'(грѧд[иꙋ])\b',       VA, 'i'],

    [r'(да)(?=бы|же)',  OX, 'i'],
    [r'(даде)\b',       VA, 'i'],
    [r'(даде)\B',       OX, 'i'],
    [r'(да)(?=ждь)',    OX, 'i'],
    [r'\b(да)(?=й|лъ)', OX, 'i'],
    [r'\b(да)(?=лсѧ)',  OX, 'i'],

    [r'\b(да)(?=р([аеѣꙋъ]\b|ꙋ\B))', OX, 'i'],
    [r'\b(дары)\b',     VA, 'i'],
    [r'\b(дарова)\B',   OX, 'i'],
    [r'\b(дарова)\b',   VA, 'i'],
    [r'\b(два)(?=жд)',  OX, 'i'],
    [r'\b(две)(?=ри)',  OX, 'i'],

    # дѣ́ва
    [r'''
        \b
        (
            ([Пп]рисно)?
            дѣ
        )
        (?=в(?!омати))
        ''',
        OX, 'i'],

    [r'\b(де)(?=нь)',   OX, 'i'],
    [r'(дне)(?=сь)',    OX, 'i'],
    [r'(дні)(?=й)',     OX, 'i'],
    [r'\b(днѣ)\b',      VA, 'i'],
    [r'\b(дни)\b',      VA, 'i'],

    [r'(держа)\b',  VA, 'i'],
    [r'(держа)\B',  OX, 'i'],

    [r'(дерзнове)', OX, 'i'],

    [r'\b(дѣ)(?!то[вр]од|т[еєѣ]й)(?=т)', OX, 'i'],
    [r'\b(дѣте)(?=й)',      OX, 'i'],
    [r'\b(дѣто[вр]од[иѧ])', OX, 'i'],
    [r'(издѣ)(?=тска)',     OX, 'i'],

    # дѣ́ло
    [r'\b(дѣ)(?=л[оаꙋ]\b)', OX, 'i'],
    # дѣ́ѧша
    [r'\b(дѣ)(?=ѧ[твхш])',  OX, 'i'],
    # дѣѧ́нїѧ
    [r'\b(дѣѧ)(?=н)',   OX, 'i'],
    # дѣ́юще
    [r'\b(дѣ)(?=ю)',    OX, 'i'],

    [r'\b(дивѣ)(?=е)',  OX, 'i'],
    # дивный
    [r'((пре|неиж|много(иж)?|досто|все)?ди)(?=вн)', OX, 'i'],

    [r'\b(дими)(?=трі(?!ан))',  OX, 'i'],
    [r'\b(димитріа)(?=н)',      OX, 'i'],

    # длѧ
    [r'\b(длѧ)\b', VA, 'i'],

    [r'(добро)\b', VA, 'i'],
    [r'(до)(?=бр(ы[ймх]|ꙋю|о[емюй]))', OX, 'i'],
    [r'(добродѣ)(?=тел)', OX, 'i'],

    # доколе
    [r'(доко)(?=лѣ)',   OX, 'i'],
    [r'(долготꙋ)\b',    VA, 'i'],
    # до́мъ до́мы
    [r'(до)(?=м[еѣиꙋъы]\b)', OX, 'i'],
    # дондеже
    [r'(до)(?=ндеже)',  OX, 'i'],
    [r'(досе)(?=лѣ)',   OX, 'i'],
    # досто́йно ! достойнопѣ́тый
    [r'(досто)(?=йн(?!о(б|пѣ|сло)))', OX, 'i'],
    [r'(достоѧ)(?=н)',  OX, 'i'],
    [r'(доше)(?=д)',    OX, 'i'],

    [r'(дре)(?=вле)',   OX, 'i'],
    [r'(дре)(?=вн)',    OX, 'i'],
    [r'(дре)(?=ва\b)',  OX, 'i'],  # @@@ чаще дре́ва
    [r'(дре)(?=в([ꙋеѣъ]|о(мъ)?)\b)', OX, 'i'],

    [r'(дрꙋ)(?=г([аиеѣꙋъ]|омъ)\b)', OX, 'i'],
    [r'(дрꙋ)(?=ж(е|ба)\b)', OX, 'i'],
    [r'(дрꙋ)(?=зи\b)',      OX, 'i'],

    # дꙋ́сѣ - предл.п. дꙋ́ше - зват.п
    [r'\b(дꙋ)(?=сѣ\b)',     OX, 'i'],
    [r'\b(дꙋ)(?=си\b)',     OX, 'i'],
    [r'\b(дꙋхо)(?=вн(?!и[кч]))',    OX, 'i'],
    [r'\b(дꙋховни)(?=к(?!а))',      OX, 'i'],
    [r'\b(дꙋховника)\B',    OX, 'i'],
    [r'\b(дꙋховника)\b',    VA, 'i'],
    [r'\b(дꙋхоно)(?=сиц)',  OX, 'i'],
    # дꙋша̀
    # TODO: ?
    #   дꙋша̀: дꙋшѣ̀ - предл. дꙋшѐ - зват.
    #   дꙋ́хъ: дꙋ́сѣ - предл. дꙋ́ше - зват.
    #
    [r'(дꙋш[аѣ])\b', VA, 'i'],
    # дꙋше́внꙋю
    [r'(дꙋше)(?=вн|ю)', OX, 'i'],
    # дꙋ́шꙋ
    [r'(дꙋ)(?=ш[ꙋъ]\b)',    OX, 'i'],
    [r'(дꙋша)(?=мъ\b)',     OX, 'i'],

    [r'(дще)(?=р)', OX, 'i'],
    [r'(дщи)\b',    VA, 'i'],

    [r'(дыха)(?=н)', OX, 'i'],

    # TODO: є҆̀ ю҆̀ ꙗ҆̀
    # не меняет Iso на Apostrof
    [r'\b([єюꙗ])\b', r'\1' + Apostrof, 'i'],

    [r'(єѵа)(?=нгел)',  OX, 'i'],
    [r'(єгѵ)(?=пет)',   OX, 'i'],

    [r'(євфра)(?=фовъ)',    OX, 'i'],
    [r'(єѵхарі)(?=сті)',    OX, 'i'],
    [r'(єѵхарісти)(?=ч)',   OX, 'i'],
    # є҆гда̀ є҆да̀
    [r'(єг?да)\b',  VA, 'i'],
    # є҆гѡ̀ є҆го̀
    [r'(єг[оѡ])\b', VA, 'i'],
    # є҆го́же
    [r'(єго)(?=же\b)', OX, 'i'],
    # є҆ди́на є҆ди́наго є҆ди́ны ! є҆динагона́десѧте
    [r'(єди)(?=н[аеєѣꙋыъ](?!г[оѡ]н|к[оѡ]|че|ні|й?же?над))', OX, 'i'],
    [r'(єди)(?=но([ейю]|м[ꙋъ]|ж(ды|е))?\b)', OX, 'i'],
    [r'(єди)(?=нств)', OX, 'i'],
    # є҆́же є҆́й є҆́сть є҆́смь є҆́юже
    [r'(є)(?=же|й|с[тм]ь|юже\b)', r'\1' + Iso, 'i'],
    # є҆ктенїѝ
    [r'(єктені\w)\b', VA, 'i'],
    [r'(єле)(?=а\b|е(?!п)|ом|[ийѧю])', OX, 'i'],
    # є҆ли́ко є҆ли́цы є҆ли́жды
    [r'(єли)(?=жды|ко|цы)', OX, 'i'],
    [r'(єлисаве)(?=т)',     OX, 'i'],
    # є҆мꙋ̀ є҆сѝ є҆щѐ є҆стѐ
    [r'\b(ємꙋ)\b',      VA, 'i'],
    [r'\b(ємꙋ)(?=же)',  OX, 'i'],
    [r'\b(єс(и|те))\b', VA, 'i'],
    [r'\b(єсмы)\b',     VA, 'i'],
    [r'\b(єстеств[аеѣоꙋ])\b', VA, 'i'],
    [r'\b(єще)\b',      VA, 'i'],
    [r'\b(єѧ)\b',       VA, 'i'],
    [r'\b(єѧ)(?=же)',   OX, 'i'],

    # [r'(жа)(?=жда\b)', OX, 'i'],
    # жа́жды жа́ждꙋщїй
    [r'(жа)(?=жд[еꙋиоы])', OX, 'i'],
    # жела́нїе
    [r'(жела)(?=ні)',   OX, 'i'],
    # желѣ́зо
    [r'(желѣ)(?=з)',    OX, 'i'],
    # же́но
    [r'\b(же)(?=но\b)', OX, 'i'],
    [r'\b(жена)(?=х)',  OX, 'i'],
    [r'\b(же)(?=нъ)',   OX, 'i'],
    # жена̀ женѐ
    [r'\b(жен[аеѣꙋы])\b', VA, 'i'],
    # же́ртва
    [r'(же)(?=ртв(?!оположн))', OX, 'i'],
    # живꙋ́щїй
    [r'(живꙋ)(?=щ\w+)', OX, 'i'],
    [r'(жива)(?=го)',   OX, 'i'],
    [r'(жива)(?=ѧ)',    OX, 'i'],
    # жива̀
    [r'(жив[аꙋ])\b',    VA, 'i'],

    [r'(живоно)(?=с)',      OX, 'i'],
    [r'(живо)(?=тъ\b)',     OX, 'i'],
    [r'(живот[аеѣыꙋ])\b',   VA, 'i'],
    [r'(живото)(?=мъ\b)',   OX, 'i'],
    [r'(животворѧ)\b',      VA, 'i'],
    [r'(животворѧ)\B',      OX, 'i'],
    [r'(живото)(?=ч)',      OX, 'i'],

    # живы́ѧ
    [r'(?<!бли)(живы)\B', OX, 'i'],
    # жи́вы
    [r'\b(жи)(?=вы\b)', OX, 'i'],

    [r'(присноживо)(?=т)', OX, 'i'],
    # жи́знь жи́зненный
    [r'(жи)(?=зн([иь]|енн))', OX, 'i'],
    [r'(жите)(?=йс)',   OX, 'i'],
    [r'(житі[еиюѧ])\b', VA, 'i'],
    [r'(житіе)(?=мъ)',  OX, 'i'],

    [r'\b(заблꙋ)(?=ж?дш)',  OX, 'i'],
    [r'\b(забꙋ)(?=д)',      OX, 'i'],
    [r'\b(забыва)\B',       OX, 'i'],
    # завѣ́са
    [r'\b(завѣ)(?=с)',  OX, 'i'],
    [r'\b(зане)\b',     VA, 'i'],

    # за́повѣдь (??? заповѣ́дети)
    [r'(за)(?=повѣд[еиь](?!ти))', OX, 'i'],
    # заповѣ́далъ (! за́повѣдь за́повѣдехъ)
    [r'(заповѣ)(?=д)(?!д([иь]|е[йх]))', OX, 'i'],

    # зарѧ̀ зарѧ́ми зарю̀ ! лазарѧ
    [r'\b(зар[еѣиюѧ])\b',   VA, 'i'],
    [r'(?<!ла|на)(зарѧ)\B', OX, 'i'],
    [r'(заре)\B',           OX, 'i'],
    [r'(?<!ла)(заре)\B',    OX, 'i'],

    [r'(застꙋпа)\B', OX, 'i'],
    [r'(застꙋпи)\b', VA, 'i'],
    [r'(застꙋпи)\B', OX, 'i'],
    [r'(застꙋпл[еє])\B',    OX, 'i'],
    [r'(застꙋ)(?=пн)',      OX, 'i'],

    [r'(защити)\b', VA, 'i'],
    [r'(защища)\B', OX, 'i'],

    # зва́ти
    [r'\b((при|воз|на)?зва)(?=[нтхш]|л(?!а))', OX, 'i'],
    # воззва̀
    [r'\b((при|воз|на)?зва)\b', VA, 'i'],

    # ѕвѣ́зды ѕвѣ́здный
    [r'(ѕвѣ)(?=зд(ы\b|н))', OX, 'i'],
    # ѕвѣзда̀
    [r'(ѕвѣзд[аеѣоꙋ])\b', VA, 'i'],
    # ѕвѣздо́ю
    [r'(ѕвѣзд[ао])\B', OX, 'i'],

    [r'(ѕвѣ)(?=р[иеѣ]|рь(?!ми))',   OX, 'i'],
    [r'(ѕвѣ)(?=р[иеѧѣ]\b|ь(?!ми))', OX, 'i'],
    [r'(ѕвѣрѧ)(?=ми)',  OX, 'i'],
    [r'(ѕвѣрьми)\b',    VA, 'i'],
    # [r'ѕдѣрьми\b', r'ѕвѣрьми' + Varia, 'i'],

    [r'\b(здѣ)\b',          VA, 'i'],
    [r'\b(здѣ)(?=сь\b)',    OX, 'i'],

    [r'\b(здра)(?=в(?!л|отв))', OX, 'i'],

    [r'(ѕѣлѡ)\b',       VA, 'i'],
    [r'(ѕѣ)(?=льн)',    OX, 'i'],

    [r'(земл[еѣиѧ])\b', VA, 'i'],
    [r'(зе)(?=млю\b)',  OX, 'i'],
    [r'(земле)(?=ю\b)', OX, 'i'],
    [r'(земна)\B', OX, 'i'],
    [r'(земны)\B', OX, 'i'],

    [r'(зѣ)(?=ниц)', OX, 'i'],

    [r'\b(зижди)\B', OX, 'i'],

    [r'\b(зла)(?=т[ао](мъ)?\b)',    OX, 'i'],
    [r'\b(злата)(?=ѧ\b)',           OX, 'i'],
    [r'\b(злато)(?=([ейю]|мꙋ)\b)',  OX, 'i'],
    [r'\b(златогла)(?=в)', OX, 'i'],
    [r'\b(златоза)(?=рн)', OX, 'i'],

    [r'(ѕл[аеіѣоꙋы])\b', VA, 'i'],
    # ѕло
    [r'''
        (ѕл(
            [аеѣіы]
            |о(?=
                м
                |б(?!лені)
                |ст(н|ь\b))))
        \B
        ''',
        OX, 'i'],
    # ѻ҆ѕлобле́нїе
    [r'(ѕлобле)(?=н[іь])', OX, 'i'],

    [r'\b(ѕмі)(?=й)\b', OX, 'i'],

    [r'(зна)(?=мені)',  OX, 'i'],

    [r'(зове)(?=[мт])', OX, 'i'],
    [r'(зовꙋ)(?=[тщ])', OX, 'i'],
    [r'(зовꙋ)\b',       VA, 'i'],
    [r'(ѕо)(?=лъ)',     OX, 'i'],

    [r'\b(зра)(?=к|ц)', OX, 'i'],

    # зрѣ́ти ᲂу҆зрѣ́ти
    [r'((^[Оᲂ]у|\bпри)?зрѣ)(?=[лнтхш])', OX, 'i'],
    # зрю̀  призрѣ̀
    [r'\b((при)?зр[еѣюѧ])\b', VA, 'i'],
    [r'(зрѧ)(?=[шщ])',  OX, 'i'],
    [r'\b(зри)\b',      VA, 'i'],


    [r'(іа)(?=ков)',    OX, 'i'],
    [r'(іезекі)(?=ил)', OX, 'i'],
    # іерей
    [r'(іере)(?!м)',        OX, 'i'],
    [r'(іеремі)',           OX, 'i'],
    [r'(іерꙋсали)(?=м)',    OX, 'i'],
    [r'(ізра)(?=ил)',       OX, 'i'],
    [r'(іисꙋ)(?=с)',        OX, 'i'],
    [r'(и)(?=мам[ыъ])',     r'\1' + Iso, 'i'],
    [r'(имꙋ)(?=щ)',         OX, 'i'],
    [r'(и)(?=мѧрекъ)',      r'\1' + Iso, 'i'],
    [r'(іѻрда)(?=н)',       OX, 'i'],
    [r'(іꙋ)(?=д(\w\b|о))',  OX, 'i'],
    [r'(іꙋде)(?=\w)',       OX, 'i'],
    # і҆ѡа́ннъ
    [r'(іѡа)(?=нн(?![іи]к))', OX, 'i'],
    # і҆ѡанни́кїй
    [r'(іѡанн?[іи])(?=к)',      OX, 'i'],
    # і҆́ѡвъ
    [r'(і)(?=ѡв)',      r'\1' + Iso, 'i'],
    [r'(іѡ)(?=сиф)',    OX, 'i'],

    [r'\b(и)(?=бо\b)',      r'\1' + Iso, 'i'],
    [r'\b(и)(?=г[ао]\b)',   r'\1' + Iso, 'i'],
    [r'(игꙋ)(?=мен)',       OX, 'i'],
    [r'\b(идѣ)(?=же\b)',    OX, 'i'],

    [r'(изба)(?=в(и|ль))',  OX, 'i'],
    [r'(избавле)(?=ні)',    OX, 'i'],
    [r'(избавлѧ)\B',        OX, 'i'],
    [r'(избѣжа)(?=в)',      OX, 'i'],

    [r'(избра)\b',  VA, 'i'],
    [r'(избра)\B',  OX, 'i'],

    [r'(излива)\B',         OX, 'i'],
    [r'(излі[юѧ])\b',       VA, 'i'],
    [r'(излі[еюѧ])\B',      OX, 'i'],
    [r'(изнемог[ао])\B',    OX, 'i'],
    [r'(изнемогꙋ)\b',       VA, 'i'],
    [r'(изнемо)(?=гш)',     VA, 'i'],
    [r'(изѡбраже)(?=)',     OX, 'i'],

    [r'(изрѧ)(?=дн)',   OX, 'i'],
    [r'(изы)(?=де([мт]ъ|ши)?)', OX, 'i'],
    [r'(изы)(?=дꙋ)',    OX, 'i'],
    [r'(изыдо)',        OX, 'i'],
    # і҆́косъ
    [r'(і)(?=кос)',     r'\1' + Iso, 'i'],
    [r'(ірм)(?=ос)',    OX, 'i'],
    [r'\b(ікѡ)(?=н)',   OX, 'i'],
    [r'\b(или)\b',      VA, 'i'],
    [r'\b(и)(?=ма)',    r'\1' + Iso, 'i'],

    [r'(имѣ)\b', VA, 'i'],
    [r'(имѣ)\B', OX, 'i'],

    [r'(и)(?=мен[еи])', r'\1' + Iso, 'i'],
    [r'(имена)\b',      VA, 'i'],

    [r'\b(и)(?=(ми?|х)?же\b)',  r'\1' + Iso, 'i'],
    [r'\b(и)(?=[мх]ъ\b)',       r'\1' + Iso, 'i'],

    [r'(и)(?=мѧ)', r'\1' + Iso, 'i'],

    [r'(иногда)\b',         VA, 'i'],
    [r'(и)(?=но[кч])',      r'\1' + Iso, 'i'],
    [r'(и)(?=н[аоꙋыъ]\b)',  r'\1' + Iso, 'i'],
    [r'(ины)(?=[ѧмх])',     OX, 'i'],

    [r'(испещре)(?=н)', OX, 'i'],

    [r'(испо)(?=лнь\b)',        OX, 'i'],
    [r'(испо)(?=лни(?!тел))',   OX, 'i'],
    [r'(испо)(?=лненн)',        OX, 'i'],
    [r'(испо)(?=лнѧт)',         OX, 'i'],
    [r'(исполнѧ)(?!т)',         OX, 'i'],

    [r'(и)(?=сповѣд(ь|и\b))', r'\1' + Iso, 'i'],
    [r'(испра)(?=ви(?!тел))', OX, 'i'],
    [r'(испроси)\b',        VA, 'i'],
    [r'\b(и)(?=стин)',      r'\1' + Iso, 'i'],
    [r'\b(источа)\B',       OX, 'i'],
    [r'\b(источи)\b',       VA, 'i'],
    [r'\b(источи)\B',       OX, 'i'],
    [r'\b(исто)(?=чни)',    OX, 'i'],
    [r'\b(истоща)(?!ва)',   OX, 'i'],
    [r'\b(истощи)\B',       OX, 'i'],
    [r'\b(истощи)\b',       VA, 'i'],

    [r'(ѵссѡ)(?=п)', OX, 'i'],

    [r'(исцѣле)(?=н)',      OX, 'i'],
    [r'(исцѣлѧ)\B',         OX, 'i'],
    [r'(неисцѣ)(?=льн)',    OX, 'i'],
    [r'(исцѣл[еи])\b',      VA, 'i'],
    [r'(и)(?=щꙋщ)',         r'\1' + Iso, 'i'],

    [r'(о?лѣ)(?=п)', OX, 'i'],

    # ка́мень ка́мени
    [r'\b(ка)(?=ме?н[еѣиюьѧ]([мх][иъ])?\b)', OX, 'i'],
    [r'\b(ка)(?=менн[аоꙋы])',   OX, 'i'],
    [r'\b(канѡ)(?=н)',          OX, 'i'],

    [r'\b(ка)(?=ѧ)',        OX, 'i'],
    [r'(ка)(?=кѡ)',         OX, 'i'],
    [r'((ни)?ка)(?=коже)',  OX, 'i'],
    [r'\b(кі)(?=ими|й)',    OX, 'i'],
    [r'\b(ко)(?=е\b)',      OX, 'i'],
    [r'\b(коего)(?=жд)',    OX, 'i'],
    [r'(коли)(?=ко)',       OX, 'i'],
    [r'(колѣ)(?=н[ао](?!прекл))',   OX, 'i'],
    [r'(колѣнопреклоне)(?=н)',      OX, 'i'],

    [r'(конда)(?=къ)', OX, 'i'],

    # коне́цъ конца̀ конца́мъ
    [r'(кон[еє])(?=цъ\b)',  OX, 'i'],
    [r'(конц[аѣꙋы])\b',     VA, 'i'],
    [r'(конц[аѣ])\B',       OX, 'i'],
    [r'\b(кото)(?=р)',      OX, 'i'],

    [r'(кро)(?=ве\b)',  OX, 'i'],
    [r'(кто)\b',        VA, 'i'],

    # прекра́снаѧ
    [r'(прекра)(?=с)', OX, 'i'],
    # кра́снаѧ
    [r'\b(кра)(?=сн[аоіꙋы]\B)', OX, 'i'],
    # красны̀ красна̀
    [r'\b(красн[аы])\b', VA, 'i'],
    # красе́нъ
    [r'\b(красе)(?=нъ\b)', OX, 'i'],

    [r'(красот[аеѣоꙋы])\b', VA, 'i'],
    [r'(красото)(?=ю)',     OX, 'i'],
    [r'(красото)\b',        VA, 'i'],

    [r'(крѣ)(?=пк)',            OX, 'i'],
    [r'(кре)(?=стн)',           OX, 'i'],
    [r'(крѣ)(?=пост[іиеѣь])',   OX, 'i'],
    [r'(крест[аеѣꙋыѧ])\b',      VA, 'i'],
    [r'(крестоѡбра)(?=з)',      OX, 'i'],

    [r'(крилꙋ)\b',      r'\1' + Kamora, 'i'],  # чаще мн.ч.
    [r'(крилѣ)\b',      VA, 'i'],
    [r'(кри)(?=лъ\b)',  OX, 'i'],
    [r'(крилѧ)',        OX, 'i'],

    [r'\b(кро)(?=в(і|ь(?!ми)))', OX, 'i'],
    [r'\b(кровьми)\b',          VA, 'i'],
    [r'\b(кро)(?=в(ом)?ъ)',     OX, 'i'],

    [r'(кро)(?=т[коц])',    OX, 'i'],
    [r'\b(ктомꙋ)\b',        VA, 'i'],
    [r'(кꙋпѣ)(?=л)',        OX, 'i'],
    [r'(кꙋпин[аеоꙋы])\b',   VA, 'i'],
    [r'(кꙋпино)\B',         OX, 'i'],
    [r'\b(кꙋ)(?=ю)',        OX, 'i'],

    [r'(лѣ)(?=стви)',   OX, 'i'],
    [r'(лѣ)(?=то)',     OX, 'i'],

    # ли́къ
    [r'\bли(?=к\w\b)',    GO, 'i'],
    [r'\b(ли)(?=цъ\b)',     OX, 'i'],
    [r'\b(ликꙋ)(?=[йеюѧ])', OX, 'i'],

    [r'(літі[июѧ])',        VA, 'i'],
    [r'літꙋргі',          GO, 'i'],
    [r'\b(літꙋрги)(?!к)',   OX, 'i'],

    [r'\b(лиц[еоꙋ])\b',         VA, 'i'],
    [r'\b(лиц[еєо])(?=мъ\b)',   OX, 'i'],

    # любвѐ любы̀
    [r'(люб(в[ие]|ы))\b', VA, 'i'],
    # любо̀вь
    [r'(люби)(?=ти)',           OX, 'i'],
    [r'(люби)(?=м)',            OX, 'i'],
    [r'(любо)(?=в([їь]ю?))',   OX, 'i'],
    [r'(лю)(?=бѧщ(?!ыѧ))',      OX, 'i'],

    # лю́демъ лю́ди лю́дїе лю́дѧмъ лю́дъ лю́дстїи лю́дска
    [r'(лю)(?=д(и|іе)\b)',      OX, 'i'],
    [r'(лю)(?=дѧмъ)',           OX, 'i'],
    [r'(лю)(?=д[еєѣ][мх]ъ)',    OX, 'i'],
    [r'(лю)(?=дъ\b)',           OX, 'i'],
    [r'(лю)(?=дс(т(іи|ѣ))\b)',  OX, 'i'],
    [r'(лю)(?=дска\b)',         OX, 'i'],

    # люде́й людска́ѧ людскі́ѧ людьмѝ
    [r'(люде)(?=й)',        OX, 'i'],
    [r'(людск[аиіо])\B',    OX, 'i'],
    [r'людьми\b',         GV, 'i'],
    [r'(лю)(?=т(?!ѣ(йш|е)|а\b))', OX, 'i'],

    [r'\b(марі)(?=[еиѧю])',     OX, 'i'],
    [r'\b(маріа)(?=м)',         OX, 'i'],

    [r'''
        \b
        (
            (бого|дѣво)?
            ма
        )
        (?=
            т
            (
                и         # ма́ти
                |ер
                    (
                        [неісь] # богома́терїю
                        |и(?!нск) # богома́тери
                    ) 
            )
        )
        ''', OX, 'i'],

    # бг҃омт҃ери́нскїй
    [r'''
        (
            (бого)?
            матери
        )
        (?=нс[кт])
        ''', OX, 'i'],

    # мѣ́сто
    [r'(мѣ)(?=ст)',         OX, 'i'],
    [r'(мѣ)(?=сѧц)',        OX, 'i'],
    [r'(милосе)(?=рд)',     OX, 'i'],
    [r'(ми)(?=лост(?!ивлен))', OX, 'i'],
    [r'(ми)(?=лꙋющ)',       OX, 'i'],
    [r'\b(мѵ)(?=р\w\b)',    OX, 'i'],
    [r'\b(мѵ)(?=роно)',     r'\1' + dbl_grave, 'i'],

    # [r'\b(м)и(?=р([аеѣꙋъ]|омъ)\b)', r'\1и' + Oxia, 'i'],

    [r'\b(міхаи)(?=л)', OX, 'i'],

    [r'(младе)(?=не?[цч])', OX, 'i'],
    [r'\b((со)?мнѣ)',       OX, 'i'],
    [r'\bмнѣ\b',          GV, 'i'],
    [r'\bмене\b',         GV, 'i'],
    [r'\bменѧ\b',         GV, 'i'],
    # мно́гимъ мно́гомꙋ мно́го мно́гими
    [r'\b(мно)(?=г(о(м[ъꙋ])?|и[хм][иъ]|і[иеѧ])\b)', OX, 'i'],
    [r'\b(мно)(?=гаѧ)', OX, 'i'],
    [r'(мно)(?=жеств)', OX, 'i'],
    [r'\b(мно)(?=ю\b)', OX, 'i'],
    [r'\b(мно)(?=зи\b)', OX, 'i'],
    # [r'(мно)(?=жайш)', r'\1но' + Oxia, 'i'],

    # моѐ мою̀ моѧ̀ моѝ
    # [r'\b(мо[еиюѧ])\b', VA, 'i'],
    [r'\bмо[еиюѧ]\b', GV, 'i'],
    [r'\bмоего\b',    GV, 'i'],
    [r'\bмоегѡ\b',    GV, 'i'],
    [r'\bмоемꙋ\b',    GV, 'i'],
    # мое́й
    [r'\b(мое)(?=[йю]\b)',  OX, 'i'],
    # [r'\b(моемꙋ)\b', VA, 'i'],
    [r'\bмоеѧ\b',           GV, 'i'],
    # мои́хъ мои́мъ
    [r'\b(мои)(?=[мх]ъ\b)', OX, 'i'],
    [r'\b(мо)(?=й\b)',      OX, 'i'],
    [r'\bмѡѵсе',            GO, 'i'],

    [r'\b(моле)(?=[бн])',   OX, 'i'],
    [r'моли\b',             GV, 'i'],
    [r'(моли)(?=[лс])',     OX, 'i'],
    [r'(моли)(?=тв(?!ослов))', OX, 'i'],
    # мо́лимъ мо́лимсѧ
    [r'(мо)(?=лим)', OX, 'i'],
    [r'молю\b', GV, 'i'],
    [r'молю\B', GO, 'i'],
    [r'молѧ\b', GV, 'i'],
    [r'молѧ\B', GO, 'i'],

    [r'(мона)(?=[хш]\B)',   OX, 'i'],
    [r'(моско)(?=вс[кт])',  OX, 'i'],
    [r'(мра)(?=з)',         OX, 'i'],
    [r'(мра)(?=[кц])',      OX, 'i'],
    [r'\b(мра)(?=ч)',       OX, 'i'],

    # -мꙋ́др-
    [r'''
        (мꙋ)
        (?!
            др(
                ец
                |и(вш|[лcш])
                |[оѡ]([влт]|с(тьми|ост))
                |ѧ
                |ѣйш
            )
        )
        (?=др)
        ''', OX, 'i'],
    # мученик (! мученіе - ???)
    [r'(мꙋдрова)(?=н)',     OX, 'i'],
    [r'(мꙋ)(?=жест)',       OX, 'i'],
    [r'(мꙋ)(?=чен(?!і))',   OX, 'i'],
    [r'(мꙋче)(?=ні)',       OX, 'i'],
    [r'\bмы\b',             GV, 'i'],
    [r'(мы)(?=сленн)',      OX, 'i'],

    # ннн nnn

    [r'(надѣ)(?=[жѧю])', OX, 'i'],
    [r'(наде)(?=ж)',     OX, 'i'],
    [r'(намѣ)(?=рен)',   OX, 'i'],

    # на́мъ на́шꙋ на́шего на́съ
    [r'''
        \b
        (на)
        (?=
            (
                [мс]
                [иъ]
                |
                ш
                (
                    [аꙋыъѧ]
                    |е([йюѧ]|го|м[ꙋъ])?
                    |и([мх][аиъ])?
                )
            )
            \b
        )
        ''', OX],

    [r'\b(напа)(?=ст)',  OX, 'i'],
    [r'\bнапаѧ\B',     GO, 'i'],
    [r'\b(наро)(?=д)',   OX, 'i'],
    [r'(наслѣ)(?=д)',    OX, 'i'],
    [r'\bнаста\b',     GV, 'i'],
    [r'\b(наста)(?=ви)', OX, 'i'],
    [r'\b(наставлѧ)\B',  OX, 'i'],
    [r'\b(настоѧ)(?=щ)', OX, 'i'],
    [r'(насы)(?=ти)',    OX, 'i'],
    [r'насыща\B',      GO, 'i'],
    [r'\bнаꙋчи\b',     GV, 'i'],
    [r'\b(нача)(?=л[аоеѣꙋ]\b)', OX, 'i'],
    [r'\b(нача)(?=льн)', OX, 'i'],
    [r'\bначина\B',    GO, 'i'],
    # небеса̀
    [r'\b(небес[аеѣи])\b',   VA, 'i'],
    [r'\b(небесе)(?=[хм]ъ)', OX, 'i'],
    # не́бо не́бꙋ
    [r'\b(не)(?=б\w\b)', OX, 'i'],
    [r'\b(не)(?=бомъ)',  OX, 'i'],
    # небе́сный небе́съ
    [r'\b(небе)(?=с(н\w|ъ))', OX, 'i'],
    [r'(невѣ)(?=ст|щ)',  OX, 'i'],
    [r'(неви)(?=дим)',   OX, 'i'],
    [r'(неви)(?=нн)',    OX, 'i'],

    [r'(нѣ)(?=гдѣ\b)', OX, 'i'],
    [r'(негѡ)(?=же\b)', OX, 'i'],
    [r'(нег[оѡ])\b', VA, 'i'],
    [r'(недѣ)(?=л)', OX, 'i'],
    [r'(нѣ)(?=др)', OX, 'i'],
    [r'(недꙋ)(?=[гжз])', OX, 'i'],
    [r'\b((?:все)?нѣ)(?=жн)', OX, 'i'],
    [r'(неизглаго)(?=л)', OX, 'i'],
    [r'(неизрече)(?=нн)', OX, 'i'],
    [r'\b(не)(?=й\b)', OX, 'i'],
    [r'(не)(?=йже)', OX, 'i'],
    [r'\b(не)(?=кі(ими|й))', OX, 'i'],
    [r'(нѣ)(?=котор)', OX, 'i'],
    [r'(некта)(?=рі)', OX, 'i'],
    [r'\b(нѣ)(?=к(то|огда|ій)\b)', OX, 'i'],
    [r'\b(не)(?=мже\b)', OX, 'i'],
    [r'\b(немо)(?=лчн)', OX, 'i'],
    [r'\bнемꙋ\b', GV, 'i'],
    # нѣмы̑ѧ
    [r'\bнѣмы(?=ѧ)', r'нѣмы' + Kamora, 'i'],
    # нѣмо́й
    [r'\b(нѣм(?!ыѧ?\b|от\w)[аіоꙋы])', OX, 'i'],
    # нѣмота̀
    [r'\b(нѣмот[аꙋы])\b', VA, 'i'],
    # нѣ́мы
    [r'\b(нѣ)(?=мы\b)', OX, 'i'],

    [r'\b(непоколеби)(?=м)', OX, 'i'],
    [r'\b(непоро)(?=че?н)', OX, 'i'],
    [r'\b(непостижи)(?=м)', OX, 'i'],

    [r'\b(непреста)(?=нн)', OX, 'i'],
    [r'\b(непристꙋ)(?=п)', OX, 'i'],

    [r'(нерадѣ)(?=ні)', OX, 'i'],
    [r'\b(нерꙋши)(?=м)', OX, 'i'],

    # нѣ́си нѣ́смь нѣ́смы нѣ́сть
    [r'\b(нѣ)(?=с([мт][ыь]|и)\b)', OX, 'i'],
    [r'\bнести\b', GV, 'i'],
    [r'\b(нестрое)(?=н)', OX, 'i'],
    [r'\b(нетва)(?=рн)', OX, 'i'],
    [r'\b(не)(?=ю\b)',   OX, 'i'],
    [r'\bнеѧ\b',       GV, 'i'],
    [r'\b(неѧ)(?=же)',   OX, 'i'],

    [r'\bниже\b', GV, 'i'],
    [r'\bникогда\b', GV, 'i'],
    # нїко́лае
    [r'(ніко)(?=лае\b)', OX, 'i'],
    # нїкола́й
    [r'(нікола)(?!е\b)', OX, 'i'],
    [r'(никто)(?=же)', OX, 'i'],

    [r'\b(ни)(?=м(ъ|и?(же)?)\b)', OX, 'i'],
    [r'\b(ни)(?=х(же|ъ)\b)', OX, 'i'],

    [r'(ниспо[сш]ли)', VA, 'i'],

    [r'(нищет[аеѣꙋы])\b', VA, 'i'],
    [r'(нището)(?=ю)', OX, 'i'],
    [r'\b(ни)(?=щ[аиіꙋ])', OX, 'i'],

    # но́ваго но́вый но́вомꙋ но́выхъ
    [r'''
        \b
        (но)
        (?=
            в
            (
                а(г[оѡ]|ѧ)
                |ꙋю
                |о(г[оѡ]|[ейю]|м[ъꙋ])
                |ы([ейѧ]|[мх][аиъ])
            )\b
        )
        ''',
        OX, 'i'],

    [r'\b(нога)(?=м)', OX, 'i'],
    [r'\bнога\b', GV, 'i'],
    [r'\b(но)(?=г(ъ|зе)\b)', VA, 'i'],

    # но́чь но́щїю но́чи
    [r'\b(но)(?=[чщ](ь|ію|(?<=ч)и))', OX, 'i'],
    # нощѝ
    [r'\bнощи\b', GV, 'i'],
    [r'\b(нощн[аѣоꙋы])', OX, 'i'],

    # ны́нѣ
    [r'(ны)(?=нѣ)', OX, 'i'],

    # ооо ooo

    [r'(ѡба)(?=че)', OX, 'i'],

    [r'\b(ѡ)бъе(?=м)', r'\1б̾е' + Oxia, 'i'],
    # [r'\b([Ѡѡ])бъе(?=м(?!лите))', r'\1б̾е' + Oxia, 'i'],
    # [r'\b([Ѡѡ])бъемли(?=те)', r'\1б̾емли' + Oxia, 'i'],

    [r'(ѡбѣ)(?=сити)', OX, 'i'],

    [r'(ѻбѣ)(?=тъ)', OX, 'i'],
    [r'ѻбѣща\b', GV, 'i'],
    # ѻ҆бѣ́тъ ѻ҆бѣща́нїе ѻ҆бѣща́хомъ ѻ҆бѣща́въ
    [r'(ѻбѣща)(?=[влхшеюѧ]|ні|ти)', OX, 'i'],

    [r'(ѻби)(?=тел)', OX, 'i'],

    [r'\b(ѡ)бъиди\b', r'\1б̾иди' + Varia, 'i'],
    [r'\b(ѡ)бъиди(?=те)', r'\1б̾иди' + Oxia, 'i'],
    [r'\b(ѡ)бъидо(?=ша)', r'\1б̾идо' + Oxia, 'i'],

    [r'\b(ѡ)бъи(?=ме)', r'\1б̾и' + Oxia, 'i'],
    [r'\b(ѡ)бъи(?=мꙋт)', r'\1б̾и' + Oxia, 'i'],
    [r'\b(ѡ)бъим([иꙋ])\b', r'\1б̾им\2' + Varia, 'i'],
    [r'\b(ѡ)бъими(?=те)', r'\1б̾ими' + Oxia, 'i'],
    [r'\b(ѡ)бъима', r'\1б̾има' + Oxia, 'i'],

    [r'\b(ѡ)бъити\b', r'\1б̾ити' + Varia, 'i'],

    [r'(ѡблек[аіо])', OX, 'i'],
    [r'(ѡбле)(?=кл)', OX, 'i'],
    [r'ѡблече\b', GV, 'i'],
    [r'ѡблече\B', GO, 'i'],
    [r'ѡблецы\b', GV, 'i'],
    [r'ѡблецы\B', GO, 'i'],
    [r'ѡблеце\B', GO, 'i'],

    [r'ѡбнови\b', GV, 'i'],
    [r'ѡбнови\B', GO, 'i'],

    [r'ѡбожи\b',        GV, 'i'],
    [r'(ѡбож[аеи])\B',  OX, 'i'],

    [r'\bѡ(?=браз(?!ꙋю))', GIS, 'i'],

    [r'\b(ѡ)бъѧ\b', r'\1б̾ѧ' + Varia, 'i'],
    [r'\b(ѡ)бъѧ(?=[лтш])', r'\1б̾ѧ' + Oxia, 'i'],
    [r'\b(ѡ)бъѧ(?=сте)', r'\1б̾ѧ' + Oxia, 'i'],
    [r'\b(ѡ)бъѧд([аео])', r'\1б̾ѧд\2' + Oxia, 'i'],

    [r'(ѡбрѣ)(?=[лт]ъ\b|тені)', OX, 'i'],
    [r'(ѡбрѧ)(?=щ)', OX, 'i'],
    [r'(ѡбрѣт[ао])', OX, 'i'],
    [r'ѡбрѣсти\b', GV, 'i'],
    [r'(ѡбрѣл[аи])\b', VA, 'i'],

    # ѡ҆дѣ́ющагосѧ
    [r'(ѡдѣ)(?=ющ)',        OX, 'i'],
    [r'ѡдѣѧ\B',             GO, 'i'],
    [r'(ѡдѣва)(?=[еюѧ])',   OX, 'i'],

    [r'ѡживи\b',            GV, 'i'],
    [r'ѡживи\B',            GO, 'i'],
    [r'(ѡживле)(?!на\b)',   OX, 'i'],
    [r'ѡживлена\b',         GV, 'i'],
    [r'ѡживлѧ',             GO, 'i'],
    [r'(ѡживотвор[еиѧ])\B', OX, 'i'],
    [r'ѡживотвори\b',       GV, 'i'],

    [r'ѡжида', GO, 'i'],

    [r'ѡзари\b',        GV, 'i'],
    [r'(ѡзар[еєиѧ])\B', OX, 'i'],

    [r'ѡкропи\b', GV, 'i'],
    [r'ѡкропи\B', GO, 'i'],

    [r'ѡ(?=крест)', GIS, 'i'],

    # ѡ҆мы́й ѡ҆мы́ю
    [r'ѡмы(?!ва)', GOX, 'i'],
    # ѡ҆мыва́ти
    [r'ѡмыва\B', GOX, 'i'],

    [r'ѻна\b', GVA, 'i'],

    # ѡ҆правди́ши
    [r'ѡправд[аи]', GOX, 'i'],

    [r'ѡсѣни\b', GVA, 'i'],
    [r'ѡсѣн[еиѧ]\B', GOX, 'i'],
    # ѡ҆ста́ви
    [r'ѡста(?=в([ишья]|ль))', GOX, 'i'],
    # ѡ҆ставлѧ́ти
    [r'ѡставлѧ', GOX, 'i'],

    [r'(ѿ|ѻт)крове(?=ні)', GOX, 'i'],
    [r'([Ѿѿ])ню(?=д)', r'\1ню' + Oxia, 'i'],
    [r'([Ѿѿ])не(?=л[еєи]же)', r'\1не' + Oxia, 'i'],

    # ѻ҆тцы̀ ѻ҆те́цъ ѻ҆те́чь ѻ҆те́ческїй ѻ҆́тча ѻ҆́тчїй ѻ҆те́ческїй ѻ҆те́чество
    [r'([Ѻѻ])т([еєѣ])(?=цъ)', r'\1т\2' + Oxia, 'i'],
    [r'([Ѻѻ])тц([аеѣꙋы])\b', r'\1тц\2' + Varia, 'i'],
    [r'([Ѻѻ])тц([аеєѣо])\B', r'\1тц\2' + Oxia, 'i'],
    [r'([Ѻѻ])(?=тч([еєѣіꙋ]|и(?!зн)|а(?!ѧн)))', r'\1' + Iso, 'i'],
    [r'([Ѻѻ])те(?=ч(ь\b|ес[кт]))', r'\1те' + Oxia, 'i'],

    [r'([Ѻѻ])трокови(?=ц)', r'\1трокови' + Oxia, 'i'],
    # ѿра́до
    [r'([Ѿѿ])ра(?=д)', r'\1ра' + Oxia, 'i'],

    # отча́ѧнїе
    [r'([Ѿѿ])ча(?=ѧн)', r'\1ча' + Oxia, 'i'],

    [r'(ѡ)чи(?=с(?!титель)|щꙋ)', r'\1чи' + Oxia, 'i'],
    [r'(ѡ)чища', r'\1чища' + Oxia, 'i'],

    [r'([Ѻѻ])чи(?=ма)', r'\1чи' + Oxia, 'i'],
    [r'([Ѻѻ])(?=чи\b)', r'\1' + Iso, 'i'],

    # ппп ppp

    [r'([Пп])а(?=ве?л)', r'\1а' + Oxia, 'i'],

    [r'([Пп])аде(?=ні)', r'\1аде' + Oxia, 'i'],
    [r'([Пп])а(?=дш)', r'\1а' + Oxia, 'i'],

    [r'([Пп])а(?=ки|че)', r'\1а' + Oxia, 'i'],
    [r'([Пп])а(?=мѧ(?!то[вп]))', r'\1а' + Oxia, 'i'],
    [r'([Пп])ара(?=клис)', r'\1ара' + Oxia, 'i'],
    [r'([Пп])а(?=ст(?!([иꙋ]|рена)))', r'\1а' + Oxia, 'i'],
    [r'([Пп]астыренача)(?=льн)', OX, 'i'],
    [r'([Пп])аст?и\b', r'\g<0>' + Varia, 'i'],
    [r'([Пп]атріа)(?=р)', OX, 'i'],
    [r'([Пп])асꙋ\b', r'\g<0>' + Varia, 'i'],

    # пѣ́ти напѣ́въ (! терпѣнїе)
    [r'((?<!ер)[Пп])ѣ(?!ва)(?=[влнт])', r'\1ѣ' + Oxia, 'i'],
    # ѿпѣва́нїе
    [r'([Ѿѿ])пѣва', r'\1пѣва' + Oxia, 'i'],

    [r'([Пп])ѣ(?=сн(?!о))', r'\1ѣ' + Oxia, 'i'],

    [r'печа(?=л)', r'печа' + Oxia, 'i'],

    # пла́чь пла́чꙋщаѧ
    [r'([Пп])ла(?!чевн)(?=[чк])', r'\1ла' + Oxia, 'i'],
    # плаче́вный
    [r'([Пп])лаче(?=вн)', r'\1лаче' + Oxia, 'i'],

    [r'\b([Пп])ло(?=т[ьиі])', r'\1ло' + Oxia, 'i'],

    [r'побѣжда', r'побѣжда' + Oxia, 'i'],
    [r'побѣди', r'побѣди' + Oxia, 'i'],
    [r'побѣ(?!донос)(?=д[аиноꙋы]\b)', r'побѣ' + Oxia, 'i'],
    [r'побѣдоно(?=сн)', r'побѣдоно' + Oxia, 'i'],

    [r'([Пп])ло(?=д[нсіъ])', r'\1ло' + Oxia, 'i'],

    [r'([Пп])огиба\B', r'\1огиба' + Oxia, 'i'],
    [r'([Пп])оги(?=бш)', r'\1оги' + Oxia, 'i'],

    [r'\b([Пп])одо(?=бе?н(?!оревн))', r'\1одо' + Oxia, 'i'],

    # пое́мъ пои́мъ
    [r'\b([Пп])ое(?=мъ\b)', r'\1ое' + Oxia, 'i'],
    [r'\b([Пп])ои(?=мъ\b)', r'\1ои' + Oxia, 'i'],

    [r'([Пп])оказа\b', r'\1оказа' + Varia, 'i'],
    [r'([Пп])оказа\B', r'\1оказа' + Oxia, 'i'],

    # покаѧ́нїе
    [r'([Пп])окаѧ(?=н)', r'\1окаѧ' + Oxia, 'i'],
    # пока́ѧтисѧ
    [r'([Пп])ока(?=ѧ[стхш])', r'\1ока' + Oxia, 'i'],

    [r'([Пп])окро(?!в(енн|ител))(?=в)', r'\1окро' + Oxia, 'i'],
    [r'([Пп])окрове(?=нн)', r'\1окрове' + Oxia, 'i'],
    [r'([Пп])окрови(?=тел)', r'\1окрови' + Oxia, 'i'],

    [r'([Пп])окры\b', r'\1окры' + Varia, 'i'],
    [r'([Пп])окры(?=[ей])', r'\1окры' + Oxia, 'i'],
    [r'([Пп])окрыва\B', r'\1окрыва' + Oxia, 'i'],

    [r'([Пп])оми(?=л)', r'\1оми' + Oxia, 'i'],

    [r'([Пп])омина', r'\1омина' + Oxia, 'i'],
    [r'([Пп])омѧн([еиꙋ])\b', r'\1омѧн\2' + Varia, 'i'],
    [r'([Пп])омѧн([еиꙋ])\B', r'\1омѧн\2' + Oxia, 'i'],

    # посѣтѝ
    [r'([Пп])осѣти\b', r'\g<0>' + Varia, 'i'],
    # посѣти́ша
    [r'([Пп])осѣти\B', r'\g<0>' + Oxia, 'i'],
    # посѣщꙋ̀
    [r'([Пп])осѣщ([аꙋ])\b', r'\1осѣщ\2' + Varia, 'i'],
    # посѣща́еши
    [r'([Пп])осѣщ([ае])\B', r'\1осѣщ\2' + Oxia, 'i'],

    # по́слѣ
    [r'([Пп])о(?=слѣ\b)', r'\1о' + Oxia, 'i'],
    # послѣ́днїй
    [r'([Пп])ослѣ(?=д)', r'\1ослѣ' + Oxia, 'i'],
    # посредѝ посредѐ
    [r'([Пп])осред([еѣи])\b', r'\1осред\2' + Varia, 'i'],
    # пою́щїй
    [r'([Пп])ою(?=щ)', r'\1ою' + Oxia, 'i'],

    [r'([Пп])ощади\b', r'\1ощади' + Varia, 'i'],
    [r'([Пп])ощади\B', r'\1ощади' + Oxia, 'i'],

    [r'\bпре(?=дъ)\b', r'пре' + Oxia, 'i'],
    [r'([Пп])ра(?=вед)', r'\1ра' + Oxia, 'i'],
    [r'([Пп])редте(?=ч)', r'\1редте' + Oxia, 'i'],

    [r'([Пп])редстои', r'\1редстои' + Oxia, 'i'],
    # ??? для предстоитѐ
    # [r'([Пп])редстои\B(?!те)', r'\1редстои' + Oxia, 'i'],
    # [r'([Пп])редстоите', r'\1редстои' + Oxia, 'i'],
    [r'([Пп])редстоѧ\b', r'\1редстоѧ' + Varia, 'i'],
    [r'([Пп])редстоѧ\B', r'\1редстоѧ' + Oxia, 'i'],
    [r'([Пп])ре(?=жде)', r'\1ре' + Oxia, 'i'],

    [r'([Пп])реподо(?=б(?!но[им]))', r'\1реподо' + Oxia, 'i'],

    # преста́ти преста́й преста́ша
    [r'([Пп])реста(?=[йхш]|ти)', r'\1реста' + Oxia, 'i'],
    [r'([Пп])реста(?=вль)', r'\1реста' + Oxia, 'i'],


    [r'([Пп])речи(?=ст)', r'\1речи' + Oxia, 'i'],

    [r'([Пп])ризва(?=вн)', r'\1ризва' + Oxia, 'i'],
    [r'([Пп])ризва(?=л(?!а))', r'\1ризва' + Oxia, 'i'],
    [r'([Пп])ризвала\b', r'\1ризвала' + Varia, 'i'],

    [r'\b([Пп])ри(?=зри)', r'\1ри' + Oxia, 'i'],

    # прїидѝ
    [r'([Пп])ріид([иꙋ])\b', r'\1рїид\2' + Varia, 'i'],
    # прїиди́те
    [r'([Пп])ріид([ио])\B', r'\1рїид\2' + Oxia, 'i'],
    # прїи́демъ
    [r'([Пп])ріи(?=дем)', r'\1рїи' + Oxia, 'i'],

    [r'([Пп])ріими\b', r'\1рїими' + Varia, 'i'],

    [r'прилѣ(?=ж)', r'прилѣ' + Oxia, 'i'],
    [r'присѣща', r'присѣща' + Oxia, 'i'],
    [r'([Пп])ри(?=снѡ\b)', r'\1ри' + Oxia, 'i'],
    # приста́нище
    [r'([Пп])риста(?=н)', r'\1риста' + Oxia, 'i'],
    [r'простира', r'простира' + Oxia, 'i'],
    [r'\b([Пп])рокі(?=ме?н)', r'\1рокі' + Oxia, 'i'],
    [r'\b([Пп])роро', r'\1роро' + Oxia, 'i'],


    # ѱало́мъ
    [r'([Ѱѱ])ало(?=м)', r'\1ало' + Oxia, 'i'],
    # ѱалти́рь
    [r'([Ѱѱ])алт([иы])', r'\1алт\2' + Oxia, 'i'],
    # ѱалмы̀
    [r'([Ѱѱ])алм([аеѣы])\b', r'\1алм\2' + Varia, 'i'],
    [r'([Ѱѱ])алмопѣ(?=в)', r'\1алмопѣ' + Oxia, 'i'],

    [r'пꙋт([еѧ])(?=м[иъ])', r'пꙋт\1' + Oxia, 'i'],
    [r'пꙋ(?=т(ь|ник))', r'пꙋ' + Oxia, 'i'],

    # ра́бъ раба̀ рабы̀ рабѝ рабо́мъ рабе́хъ
    [r'\b([Рр])а(?=бъ)', r'\1а' + Oxia, 'i'],
    [r'\b([Рр])аб([аиыоꙋ])\b', r'\1аб\2' + Varia, 'i'],
    [r'\b([Рр])або(?=мъ)', r'\1або' + Oxia, 'i'],
    [r'\b([Рр])абе(?=хъ)', r'\1абе' + Oxia, 'i'],

    # ра́ди
    [r'\b([Рр])а(?=ди\b)', r'\1а' + Oxia, 'i'],
    # ра́дость ра́дꙋйсѧ ра́дꙋйтесь ра́достїю
    [r'([Рр])а(?=д(ост[еиінь]|ꙋй(сѧ|тесь)))', r'\1а' + Oxia, 'i'],
    [r'([Рр])а(?=звѣ)', r'\1а' + Oxia, 'i'],
    [r'([Рр])азꙋмѣ(?=в(?!а)|[еийлнстхшю])', r'\1азꙋмѣ' + Oxia, 'i'],

    [r'пререка', r'пререка' + Oxia, 'i'],
    # рѣ́чь
    [r'\bрѣ(?=ч[иь]|ам[иъ]\b)', r'рѣ' + Oxia, 'i'],
    # речѐ
    [r'рече\b', r'рече' + Varia, 'i'],
    # ре́клъ
    [r'(?<!мѧ)ре(?=кл?ъ)', r'ре' + Oxia, 'i'],
    # рцы̀ прорцы̀ жерцы
    [r'\b(бо|же|на)?([Рр])цы\b', r'\1\2цы' + Varia, 'i'],
    [r'\b((?:пр|тв)о)?([Рр])цы\b', r'\1\2цы' + Varia, 'i'],
    # рцы́те
    [r'рцы\B', r'рцы' + Oxia, 'i'],

    [r'([Рр])азрѣш([аеи])\B', r'\1азрѣш\2' + Oxia, 'i'],
    [r'([Рр])азрѣш([иꙋ])\b', r'\1азрѣш\2' + Varia, 'i'],
    # TODO:
    # [r'([Ѿѿ])рѣш([аеи])\B', r'\1рѣш\2' + Oxia, 'i'],
    # [r'([Ѿѿ])рѣш([иꙋ])\b', r'\1рѣш\2' + Varia, 'i'],

    # ро́дъ ро́дꙋ
    [r'ро(?=д[аеѣиꙋъ]\b)', r'ро' + Oxia, 'i'],

    [r'\bри(?=з([аеоꙋы]))', r'ри' + Oxia, 'i'],

    # рѡссі́ѧ
    [r'([Рр])ѡссі(?!ѧн)', r'\1ѡссі' + Oxia, 'i'],
    # рꙋ́сскїй
    [r'([Рр])ꙋ(?=с(ск|ь))', r'\1ꙋ' + Oxia, 'i'],
    [r'([Рр])ꙋси\b', r'\1ꙋси' + Varia, 'i'],

    [r'([Рр])ыда\B', r'\1ыда' + Varia, 'i'],
    [r'([Рр])ыда\b', r'\1ыда' + Oxia, 'i'],

    # [r'([Рр])ꙋ(?=це)', r'\1ꙋ' + Oxia, 'i'],

    # ссс sss

    [r'([Сс])аваѡ(?=ѳ)', r'\1аваѡ' + Oxia, 'i'],

    # свѣ́тъ свѣ́тлый свѣ́та свѣ́телъ
    [r'''
        # ! (свѣтисѧ свѣтлейш. 
        # свѣтозарн. свѣтоподат.
        # свѣтоносн. свѣтѧщійсѧ)
        \b
        ([Сс])вѣ
        (?!
            т
            (
                и(?!т) 
                |л
                    (
                        а\b
                        |[еѣ][ей]
                        #|о\B
                    ) 
                |о[дзлнп]
                |ѧ\B
            )

        )
        (?=т)
        ''',
     r'\1вѣ' + Oxia],
    # свѣти́сѧ свѣти́льникъ свѣти́ло
    [r'([Пп]ро|ѡ)свѣти\b', r'\1свѣти' + Varia, 'i'],
    [r'([Пп]ро|ѡ)свѣти\B', r'\1cвѣти' + Oxia, 'i'],
    [r'(много)свѣ(?=т)', r'\1cвѣ' + Oxia, 'i'],
    [r'(небо)свѣ(?=т)', r'\1cвѣ' + Oxia, 'i'],
    [r'([Сс]нѣго)свѣ(?=т)', r'\1cвѣ' + Oxia, 'i'],
    [r'([Тт]ри)свѣ(?=т)', r'\1cвѣ' + Oxia, 'i'],



    [r'([Сс])вѣти(?=л[оь]|сѧ)', r'\1вѣти' + Oxia, 'i'],
    [r'([Сс])вѣтода(?=в)', r'\1вѣтода' + Oxia, 'i'],
    [r'([Сс])вѣтоза(?=рн)', r'\1вѣтоза' + Oxia, 'i'],
    [r'([Сс])вѣтоли(?=т)', r'\1вѣтоли' + Oxia, 'i'],
    [r'([Сс])вѣтоно(?=с)', r'\1вѣтоно' + Oxia, 'i'],
    [r'([Сс])вѣтопода(?=т)', r'\1вѣтопода' + Oxia, 'i'],
    # свѣтлѣ́е свѣтлѣ́йшꙋю
    [r'([Сс])вѣтлѣ(?=[ей])', r'\1вѣтлѣ' + Oxia, 'i'],

    [r'([Сс])вирѣ(?=л)', r'\1вирѣ' + Oxia, 'i'],

    [r'([Сс])вое(ѧ|г[оѡ])\b', r'\1вое\2' + Varia, 'i'],
    [r'([Сс])во([еиюѧ])\b', r'\1во\2' + Varia, 'i'],
    [r'([Сс])вое(?=ю)', r'\1вое' + Oxia, 'i'],
    [r'\b([Сс])вои(?=[мх])', r'\1вои' + Oxia, 'i'],

    # свѧ́тъ свѧ́те
    [r'([Сс])вѧ(?=т[аеѣиоѡꙋъы]\b)',
     r'\1вѧ' + Oxia, 'i'],
    # свѧта́ѧ свѧте́й свѧтꙋ́ю свѧты́ѧ свѧти́тель
    [r'([Сс])вѧт(?P<ac>[аеѣиꙋы]\B)',
     r'\1вѧт\g<ac>' + Oxia, 'i'],
    # свѧто́е
    [r'([Сс])вѧт(?P<ac>о)(?=[ейм])',
     r'\1вѧт\g<ac>' + Oxia, 'i'],

    # свѧще́нникъ свѧще́нїе ѻ҆свѧще́нный
    [r'''
        ([Сс])вѧще
        (?=
            нн?
            (
                [аиіеѣꙋы]\B
                # ! свѧщеннолѣп- свѧщеннотайн-
                |о(?![дилт]|мон)
            )
        )
        ''',
     r'\1вѧще' + Oxia, 'i'],
    # посвѧща̀ти
    [r'свѧща\B', r'свѧща' + Oxia, 'i'],
    [r'([Сс])вѧщꙋ\b', r'\1вѧщꙋ' + Varia, 'i'],

    # себе
    [r'\b([Сс])еб([еѣє])\b', r'\1еб\2' + Varia, 'i'],
    # сего̀
    [r'\b([Сс])его\b', r'\1его' + Varia, 'i'],
    # се́й
    [r'\b([Сс])е(?=й\b)', r'\1е' + Oxia, 'i'],
    # сеѧ̀ сїѐ
    [r'\b([Сс])(еѧ|іе)\b', r'\g<0>' + Varia, 'i'],
    # сі́и
    [r'\b([Сс])і(?=и\b)', r'\1і' + Oxia, 'i'],

    [r'селе(?=ні)', r'селе' + Oxia, 'i'],

    [r'\bсе(?=мъ\b)', r'се' + Oxia, 'i'],

    # сѣ́мо
    [r'\bсѣ(?=мо\b)', r'сѣ' + Oxia, 'i'],
    # сѣ́нь
    [r'''
        сѣ(?=н
            (?!
                (
                н?[оѡ](вн|писан)
                |ен
                |[иѧ]
                )
            )
        )
        ''', r'сѣ' + Oxia, 'i'],

    [r'([Сс])ерафі(?=м)', r'\1ерафі' + Oxia, 'i'],
    [r'([Сс])е(?=рг)', r'\1е' + Oxia, 'i'],

    [r'([Сс])е(?=рдц([ꙋы]|[ѣе](мъ)?))', r'\1е' + Oxia, 'i'],
    # [r'([Сс])ердца\b', r'\1ердца' + Varia, 'i'],  # от числа.
    # [r'([Сс])ердца(?=м)', r'\1ердца' + Kamora, 'i'],

    # сѣ́ть
    [r'\bсѣ(?=т)', r'сѣ' + Oxia, 'i'],

    [r'([Сс])и(?=л([аеѣꙋы]|ою)\b)', r'\1и' + Oxia, 'i'],
    [r'([Сс])ілꙋа(?=н)', r'\1їлꙋа' + Oxia, 'i'],
    [r'\b([Сс])іѡ(?=н[аеѣоѡꙋъѧ]\b)', r'\1їѡ' + Oxia, 'i'],
    [r'си(?=рѣчь)', r'си' + Oxia, 'i'],
    # си́це
    [r'\b([Сс])и(?=це\b)', r'\1и' + Oxia, 'i'],
    # сїѐ сїѧ̀ сїю̀
    [r'\b([Сс])і([еюѧ])\b', r'\1ї\2' + Varia, 'i'],
    # cїѧ́нїе
    [r'\b([Сс])іѧ\B', r'\1їѧ' + Oxia, 'i'],

    [r'([Сс])кит([аеѣꙋы])\b', r'\1кит\2' + Varia, 'i'],
    [r'([Сс])кита\B', r'\1кита' + Oxia, 'i'],
    [r'([Сс])кито\B(?!н)', r'\1кито' + Oxia, 'i'],

    # скорбѧ́щемъ
    [r'\bскорбѧ(?=[мщ])', r'скорбѧ' + Oxia, 'i'],
    # ско́рби (! скорбѧ́щ- )
    # [r'\bско(?=рб(?!ѧ[мщ]))', r'ско' + Oxia, 'i'],
    [r'\b([Сс])ко(?=рб(е[мхн]|н|и\b|ію|ь))', r'\1ко' + Oxia, 'i'],
    [r'\b([Сс])корбѣ(?=[влнт])', r'\1корбѣ' + Oxia, 'i'],
    [r'\b([Сс])корбьми\b', r'\1корбьми' + Varia, 'i'],

    [r'\b([Сс])ко(?=рѡ)', r'\1ко' + Oxia, 'i'],

    [r'([Сс])ладча(?=йш)', r'\1ладча' + Oxia, 'i'],

    # славле́нїе
    [r'([Сс])лавл([еѧ])', r'\1лавл\2' + Oxia, 'i'],
    # славосло́вїе
    [r'([Сс])лавосло(?=в)', r'\1лавосло' + Oxia, 'i'],
    # сла́ва сла́внаѧ (! славле́н- славосло́в-)
    [r'([Сс])ла(?=в(?!ослов|л[еѧ]))', r'\1ла' + Oxia, 'i'],

    [r'([Сс])ла(?=дост(?!раст|ьми))', r'\1ла' + Oxia, 'i'],

    # сле́зъ слеза̀ слеза́ми слезѧ́щи прослези́шасѧ
    [r'слез([аꙋ])\b', r'слез\1' + Varia, 'i'],
    [r'сле(?=з(([ыъ])|н([аоꙋы])))', r'сле' + Oxia, 'i'],
    [r'слеза(?=[мх])', r'слеза' + Oxia, 'i'],
    [r'слезо(?=[йю])', r'слезо' + Oxia, 'i'],
    [r'слезѧ(?=щ)', r'слезѧ' + Oxia, 'i'],
    [r'слези(?=[хш])', r'слези' + Oxia, 'i'],

    [r'([Сс])ловес([аеиы])\b', r'\1ловес\2' + Varia, 'i'],
    [r'([Сс])ловесе(?=[мх])', r'\1ловесе' + Oxia, 'i'],
    [r'([Сс])лове(?=съ\b)', r'\1лове' + Oxia, 'i'],
    [r'([Сс])лове(?=сн)', r'\1лове' + Oxia, 'i'],
    [r'\b([Сс])ло(?=в[еѣиоꙋьыъѧ]\b)', r'\1ло' + Oxia, 'i'],
    [r'([Сс])ло(?=вомъ\b)', r'\1ло' + Oxia, 'i'],

    [r'([Сс])лꙋже\B', r'\1лꙋже' + Oxia, 'i'],

    # смире́нїе смире́нно
    [r'смире(?=н(і|н(?!омꙋд)))', r'смире' + Oxia, 'i'],
    # смиренномꙋ́дрый
    [r'смиренномꙋ(?=д)', r'смиренномꙋ' + Oxia, 'i'],

    # снѣ́гъ снѣ́жный
    [r'снѣ(?!гам|жат)(?=[гж])', r'снѣ' + Oxia, 'i'],
    [r'([Сс])обо(?=ю)', r'\1обо' + Oxia, 'i'],

    [r'([Сс])огрѣ(?=всѧ|[ейстхюѧ]|ш(а\b|ш))', r'\1огрѣ' + Oxia, 'i'],
    [r'([Сс])огрѣва', r'\1огрѣва' + Oxia, 'i'],

    [r'([Сс])окро(?=ви(?!щехр))', r'\1окро' + Oxia, 'i'],

    [r'([Сс])о(?=лнц(?!ев|зр|[оѻѡ]б|св))', r'\1о' + Oxia, 'i'],
    [r'([Сс])о(?=лнеч)', r'\1о' + Oxia, 'i'],

    [r'([Сс])офрѡ(?=н)', r'\1офрѡ' + Oxia, 'i'],

    # спа́съ спа́слъ спа́совъ спа́се спасе́нїе спасѝ спаси́тель спасо́шасѧ спаса́ти спасе́нъ спаса́ющїй
    [r'([Сс])пас[иꙋ]\b', r'\g<0>' + Varia, 'i'],
    [r'([Сс])па(?=с([аеѣ]|л?ъ|овъ)\b)', r'\1па' + Oxia, 'i'],
    [r'([Сс])пас([аеи])\B', r'\1пас\2' + Oxia, 'i'],
    [r'([Сс])пасо(?!въ)\B', r'\1пасо' + Oxia, 'i'],

    [r'([Сс])подо(?=би)', r'\1подо' + Oxia, 'i'],

    # стена́нїе стена́ньми
    [r'стена(?=н[іь])', r'стена' + Oxia, 'i'],
    [r'стенѧ(?=[йщ])', r'стенѧ' + Oxia, 'i'],
    [r'стенѧ\b', r'стенѧ' + Varia, 'i'],
    # стѣна̀
    [r'стѣн([аеѣоꙋы])\b', r'стѣн\1' + Varia, 'i'],
    # стѣно́ю
    [r'стѣно(?=ю)', r'стѣно' + Oxia, 'i'],
    # стра́ждꙋщїй стра́ждетъ
    [r'стра(?=жд(ꙋщ|е))', r'стра' + Oxia, 'i'],

    [r'\b([Сс])та(?=д[оꙋъѣ]\b)', r'\1та' + Oxia, 'i'],
    [r'\b([Сс])ти(?=хъ)', r'\1ти' + Oxia, 'i'],
    [r'\b([Сс])тіхи(?=р)', r'\1тїхи' + Oxia, 'i'],

    [r'страда(?=[влнстхш])', r'страда' + Oxia, 'i'],
    # стра́хъ стра́шный стра́се
    [r'стра(?=(х(?!ован)|ше?н(?!і)|с[еѣ]))',
     r'стра' + Oxia, 'i'],

    # стра́сть стра́сти
    [r'([Сс])тра(?=ст([иь]|но))', r'\1тра' + Oxia, 'i'],
    # страсте́мъ страстѧ́хъ
    [r'([Сс])траст(?P<ac>[еѧ])(?=[ймх])',
     r'\1траст\g<ac>' + Oxia, 'i'],
    # страстна́ѧ
    [r'([Сс])трастн(?P<ac>[аоꙋ])(?=[ейюѧ])',
     r'\1трастн\g<ac>' + Oxia, 'i'],
    # страстоте́рпецъ
    [r'([Сс])трастоте(?=рп)', r'\1трастоте' + Oxia, 'i'],

    [r'([Сс])ꙋгꙋ(?=б(?!л))', r'\1ꙋгꙋ' + Oxia, 'i'],

    # сы́нъ сыны̀ сы́номъ сы́не сыно́внїй сыново́мъ сыно́въ
    [r'\b([Сс])ыны\b', r'\1ыны' + Varia, 'i'],
    [r'\b([Сс])ы(?=н([аеѣꙋъ]|омъ)\b)', r'\1ы' + Oxia, 'i'],
    [r'\b([Сс])ыно(?=в[нъ])', r'\1ыно' + Oxia, 'i'],
    [r'\b([Сс])ынѡ(?=въ)', r'\1ынѡ' + Oxia, 'i'],
    [r'\b([Сс])ыново(?=м)', r'\1ыново' + Oxia, 'i'],
    [r'\b([Сс])ына(?=м[иъ])', r'\1ына' + Oxia, 'i'],

    [r'\b([Сс])ы(?=й\b)', r'\1ы' + Oxia, 'i'],

    # ттт tttt

    # та́къ та́коже та́кѡ та́кожде
    [r'\b([Тт])а(?=к[ѡоъ](жд?е)?\b)', r'\1а' + Oxia, 'i'],

    [r'\b([Тт])а(?=же\b)', r'\1а' + Oxia, 'i'],
    [r'\b([Тт])а(?=ѧ(же)?\b)', r'\1а' + Oxia, 'i'],
    [r'\b([Тт])ꙋ(?=ю(же)?)', r'\1ꙋ' + Oxia, 'i'],
    [r'\b([Тт])ы(?=ѧ)', r'\1ы' + Oxia, 'i'],

    # та́йна та́йнѣмъ та́йнымъ та́йномꙋ
    [r'([Тт])а(?=йн([аеѣꙋыъ]|ом[ꙋъ]))', r'\1а' + Oxia, 'i'],
    [r'([Тт])а(?=ин(ъ|ство))', r'\1а' + Oxia, 'i'],
    [r'([Тт])аи(?=нни)', r'\1аи' + Oxia, 'i'],
    [r'([Тт])а(?=йн[оѡ])', r'\1а' + Oxia, 'i'],

    [r'таѧ(?=щ)', r'таѧ' + Oxia, 'i'],

    [r'тва(?=рь)', r'тва' + Oxia, 'i'],

    [r'\b([Тт])вое\b', r'\1вое' + Varia, 'i'],
    [r'\b([Тт])во(е?ѧ)\b', r'\g<0>' + Varia, 'i'],
    [r'\b([Тт])вою\b', r'\1вою' + Varia, 'i'],
    [r'\b([Тт])вое(мꙋ|г[оѡ])\b', r'\g<0>' + Varia, 'i'],
    [r'\b([Тт])вое(?=[йю]|мъ)', r'\1вое' + Oxia, 'i'],
    [r'\b([Тт])вои\b', r'\1вои' + Varia, 'i'],
    [r'\b([Тт])вои(?=хъ)', r'\1вои' + Oxia, 'i'],
    [r'\b([Тт])вои(?=м[иъ])', r'\1вои' + Oxia, 'i'],
    [r'\b([Тт])во(?=й)', r'\1во' + Oxia, 'i'],

    [r'([Тт])вори\b', r'\1вори' + Varia, 'i'],
    [r'([Тт])вори\B', r'\1вори' + Oxia, 'i'],

    [r'\b([Тт])еб([еѣ])\b', r'\1еб\2' + Varia, 'i'],
    [r'\b([Тт])ѣ(?=мже)', r'\1ѣ' + Oxia, 'i'],

    # тѣ́ло тѣ́лꙋ
    [r'\b([Тт])ѣ(?=л\w\b)', r'\1ѣ' + Oxia, 'i'],
    # тѣле́сн-
    [r'\b([Тт])ѣле(?=сн)', r'\1ѣле' + Oxia, 'i'],
    # тѣлесѝ
    [r'\b([Тт])ѣлес([еи])\b', r'\1ѣлес\2' + Varia, 'i'],
    [r'\b([Тт])ѣлесе(?=[мх])', r'\1ѣлесе' + Oxia, 'i'],

    # тепло̀
    [r'\bтепло\b', r'тепло' + Varia, 'i'],
    # те́плый те́плой
    [r'\bте(?=пл([аеѣыꙋ]|о(?!хл|т|\b)))', r'те' + Oxia, 'i'],
    # теплота̀
    [r'\bтеплот[аеѣоꙋы]\b', r'\g<0>' + Varia, 'i'],
    # теплото́ю
    [r'\bтеплото\B', r'теплото' + Oxia, 'i'],
    # теплохла́дный
    [r'\bтеплохла(?=дн)', r'теплохла' + Oxia, 'i'],

    # терпѣ̀  терпѧ̀
    [r'([Тт])ерп([ѣиѧ])\b', r'\1ерп\2' + Varia, 'i'],
    # терпѣ́нїе
    [r'([Тт])ерпѣ\B(?!лив|ва)', r'\1ерпѣ' + Oxia, 'i'],
    # терпѣли́вый
    [r'([Тт])ерпѣли(?!во(д|мꙋд|нос|стра))(?=в)', r'\1ерпѣли' + Oxia, 'i'],
    # претерпѣва́ющи
    [r'([Тт])ерпѣва', r'\1ерпѣва' + Oxia, 'i'],

    # ти́хїй ( ! тихообразно )
    [r'\b([Тт])и(?=х(?!(а\b|о[ѻѡг])))', r'\1и' + Oxia, 'i'],
    [r'\b([Тт])иха\b', r'\1иха' + Varia, 'i'],
    [r'\b([Тт])ишин([аѣоꙋы])\b', r'\1ишин\2' + Varia, 'i'],
    [r'\b([Тт])ишино(?=ю)', r'\1ишино' + Oxia, 'i'],

    # тлѣ́нъ тлѣ́нїе нетлѣ́нный тлѣ́ть
    [r'тлѣ(?=н[інъ]|т[иь])', r'тлѣ' + Oxia, 'i'],
    # тлѝ  ! свѣ́тли  ᲂу҆ч҃тли
    [r'(?<!вѣ|уч)тли\b', r'тли' + Varia, 'i'],
    # тобо́ю
    [r'\b([Тт])обо(?=ю)', r'\1обо' + Oxia, 'i'],
    [r'\b([Тт])огда\b', r'\1огда' + Varia, 'i'],
    # то́кмѡ
    [r'то(?=кмѡ)', r'то' + Oxia, 'i'],
    # Тро́ица
    [r'\b([Тт])ро(?=[ий][цч])', r'\1ро' + Oxia, 'i'],

    # тропа́рь
    [r'\b([Тт])ропа(?=рь)', r'\1ропа' + Oxia, 'i'],
    [r'\b([Тт])ропар([еѣиѧ])\B', r'\1ропар\2' + Oxia, 'i'],
    [r'\b([Тт])ропар([еѣиюѧ])\b', r'\1ропар\2' + Varia, 'i'],

    # тьма̀ тьмѣ̀
    [r'\bтьм([аѣꙋы]\b)', r'тьм\1' + Varia, 'i'],

    # ууу uuu

    # ᲂу҆́бѡ
    [r'^([Оᲂ]у)(?=бѡ\b)', r'\1' + Iso, 'i'],
    [r'^([Оᲂ]у)бо(?=[гз])', r'\1бо' + Oxia, 'i'],
    # ᲂу҆вы̀
    [r'^([Оᲂ]у)вы\b', r'\1вы' + Varia, 'i'],
    [r'^([Оᲂ]у)гаси(?=ти)', r'\1гаси' + Oxia, 'i'],
    [r'^([Оᲂ]у)гаси\b', r'\1гаси' + Varia, 'i'],
    [r'^([Оᲂ]у)(?=гл)', r'\1' + Iso, 'i'],
    [r'^([Оᲂ]у)гото(?=в(?!лѧ))', r'\1гото' + Oxia, 'i'],
    # ᲂу҆́дъ ᲂу҆́ды
    [r'^([Оᲂ]у)(?=д[ыъ]\b)', r'\1' + Iso, 'i'],
    [r'^([Оᲂ]у)же\b', r'\g<0>' + Varia, 'i'],
    # ᲂу҆́зримъ
    [r'^([Оᲂ]у)(?=зри([мт]ъ|тсѧ|иш|ѧтъ|ю)\b)', r'\1' + Iso, 'i'],

    # )
    # JustForTest = (

    # ᲂу҆зрѣ
    [r'^([Оᲂ]у)зрѣ\b', r'\1зрѣ' + Varia, 'i'],
    # ᲂу҆зрѣша
    [r'^([Оᲂ]у)зрѣ\B', r'\1зрѣ' + Oxia, 'i'],

    # ᲂу҆́зы
    [r'^([Оᲂ]у)(?=з[ыъ]\b)', r'\1' + Iso, 'i'],
    [r'^([Оᲂ]у)краша\B', r'\1краша' + Oxia, 'i'],

    # ᲂу҆крепле́нїе ᲂу҆крѣплѧ́ше
    [r'^([Оᲂ]у)крѣпл([еѧ])', r'\1крѣпл\2' + Oxia, 'i'],
    [r'^([Оᲂ]у)крѣпи\B', r'\1крѣпи' + Oxia, 'i'],
    [r'^([Оᲂ]у)крѣпи\b', r'\1крѣпи' + Varia, 'i'],

    # ᲂу҆миле́нїе ᲂу҆миле́ннный
    [r'^([Оᲂ]у)миле(?=н)', r'\1миле' + Oxia, 'i'],
    [r'^([Оᲂ]у)ми(?=льн)', r'\1ми' + Oxia, 'i'],
    [r'^([Оᲂ]у)мира\B', r'\1мира' + Oxia, 'i'],
    # ᲂу҆́мъ ᲂу҆́мный ᲂу҆́мно ᲂу҆́ме
    [r'''
        ^
        ([Оᲂ]у)
        (?=
            м
            (
                [ъеѣ]\b # ᲂу҆́м ᲂу҆́ме
                |н
                (?!
                    [еѣ] # ! ᲂумнѣй-
                    |о\B # ! ᲂумножая
                )
            )
        )
        ''',
     r'\1' + Iso],
    # ᲂу҆мы̀ ᲂу҆мꙋ̀
    [r'^([Оᲂ]у)м([аꙋы])\b', r'\1м\2' + Varia, 'i'],

    # ᲂу҆мно́жить ᲂу҆мно́жꙋ
    [r'^([Оᲂ]у)мно(?=ж[иꙋ])', r'\1мно' + Oxia, 'i'],
    # ᲂу҆множа́ти
    [r'^([Оᲂ]у)множа(?=\w)', r'\1множа' + Oxia, 'i'],

    [r'^([Оᲂ]у)ниже(?=ні)', r'\1ниже' + Oxia, 'i'],
    [r'^([Оᲂ]у)ни(?=женн)', r'\1ни' + Oxia, 'i'],

    [r'^([Оᲂ]у)ны\b', r'\1ны' + Varia, 'i'],
    [r'^([Оᲂ]у)ны(?=[лн]|вш)', r'\1ны' + Oxia, 'i'],
    [r'^([Оᲂ]у)ныва\B', r'\1ныва' + Oxia, 'i'],

    [r'^([Оᲂ]у)пас([иꙋ])\b', r'\g<0>' + Varia, 'i'],
    [r'^([Оᲂ]у)пова\b', r'\g<0>' + Varia, 'i'],
    [r'^([Оᲂ]у)пова\B', r'\g<0>' + Oxia, 'i'],
    [r'^([Оᲂ]у)подо(?=б(?!лѧ))', r'\1подо' + Oxia, 'i'],
    [r'^([Оᲂ]у)правлѧ\B', r'\1правлѧ' + Oxia, 'i'],

    [r'^([Оᲂ]у)се(?=рд)', r'\1се' + Oxia, 'i'],
    # ᲂу҆слы́ши слы́шати
    [r'^([Оᲂ]у)?слы(?=ш)', r'\1слы' + Oxia, 'i'],
    [r'^([Оᲂ]у)спе(?=ні)', r'\1спе' + Oxia, 'i'],

    # ᲂу҆ста̀ ᲂу҆сты̀ ᲂу҆стнѐ ᲂу҆ста́хъ ᲂу҆ста́ми ᲂу҆сте́нъ ᲂу҆сте́хъ
    [r'^([Оᲂ]у)стн?([аеы])\b', r'\g<0>' + Varia, 'i'],
    [r'^([Оᲂ]устн?)а(?=[мх])', r'\1а' + Oxia, 'i'],
    [r'^([Оᲂ]у)сте(?=[нх])', r'\1сте' + Oxia, 'i'],
    [r'^([Оᲂ]у)(?=стъ)', r'\1' + Iso, 'i'],

    # ᲂу҆твердѝ
    [r'^([Оᲂ]у)тверди\b', r'\1тверди' + Varia, 'i'],
    # ᲂу҆тверди́ша
    [r'^([Оᲂ]у)тверди\B', r'\1тверди' + Oxia, 'i'],

    # ᲂу҆твержде́нный
    [r'^([Оᲂ]у)твержде(?=н)', r'\1твержде' + Oxia, 'i'],
    # ᲂу҆твержда́еши
    [r'^([Оᲂ]у)твержда(?=\w)', r'\1твержда' + Oxia, 'i'],
    [r'^([Оᲂ]у)тверже(?=ні)', r'\1тверже' + Oxia, 'i'],

    # ᲂу҆тѣ́ха
    [r'^([Оᲂ]у)тѣ(?=х\w\b)', r'\1тѣ' + Oxia, 'i'],
    # ᲂу҆тѣше́нїе
    [r'^([Оᲂ]у)тѣше(?=ні)', r'\1тѣше' + Oxia, 'i'],
    # ᲂу҆тѣ́ши ᲂу҆тѣ́шꙋ ᲂу҆тѣ́шитель ᲂу҆тѣ́шивъ
    [r'''
        ^([Оᲂ]у)тѣ
        (?=
            ш
            (
                ([иꙋ]|енъ)\b
                |и
                (
                    тел
                    # (?!ьн) #? !ᲂу҆тѣши́тельный
                    |в
                ) 
            )
        )
        ''',
     r'\1тѣ' + Oxia],

    # ᲂу҆тѣша́ти
    [r'^([Оᲂ]у)тѣша\B', r'\1тѣша' + Oxia, 'i'],
    # ᲂу҆тѣши́тельный ???
    # [r'^([Оᲂ]у)тѣши(?=тельн)', r'\1тѣши' + Oxia, 'i'],

    [r'^([Оᲂ]у)толи\b', r'\g<0>' + Varia, 'i'],
    [r'^([Оᲂ]у)толи\B', r'\g<0>' + Oxia, 'i'],
    [r'^([Оᲂ]у)толѧ\B', r'\g<0>' + Oxia, 'i'],
    [r'^([Оᲂ]у)(?=тренн)', r'\1' + Iso, 'i'],
    [r'^([Оᲂ]у)(?=тро(?![бийю]))', r'\1' + Iso, 'i'],
    [r'^([Оᲂ]у)тро(?=б)', r'\1тро' + Oxia, 'i'],
    [r'^([Оᲂ]у)чи(?=т)', r'\1чи' + Oxia, 'i'],

    # ᲂу҆́хо ᲂу҆́ши
    [r'^([Оᲂ]у)(?=[хш][оиы]\b)', r'\1' + Iso, 'i'],


    # ффф fff
    [r'фарісе', r'фарїсе' + Oxia, 'i'],
    [r'\b([Ѳѳ])ѡм([аеѣоꙋы]\b)', r'\1ѡм\2' + Varia, 'i'],

    [r'\b([Хх])вали(?=т[ни])', r'\1вали' + Oxia, 'i'],

    [r'ходи(?=ша)', r'ходи' + Oxia, 'i'],
    # хор хорови
    [r'\b([Хх])о(?=р([ъаꙋеѣ]|о(мъ|ви))\b)', r'\1о' + Oxia, 'i'],
    [r'([Хх])лѣ(?=б)', r'\1лѣ' + Oxia, 'i'],

    [r'([Ѳѳ])авѡ(?=р)', r'\1авѡ' + Oxia, 'i'],

    # храм
    [r'([Хх])ра(?=м)', r'\1ра' + Oxia, 'i'],
    # хранѝ сохрани́хомъ
    [r'(([Сс]о)?[Хх])рани\b', r'\1рани' + Varia, 'i'],
    [r'(([Сс]о)?[Хх])рани\B', r'\1рани' + Oxia, 'i'],

    # хрїсто́съ
    [r'([Хх])рісто(?=[вмс])', r'\1рїсто' + Oxia, 'i'],
    # хрїста̀
    [r'([Хх])ріст([аеѣꙋ])\b', r'\1рїст\2' + Varia, 'i'],

    # ца́рь ца́рскїй
    [r'([Цц])а(?=р([сь]))', r'\1а' + Oxia, 'i'],
    # царю̀
    [r'([Цц])ар([иеѣюѧ])\b', r'\1ар\2' + Varia, 'i'],
    # царе́ви
    [r'([Цц])ар([еє])\B', r'\1ар\2' + Oxia, 'i'],
    # цари́ца
    [r'([Цц])ари(?=ц)', r'\1ари' + Oxia, 'i'],

    # цвѣ́тъ цвѣ́те цвѣ́лъ цвѣ́томъ
    [r'''
        ([Цц])вѣ
        (?=
            (
                т
                (
                    [еѣꙋиъ]
                    |омъ
                )
            )\b
            |лъ
        )''',
     r'\1вѣ' + Oxia],

    # це́рковь це́ркви
    [r'([Цц])е(?=рк(в(?!([аѧ]м|ей))|овь))', r'\1е' + Oxia, 'i'],
    # церква́ми церквѧ́ми
    [r'([Цц])еркв([аѧ])(?=м)', r'\1еркв\2' + Oxia, 'i'],
    # церкве́й
    [r'([Цц])еркве(?=й)', r'\1еркве' + Oxia, 'i'],
    # церко́вный
    [r'([Цц])ерко(?=вн)', r'\1ерко' + Oxia, 'i'],

    [r'\b([Чч])а(?=д(?!о[лрт]))', r'\1а' + Oxia, 'i'],
    [r'\b([Чч])адолюби(?=в)', r'\1адолюби' + Oxia, 'i'],
    [r'\b([Чч])а(?=съ\b)', r'\1а' + Oxia, 'i'],
    # ча́ѧше
    [r'([Чч])а(?=ѧ)', r'\1а' + Oxia, 'i'],
    # человѣ́къ
    [r'([Чч])еловѣ(?=ч|к(?!олюб))', r'\1еловѣ' + Oxia, 'i'],
    # человѣколю́бный
    [r'([Чч])еловѣколю(?=б)', r'\1еловѣколю' + Oxia, 'i'],

    [r'([Чч])естно(?=мꙋ)', r'\1естно' + Oxia, 'i'],
    [r'([Чч])естн([аꙋы])\B', r'\1естн\2' + Oxia, 'i'],
    [r'([Чч])естно(?!с[тл])\B', r'\1естно' + Oxia, 'i'],
    [r'([Чч])естнѣ(?=йш|мъ)', r'\1естнѣ' + Oxia, 'i'],
    [r'([Чч])е(?=сть)', r'\1е' + Oxia, 'i'],

    # чи́стый чи́стꙋю чи́стей чи́стилъ
    [r'([Чч])и(?=ст(?!от|ейш|илищ|итель))', r'\1и' + Oxia, 'i'],
    # чистота̀
    [r'([Чч])истот([аеѣꙋы])\b', r'\1истот\2' + Varia, 'i'],
    # чистото́ю
    [r'([Чч])истото(?=ю)', r'\1истото' + Oxia, 'i'],
    # чисте́йшаѧ
    [r'([Чч])ист([еѣ])(?=йш)', r'\1ист\2' + Oxia, 'i'],
    # ѡ҆чисти́тельный
    [r'([Чч])исти(?=тель)', r'\1исти' + Oxia, 'i'],
    [r'([Чч])те(?=ні)', r'\1те' + Oxia, 'i'],
    [r'([Чч])то\b', r'\1то' + Varia, 'i'],
    # чꙋ́домъ чꙋ́до
    [r'([Чч])ꙋ(?=дн(?!ѣйш))', r'\1ꙋ' + Oxia, 'i'],
    [r'([Чч])ꙋ(?=до(мъ)?\b)', r'\1ꙋ' + Oxia, 'i'],
    # чꙋдесѐ чꙋдесы̀ чꙋдесе́хъ чꙋдеса́ми
    [r'([Чч])ꙋдес([аеиы])\b', r'\1ꙋдес\2' + Varia, 'i'],
    [r'([Чч])ꙋдес([аеє])(?=[мх][иъ])', r'\1ꙋдес\2' + Oxia, 'i'],

    # [r'\b([Юю])\b', r'\1_' + Apostrof, 'i'],

    [r'\b([Юю])(?=же\b)', r'\1' + Iso, 'i'],
    # ю҆нѣ́йшїй
    [r'\b([Юю])нѣ(?=йш)', r'\1нѣ' + Oxia, 'i'],
    # ю҆́ность
    [r'\b([Юю])(?!н([еєѣ]|ц([аы]|[еєѡ])))', r'\1' + Iso, 'i'],
    # ю҆нцы̀
    [r'\b([Юю])нц([аеѣꙋы])\b', r'\1нц\2' + Varia, 'i'],

    [r'\b([Ꙗꙗ])ви\b', r'\1ви' + Varia, 'i'],
    [r'\b([Ꙗꙗ])ви\B', r'\1ви' + Oxia, 'i'],
    # ꙗ҆́вѣ
    [r'\b([Ꙗꙗ])(?=вѣ\b)', r'\1' + Iso, 'i'],
    # ꙗ҆́вно ꙗ҆́вственно ꙗ҆́вльсѧ
    [r'\b([Ꙗꙗ])(?=в(ль|ст|н))', r'\1' + Iso, 'i'],

    [r'\b([Ꙗꙗ])(?=дш)', r'\1' + Iso, 'i'],
    [r'\b([Ꙗꙗ])(?=звен)', r'\1' + Iso, 'i'],
    [r'\b([Ꙗꙗ])(?=р[оѡ]ст)', r'\1' + Iso, 'i'],
    [r'\b([Ꙗꙗ])(?=(ко)?же\b)', r'\1' + Iso, 'i'],
    [r'\b([Ꙗꙗ])(?=кѡ\b)', r'\1' + Iso, 'i'],

    # ПРЕДЛОГИ + ерок
    [r'\b(и)зъ\b', r'\1з' + Erok, 'i'],
    [r'\b(н)адъ\b', r'\1ад' + Erok, 'i'],
    [r'\b(ѡ)бъ\b', r'\1б' + Erok, 'i'],
    [r'\b(п)одъ\b', r'\1од' + Erok, 'i'],
    [r'\b(п)редъ\b', r'\1ред' + Erok, 'i'],


    # Суффиксы, окончания и т.д. с ударением
    [r'(?<!мн[оѡ]ж)а(?=йш)', r'а' + Oxia, 'i'],
    # -лѧющ-
    [r'лѧ(?=ющ)', r'лѧ' + Oxia, 'i'],
    # полага́хꙋ
    [r'([гжмнрстхцчщ])а(?=хꙋ)', r'\1а' + Oxia, 'i'],
    # ѡ҆бнища́хомъ
    [r'([жзнрсчщ])а(?=хомъ)', r'\1а' + Oxia, 'i'],

    [r'', r''],
    [r'', r''],
    [r'', r''],

    # months
    [r'епте(?=мвріа)', r'епте' + Oxia, 'i'],
    [r'ктѡ(?=вріа)', r'ктѡ' + Oxia, 'i'],
    [r'ое(?=мвріа)', r'ое' + Oxia, 'i'],
    [r'еке(?=мвріа)', r'еке' + Oxia, 'i'],
    [r'(і)аннꙋа(?=ріа)', r'\1аннꙋа' + Oxia, 'i'],
    [r'еврꙋа(?=ріа)', r'еврꙋа' + Oxia, 'i'],
    [r'(м)а(?=рта)', r'\1а' + Oxia, 'i'],
    [r'прі(?=ліа)', r'прі' + Oxia, 'i'],
    [r'\b(м)а(?=іа)', r'\1а' + Oxia, 'i'],
    [r'(і)ꙋ(?=[лн]іа)', r'\1ꙋ' + Oxia, 'i'],
    [r'(а)(?=ѵгꙋста)', r'\1' + Iso, 'i'],

)

# Выставить титла
regs_titles_set = (
    [r'(?<!ѵ)([Аа])нге(?=л)', r'\1гг' + titlo, 'i'],
    [r'([Аа])посто(?=л)', r'\1п' + titlo_s, 'i'],
    [r'([Бб])лагода(?=т)', r'\1лг' + titlo_d, 'i'],
    [r'([Бб])лагосло(?=в)', r'\1лг' + titlo_s, 'i'],
    [r'([Бб])ла(?=[гж])', r'\1л' + titlo, 'i'],
    [r'''
        \b
        ([Бб])ог
        (?=
            [аеꙋъ]\b
            |а\B(?![тщ])
            |о(?!родиц|хꙋл|мерз) # ???
        )
        ''',
     r'\1г' + titlo, 'i'],
    [r'([Бб])огородиц', r'\1ц' + titlo_d, 'i'],
    [r'''
        \b
        ([Бб])ож
        (?=і|е(ств|\b))
        ''',
     r'\1ж' + titlo, 'i'],
    [r'\b([Бб])оз(?=ѣ)', r'\1з' + titlo, 'i'],
    [r'([Вв])лады(?=[кчц])', r'\1л' + titlo_d, 'i'],
    [r'([Вв])оскре(?=с\w\b)', r'\1оскр' + titlo, 'i'],
    [r'([Вв])оскресе?(?=\w\B)', r'\1оскр' + titlo_s, 'i'],
    [r'\b(г)лагол', r'\1л' + titlo, 'i'],
    [r'\b(г)ласъ', r'\1ла' + titlo_s, 'i'],
    [r'\b(г)оспод', r'\1д' + titlo_s, 'i'],
    [r'\b(г)оспо(?=ж)', r'\1п' + titlo_s, 'i'],

    [r'\b(д)ави(?=д)', r'\1в' + titlo, 'i'],

    # дѣва
    [r'''
        \b
        ([Пп]рисно)?
        ( 
            д 
        )
        (?P<remove> # <- указание удалить ударение
            ѣ
        )
        в
        (?=[аеѣиоꙋы])
        ''',
     r'\1\2в' + titlo, 'i'],

    [r'(д)ѣвс(?=тв)', r'\1в' + titlo_s, 'i'],
    [r'\b(д)ен(?=ь)', r'\1н' + titlo, 'i'],
    [r'\b(д)не(?=сь)', r'\1н' + titlo, 'i'],
    [r'\b(д)ꙋх', r'\1х' + titlo, 'i'],

    # !!! два титла
    [r'''
        \b
        ([Бб])о?г
        о?дꙋх''',
     r'\1г' + titlo + r'одх' + titlo, 'i'],

    [r'\b(д)ꙋш', r'\1ш' + titlo, 'i'],
    [r'\b(д)ꙋс(?=[еѣ]\b)', r'\1с' + titlo, 'i'],
    [r'\b(є)ѵанге(?=л)', r'\1ѵ' + titlo_g, 'i'],
    [r'(і)ерꙋса(?=л)', r'\1ер' + titlo_s, 'i'],
    [r'(і)зраи(?=л)', r'\1и' + titlo, 'i'],
    [r'(і)исꙋ(?=с)', r'\1и' + titlo, 'i'],
    [r'(и)мѧ(?=рек)', r'\1м' + titlo, 'i'],
    [r'\b(к)рес(?=т)', r'\1р' + titlo_s, 'i'],
    [r'\b(м)ар(?=(і[аеѣиюѧ]))',
     r'\1р' + titlo, 'i'],

    # ма́терь ма́ти
    [r'''
        \b
        (?P<prefix>
            (?:
                б(?:г҃|ог)о
                |д(?:ѣв|в҃)о
            )?
        )   
        (?P<m>м)ат
        (?=
            и
            |ер
        )
        ''', r'\g<prefix>\g<m>т' + titlo, 'i'],
    [r'(м)ѣсѧц(?=ъ)', r'\1ц' + titlo_s, 'i'],
    [r'(м)илосе(?=рд)', r'\1л' + titlo_s, 'i'],
    [r'(м)илос(?=т)', r'\1л' + titlo_s, 'i'],
    [r'(м)оли(?=тв)', r'\1л' + titlo, 'i'],
    [r'мꙋд(?=р)', r'м' + titlo_d, 'i'],
    [r'(м)ꙋче(?=ни[кчц])', r'\1ч' + titlo, 'i'],
    [r'(м)ладе(?=не?[чц])', r'\1л' + titlo_d, 'i'],
    [r'\b(н)еб(?=\w\b)', r'\1б' + titlo, 'i'],
    [r'\b(н)ебес(?=н)', r'\1б' + titlo_s, 'i'],
    [r'\b(н)едѣл', r'\1л' + titlo_d, 'i'],
    [r'(н)ын(?=ѣ)', r'\1н' + titlo, 'i'],
    [r'([Ѻѻ])те?ц', r'\1ц' + titlo, 'i'],  # @@@ вариат.
    [r'([Ѻѻ])те?ч(?!ест|а(ѧн|йш))', r'\1ч' + titlo, 'i'],  # @@@ вариат.
    [r'([Пп])равед(?=е?н)', r'\1рв' + titlo_d, 'i'],
    [r'([Пп])реподо(?=б(е?н))', r'\1рп' + titlo_d, 'i'],
    [r'([Пп])ред(?=теч)', r'\1р' + titlo_d, 'i'],
    [r'([Пп])рис(?=нѡ\b)', r'\1р' + titlo_s, 'i'],
    [r'([Пп])ро(?=ро[кч])', r'\1р' + titlo_o, 'i'],
    [r'([Рр])ождес(?=тв)', r'\1ж' + titlo_s, 'i'],
    [r'([Сс])вѧ([тщ])', r'\1\2' + titlo, 'i'],
    [r'([Сс])ерде?(?=[цч])', r'\1р' + titlo_d, 'i'],
    # FIXME: смр҃ть (??? вариант см҃рть)
    [r'([Сс])ме(?=рт)', r'\1м' + titlo, 'i'],
    [r'([Сс])па(?=с)', r'\1п' + titlo, 'i'],

    # страсть
    [r'''
        (?<!ладо)
        ([Сс])тр
        (?P<remove>
            а
        )
        с(?=т)
        ''', r'\1тр' + titlo_s, 'i'],
    [r'([Сс])ын(?=[аеєѣоѡꙋъ])', r'\1н' + titlo, 'i'],  # @@@ вариант.
    [r'([Тт])рои(?=[цч])', r'\1р' + titlo_o, 'i'],
    [r'(?<!нт[иі])([Хх])ріс(?=т)', r'\1р' + titlo_s, 'i'],
    [r'([Чч])ело(?=вѣ[кч])', r'\1л' + titlo, 'i'],
    [r'([Чч])ес(?=тн)', r'\1' + titlo_s, 'i'],
    [r'([Чч])ис(?=т)', r'\1' + titlo_s, 'i'],
    [r'([Цц])арс', r'\1р' + titlo_s, 'i'],
    [r'([Цц])ар(?=\w)', r'\1р' + titlo, 'i'],
    [r'([Цц])ер(?=к)', r'\1р' + titlo, 'i'],
)

# Раскрыть титла
regs_titles_open = (
    [r'([Аа])гг' + titlo, r'\1нге', 'i'],
    [r'([Аа])п' + titlo_s, r'\1посто', 'i'],
    [r'([Бб])л' + titlo + r'([гж])', r'\1ла\2', 'i'],
    [r'([Бб])лг' + titlo_d, r'\1лагода', 'i'],
    [r'([Бб])лг' + titlo_s, r'\1лагосло', 'i'],
    [r'([Бб])([гжз])' + titlo, r'\1о\2', 'i'],
    [r'([Бб])ц' + titlo_d, r'\1огородиц', 'i'],
    [r'([Вв])л' + titlo_d, r'\1лады', 'i'],
    [r'\b(г)л' + titlo, r'\1лагол', 'i'],
    [r'\b(г)ла' + titlo_s, r'\1ласъ', 'i'],
    [r'\b(г)д' + titlo_s, r'\1оспод', 'i'],
    [r'\b(г)п' + titlo_s + r'ж', r'\1оспож', 'i'],
    [r'\b(д)в' + titlo + r'д', r'\1авид', 'i'],
    [r'\b(д)в' + titlo + r'(?=[аеѣиоꙋы])', r'\1ѣв', 'i'],
    [r'(д)в' + titlo_s + r'(?=тв)', r'\1ѣвс', 'i'],
    [r'\b(д)н' + titlo + r'(?=ь)', r'\1ен', 'i'],
    [r'\b(д)н' + titlo + r'(?=сь)', r'\1не', 'i'],
    [r'(д)х' + titlo, r'\1ꙋх', 'i'],
    [r'\b(д)ш' + titlo, r'\1ꙋш', 'i'],
    [r'\b(д)с' + titlo + r'(?=[еѣ]\b)', r'\1ꙋс', 'i'],
    [r'\b(є)ѵ' + titlo_g + r'(?=л)', r'\1ѵанге', 'i'],
    [r'(і)ер' + titlo_s + r'(?=л)', r'\1ерꙋса', 'i'],
    [r'(і)и' + titlo + r'(?=л)', r'\1зраи', 'i'],
    [r'(і)и' + titlo + r'(?=с)', r'\1исꙋ', 'i'],
    [r'(и)м' + titlo + r'(?=рек)', r'\1мѧ', 'i'],
    [r'\b(к)р' + titlo_s + r'(?=т)', r'\1рес', 'i'],
    [r'\b(м)р' + titlo + r'(?=(і[аеѣиюѧ]))', r'\1ар', 'i'],
    [r'(м)т' + titlo + r'(?=и|ер)', r'\1ат', 'i'],
    [r'(м)ц' + titlo_s + r'(?=ъ)', r'\1ѣсѧц', 'i'],
    [r'(м)л' + titlo_d + r'(?=не?[чц])', r'\1ладе', 'i'],
    [r'(м)л' + titlo_s + r'(?=рд)', r'\1илосе', 'i'],
    [r'(м)л' + titlo_s + r'(?=т)', r'\1илос', 'i'],
    [r'(м)л' + titlo + r'(?=тв)', r'\1оли', 'i'],
    [r'м' + titlo_d + r'(?=р)', r'мꙋд', 'i'],
    [r'(м)ч' + titlo + r'(?=н)', r'\1ꙋче', 'i'],
    [r'\b(н)б' + titlo + r'(?=\w\b)', r'\1еб', 'i'],
    [r'\b(н)б' + titlo_s + r'(?=н)', r'\1ебес', 'i'],
    [r'\b(н)л' + titlo_d, r'\1едѣл', 'i'],
    [r'(н)н' + titlo + r'(?=ѣ)', r'\1ын', 'i'],
    [r'([Ѻѻ])ц' + titlo + r'(?=ъ)', r'\1тец', 'i'],
    [r'([Ѻѻ])ц' + titlo + r'(?=[аеєѣоꙋы])', r'\1тц', 'i'],
    [r'([Ѻѻ])ч' + titlo + r'(?=ес|н)', r'\1теч', 'i'],  #
    [r'([Ѻѻ])ч' + titlo, r'\1тч', 'i'],  #
    [r'([Пп])рв' + titlo_d + r'(?=е?н)', r'\1равед', 'i'],
    [r'([Пп])рп' + titlo_d + r'(?=б(е?н))', r'\1реподо', 'i'],
    [r'([Пп])р' + titlo_d + r'(?=теч)', r'\1ред', 'i'],
    [r'([Пп])р' + titlo_s + r'(?=нѡ\b)', r'\1рис', 'i'],
    [r'([Пп])р' + titlo_o + r'(?=ро[кч])', r'\1ро', 'i'],
    [r'([Рр])ж' + titlo_s + r'(?=тв)', r'\1ождес', 'i'],
    [r'([Сс])([тщ])' + titlo, r'\1вѧ\2', 'i'],
    [r'([Сс])р' + titlo_d + r'(?=цъ\b|чн)', r'\1ерде', 'i'],
    [r'([Сс])р' + titlo_d + r'(?=ц)', r'\1ерд', 'i'],
    [r'([Сс])мр' + titlo + r'(?=т)', r'\1мер', 'i'],
    [r'([Сс])п' + titlo + r'(?=с)', r'\1па', 'i'],
    [r'([Сс])тр' + titlo_s + r'(?=т)', r'\1трас', 'i'],
    [r'([Сс])н' + titlo + r'(?=[аеєѣоꙋъ])', r'\1ын', 'i'],  # @@@ вариат.
    [r'([Тт])р' + titlo_o + r'(?=[цч])', r'\1рои', 'i'],
    [r'([Хх])р' + titlo_s + r'(?=т)', r'\1ріс', 'i'],
    [r'([Чч])л' + titlo + r'(?=вѣ[кч])', r'\1ело', 'i'],
    [r'([Чч])' + titlo_s + r'(?=тн)', r'\1ес', 'i'],
    [r'([Чч])' + titlo_s + r'(?=т)', r'\1ис', 'i'],
    [r'([Цц])р' + titlo_s, r'\1арс', 'i'],
    [r'([Цц])р' + titlo + r'(?=\w\b)', r'\1ар', 'i'],
    [r'([Цц])р' + titlo + r'(?=иц)', r'\1ар', 'i'],
    [r'([Цц])р' + titlo + r'(?=к)', r'\1ер', 'i'],
)

# TODO: стат. анализ словаря
regs_acutes_morph = (
    # при анализе словаря
    # https://www.ponomar.net/files/wordlist.tsv
    # можно выбрать буквосочетания
    # с ударениями а также определить исключения, если их немного
    # например для -лѧю[щт]- одно исключение
    # 5     1     лѧ̑ющ     лѧющ (и҆спра́влѧюще )
    # 130   0     лѧ́ют     лѧют
    # 593   1     лѧ́ющ     лѧющ (и҆спра́влѧюще )
    #
    # 1 ст. - кол-во совпадений в словаре
    # выбранного фрагмента (3-й ст.)
    # 2 ст. - кол-во совпадений в словаре
    # для выбранного фрагмента, но без ударения (4-й ст.)
    # в скобках - полное слово для совпадения
    # (одно, в данном случае общее для -лѧ̑ющ- и -лѧ́ющ-)
)
